Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x6f3 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xc20b3): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xc599d): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x5ecc5): C:/Users/crazy/STM32CubeIDE/workspace_1.10.0/LIS3DSH_RTOS3/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0x10109): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x5b613): long long int
 <1><3e>: Abbrev Number: 3 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 8
    <40>   DW_AT_encoding    : 4	(float)
    <41>   DW_AT_name        : (indirect string, offset: 0xca1aa): long double
 <1><45>: Abbrev Number: 3 (DW_TAG_base_type)
    <46>   DW_AT_byte_size   : 1
    <47>   DW_AT_encoding    : 6	(signed char)
    <48>   DW_AT_name        : (indirect string, offset: 0x64241): signed char
 <1><4c>: Abbrev Number: 3 (DW_TAG_base_type)
    <4d>   DW_AT_byte_size   : 1
    <4e>   DW_AT_encoding    : 8	(unsigned char)
    <4f>   DW_AT_name        : (indirect string, offset: 0xc0e4a): unsigned char
 <1><53>: Abbrev Number: 3 (DW_TAG_base_type)
    <54>   DW_AT_byte_size   : 2
    <55>   DW_AT_encoding    : 5	(signed)
    <56>   DW_AT_name        : (indirect string, offset: 0x94d2d): short int
 <1><5a>: Abbrev Number: 3 (DW_TAG_base_type)
    <5b>   DW_AT_byte_size   : 2
    <5c>   DW_AT_encoding    : 7	(unsigned)
    <5d>   DW_AT_name        : (indirect string, offset: 0xbf60f): short unsigned int
 <1><61>: Abbrev Number: 3 (DW_TAG_base_type)
    <62>   DW_AT_byte_size   : 4
    <63>   DW_AT_encoding    : 5	(signed)
    <64>   DW_AT_name        : (indirect string, offset: 0x10a38): long int
 <1><68>: Abbrev Number: 4 (DW_TAG_typedef)
    <69>   DW_AT_name        : (indirect string, offset: 0x7f619): __uint32_t
    <6d>   DW_AT_decl_file   : 2
    <6e>   DW_AT_decl_line   : 79
    <6f>   DW_AT_decl_column : 25
    <70>   DW_AT_type        : <0x74>
 <1><74>: Abbrev Number: 3 (DW_TAG_base_type)
    <75>   DW_AT_byte_size   : 4
    <76>   DW_AT_encoding    : 7	(unsigned)
    <77>   DW_AT_name        : (indirect string, offset: 0x4c9a0): long unsigned int
 <1><7b>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <7c>   DW_AT_type        : <0x74>
 <1><80>: Abbrev Number: 3 (DW_TAG_base_type)
    <81>   DW_AT_byte_size   : 8
    <82>   DW_AT_encoding    : 7	(unsigned)
    <83>   DW_AT_name        : (indirect string, offset: 0x29e96): long long unsigned int
 <1><87>: Abbrev Number: 4 (DW_TAG_typedef)
    <88>   DW_AT_name        : (indirect string, offset: 0x90ff0): uint32_t
    <8c>   DW_AT_decl_file   : 3
    <8d>   DW_AT_decl_line   : 48
    <8e>   DW_AT_decl_column : 20
    <8f>   DW_AT_type        : <0x68>
 <1><93>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <94>   DW_AT_type        : <0x87>
 <1><98>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <99>   DW_AT_byte_size   : 4
 <1><9a>: Abbrev Number: 3 (DW_TAG_base_type)
    <9b>   DW_AT_byte_size   : 1
    <9c>   DW_AT_encoding    : 8	(unsigned char)
    <9d>   DW_AT_name        : (indirect string, offset: 0x411c8): char
 <1><a1>: Abbrev Number: 7 (DW_TAG_structure_type)
    <a2>   DW_AT_byte_size   : 24
    <a3>   DW_AT_decl_file   : 4
    <a4>   DW_AT_decl_line   : 345
    <a6>   DW_AT_decl_column : 9
    <a7>   DW_AT_sibling     : <0xff>
 <2><ab>: Abbrev Number: 8 (DW_TAG_member)
    <ac>   DW_AT_name        : CR
    <af>   DW_AT_decl_file   : 4
    <b0>   DW_AT_decl_line   : 347
    <b2>   DW_AT_decl_column : 17
    <b3>   DW_AT_type        : <0x93>
    <b7>   DW_AT_data_member_location: 0
 <2><b8>: Abbrev Number: 9 (DW_TAG_member)
    <b9>   DW_AT_name        : (indirect string, offset: 0x4c20a): NDTR
    <bd>   DW_AT_decl_file   : 4
    <be>   DW_AT_decl_line   : 348
    <c0>   DW_AT_decl_column : 17
    <c1>   DW_AT_type        : <0x93>
    <c5>   DW_AT_data_member_location: 4
 <2><c6>: Abbrev Number: 8 (DW_TAG_member)
    <c7>   DW_AT_name        : PAR
    <cb>   DW_AT_decl_file   : 4
    <cc>   DW_AT_decl_line   : 349
    <ce>   DW_AT_decl_column : 17
    <cf>   DW_AT_type        : <0x93>
    <d3>   DW_AT_data_member_location: 8
 <2><d4>: Abbrev Number: 9 (DW_TAG_member)
    <d5>   DW_AT_name        : (indirect string, offset: 0x53351): M0AR
    <d9>   DW_AT_decl_file   : 4
    <da>   DW_AT_decl_line   : 350
    <dc>   DW_AT_decl_column : 17
    <dd>   DW_AT_type        : <0x93>
    <e1>   DW_AT_data_member_location: 12
 <2><e2>: Abbrev Number: 9 (DW_TAG_member)
    <e3>   DW_AT_name        : (indirect string, offset: 0x6ee0b): M1AR
    <e7>   DW_AT_decl_file   : 4
    <e8>   DW_AT_decl_line   : 351
    <ea>   DW_AT_decl_column : 17
    <eb>   DW_AT_type        : <0x93>
    <ef>   DW_AT_data_member_location: 16
 <2><f0>: Abbrev Number: 8 (DW_TAG_member)
    <f1>   DW_AT_name        : FCR
    <f5>   DW_AT_decl_file   : 4
    <f6>   DW_AT_decl_line   : 352
    <f8>   DW_AT_decl_column : 17
    <f9>   DW_AT_type        : <0x93>
    <fd>   DW_AT_data_member_location: 20
 <2><fe>: Abbrev Number: 0
 <1><ff>: Abbrev Number: 10 (DW_TAG_typedef)
    <100>   DW_AT_name        : (indirect string, offset: 0xb55f5): DMA_Stream_TypeDef
    <104>   DW_AT_decl_file   : 4
    <105>   DW_AT_decl_line   : 353
    <107>   DW_AT_decl_column : 3
    <108>   DW_AT_type        : <0xa1>
 <1><10c>: Abbrev Number: 7 (DW_TAG_structure_type)
    <10d>   DW_AT_byte_size   : 84
    <10e>   DW_AT_decl_file   : 4
    <10f>   DW_AT_decl_line   : 728
    <111>   DW_AT_decl_column : 9
    <112>   DW_AT_sibling     : <0x23b>
 <2><116>: Abbrev Number: 8 (DW_TAG_member)
    <117>   DW_AT_name        : CR1
    <11b>   DW_AT_decl_file   : 4
    <11c>   DW_AT_decl_line   : 730
    <11e>   DW_AT_decl_column : 17
    <11f>   DW_AT_type        : <0x93>
    <123>   DW_AT_data_member_location: 0
 <2><124>: Abbrev Number: 8 (DW_TAG_member)
    <125>   DW_AT_name        : CR2
    <129>   DW_AT_decl_file   : 4
    <12a>   DW_AT_decl_line   : 731
    <12c>   DW_AT_decl_column : 17
    <12d>   DW_AT_type        : <0x93>
    <131>   DW_AT_data_member_location: 4
 <2><132>: Abbrev Number: 9 (DW_TAG_member)
    <133>   DW_AT_name        : (indirect string, offset: 0x3af65): SMCR
    <137>   DW_AT_decl_file   : 4
    <138>   DW_AT_decl_line   : 732
    <13a>   DW_AT_decl_column : 17
    <13b>   DW_AT_type        : <0x93>
    <13f>   DW_AT_data_member_location: 8
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x40fe5): DIER
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 733
    <148>   DW_AT_decl_column : 17
    <149>   DW_AT_type        : <0x93>
    <14d>   DW_AT_data_member_location: 12
 <2><14e>: Abbrev Number: 8 (DW_TAG_member)
    <14f>   DW_AT_name        : SR
    <152>   DW_AT_decl_file   : 4
    <153>   DW_AT_decl_line   : 734
    <155>   DW_AT_decl_column : 17
    <156>   DW_AT_type        : <0x93>
    <15a>   DW_AT_data_member_location: 16
 <2><15b>: Abbrev Number: 8 (DW_TAG_member)
    <15c>   DW_AT_name        : EGR
    <160>   DW_AT_decl_file   : 4
    <161>   DW_AT_decl_line   : 735
    <163>   DW_AT_decl_column : 17
    <164>   DW_AT_type        : <0x93>
    <168>   DW_AT_data_member_location: 20
 <2><169>: Abbrev Number: 9 (DW_TAG_member)
    <16a>   DW_AT_name        : (indirect string, offset: 0xb63aa): CCMR1
    <16e>   DW_AT_decl_file   : 4
    <16f>   DW_AT_decl_line   : 736
    <171>   DW_AT_decl_column : 17
    <172>   DW_AT_type        : <0x93>
    <176>   DW_AT_data_member_location: 24
 <2><177>: Abbrev Number: 9 (DW_TAG_member)
    <178>   DW_AT_name        : (indirect string, offset: 0x4ff57): CCMR2
    <17c>   DW_AT_decl_file   : 4
    <17d>   DW_AT_decl_line   : 737
    <17f>   DW_AT_decl_column : 17
    <180>   DW_AT_type        : <0x93>
    <184>   DW_AT_data_member_location: 28
 <2><185>: Abbrev Number: 9 (DW_TAG_member)
    <186>   DW_AT_name        : (indirect string, offset: 0x30d6f): CCER
    <18a>   DW_AT_decl_file   : 4
    <18b>   DW_AT_decl_line   : 738
    <18d>   DW_AT_decl_column : 17
    <18e>   DW_AT_type        : <0x93>
    <192>   DW_AT_data_member_location: 32
 <2><193>: Abbrev Number: 8 (DW_TAG_member)
    <194>   DW_AT_name        : CNT
    <198>   DW_AT_decl_file   : 4
    <199>   DW_AT_decl_line   : 739
    <19b>   DW_AT_decl_column : 17
    <19c>   DW_AT_type        : <0x93>
    <1a0>   DW_AT_data_member_location: 36
 <2><1a1>: Abbrev Number: 8 (DW_TAG_member)
    <1a2>   DW_AT_name        : PSC
    <1a6>   DW_AT_decl_file   : 4
    <1a7>   DW_AT_decl_line   : 740
    <1a9>   DW_AT_decl_column : 17
    <1aa>   DW_AT_type        : <0x93>
    <1ae>   DW_AT_data_member_location: 40
 <2><1af>: Abbrev Number: 8 (DW_TAG_member)
    <1b0>   DW_AT_name        : ARR
    <1b4>   DW_AT_decl_file   : 4
    <1b5>   DW_AT_decl_line   : 741
    <1b7>   DW_AT_decl_column : 17
    <1b8>   DW_AT_type        : <0x93>
    <1bc>   DW_AT_data_member_location: 44
 <2><1bd>: Abbrev Number: 8 (DW_TAG_member)
    <1be>   DW_AT_name        : RCR
    <1c2>   DW_AT_decl_file   : 4
    <1c3>   DW_AT_decl_line   : 742
    <1c5>   DW_AT_decl_column : 17
    <1c6>   DW_AT_type        : <0x93>
    <1ca>   DW_AT_data_member_location: 48
 <2><1cb>: Abbrev Number: 9 (DW_TAG_member)
    <1cc>   DW_AT_name        : (indirect string, offset: 0x17e09): CCR1
    <1d0>   DW_AT_decl_file   : 4
    <1d1>   DW_AT_decl_line   : 743
    <1d3>   DW_AT_decl_column : 17
    <1d4>   DW_AT_type        : <0x93>
    <1d8>   DW_AT_data_member_location: 52
 <2><1d9>: Abbrev Number: 9 (DW_TAG_member)
    <1da>   DW_AT_name        : (indirect string, offset: 0x53e8c): CCR2
    <1de>   DW_AT_decl_file   : 4
    <1df>   DW_AT_decl_line   : 744
    <1e1>   DW_AT_decl_column : 17
    <1e2>   DW_AT_type        : <0x93>
    <1e6>   DW_AT_data_member_location: 56
 <2><1e7>: Abbrev Number: 9 (DW_TAG_member)
    <1e8>   DW_AT_name        : (indirect string, offset: 0x98930): CCR3
    <1ec>   DW_AT_decl_file   : 4
    <1ed>   DW_AT_decl_line   : 745
    <1ef>   DW_AT_decl_column : 17
    <1f0>   DW_AT_type        : <0x93>
    <1f4>   DW_AT_data_member_location: 60
 <2><1f5>: Abbrev Number: 9 (DW_TAG_member)
    <1f6>   DW_AT_name        : (indirect string, offset: 0xc403): CCR4
    <1fa>   DW_AT_decl_file   : 4
    <1fb>   DW_AT_decl_line   : 746
    <1fd>   DW_AT_decl_column : 17
    <1fe>   DW_AT_type        : <0x93>
    <202>   DW_AT_data_member_location: 64
 <2><203>: Abbrev Number: 9 (DW_TAG_member)
    <204>   DW_AT_name        : (indirect string, offset: 0x54a2f): BDTR
    <208>   DW_AT_decl_file   : 4
    <209>   DW_AT_decl_line   : 747
    <20b>   DW_AT_decl_column : 17
    <20c>   DW_AT_type        : <0x93>
    <210>   DW_AT_data_member_location: 68
 <2><211>: Abbrev Number: 8 (DW_TAG_member)
    <212>   DW_AT_name        : DCR
    <216>   DW_AT_decl_file   : 4
    <217>   DW_AT_decl_line   : 748
    <219>   DW_AT_decl_column : 17
    <21a>   DW_AT_type        : <0x93>
    <21e>   DW_AT_data_member_location: 72
 <2><21f>: Abbrev Number: 9 (DW_TAG_member)
    <220>   DW_AT_name        : (indirect string, offset: 0xab80b): DMAR
    <224>   DW_AT_decl_file   : 4
    <225>   DW_AT_decl_line   : 749
    <227>   DW_AT_decl_column : 17
    <228>   DW_AT_type        : <0x93>
    <22c>   DW_AT_data_member_location: 76
 <2><22d>: Abbrev Number: 8 (DW_TAG_member)
    <22e>   DW_AT_name        : OR
    <231>   DW_AT_decl_file   : 4
    <232>   DW_AT_decl_line   : 750
    <234>   DW_AT_decl_column : 17
    <235>   DW_AT_type        : <0x93>
    <239>   DW_AT_data_member_location: 80
 <2><23a>: Abbrev Number: 0
 <1><23b>: Abbrev Number: 10 (DW_TAG_typedef)
    <23c>   DW_AT_name        : (indirect string, offset: 0xbd308): TIM_TypeDef
    <240>   DW_AT_decl_file   : 4
    <241>   DW_AT_decl_line   : 751
    <243>   DW_AT_decl_column : 3
    <244>   DW_AT_type        : <0x10c>
 <1><248>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <249>   DW_AT_encoding    : 7	(unsigned)
    <24a>   DW_AT_byte_size   : 1
    <24b>   DW_AT_type        : <0x4c>
    <24f>   DW_AT_decl_file   : 5
    <250>   DW_AT_decl_line   : 39
    <251>   DW_AT_decl_column : 1
    <252>   DW_AT_sibling     : <0x26f>
 <2><256>: Abbrev Number: 12 (DW_TAG_enumerator)
    <257>   DW_AT_name        : (indirect string, offset: 0x43ace): HAL_OK
    <25b>   DW_AT_const_value : 0
 <2><25c>: Abbrev Number: 12 (DW_TAG_enumerator)
    <25d>   DW_AT_name        : (indirect string, offset: 0x7d25e): HAL_ERROR
    <261>   DW_AT_const_value : 1
 <2><262>: Abbrev Number: 12 (DW_TAG_enumerator)
    <263>   DW_AT_name        : (indirect string, offset: 0x23456): HAL_BUSY
    <267>   DW_AT_const_value : 2
 <2><268>: Abbrev Number: 12 (DW_TAG_enumerator)
    <269>   DW_AT_name        : (indirect string, offset: 0x3aeae): HAL_TIMEOUT
    <26d>   DW_AT_const_value : 3
 <2><26e>: Abbrev Number: 0
 <1><26f>: Abbrev Number: 4 (DW_TAG_typedef)
    <270>   DW_AT_name        : (indirect string, offset: 0x2345): HAL_StatusTypeDef
    <274>   DW_AT_decl_file   : 5
    <275>   DW_AT_decl_line   : 44
    <276>   DW_AT_decl_column : 3
    <277>   DW_AT_type        : <0x248>
 <1><27b>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <27c>   DW_AT_encoding    : 7	(unsigned)
    <27d>   DW_AT_byte_size   : 1
    <27e>   DW_AT_type        : <0x4c>
    <282>   DW_AT_decl_file   : 5
    <283>   DW_AT_decl_line   : 50
    <284>   DW_AT_decl_column : 1
    <285>   DW_AT_sibling     : <0x296>
 <2><289>: Abbrev Number: 12 (DW_TAG_enumerator)
    <28a>   DW_AT_name        : (indirect string, offset: 0x93af7): HAL_UNLOCKED
    <28e>   DW_AT_const_value : 0
 <2><28f>: Abbrev Number: 12 (DW_TAG_enumerator)
    <290>   DW_AT_name        : (indirect string, offset: 0xc7f50): HAL_LOCKED
    <294>   DW_AT_const_value : 1
 <2><295>: Abbrev Number: 0
 <1><296>: Abbrev Number: 4 (DW_TAG_typedef)
    <297>   DW_AT_name        : (indirect string, offset: 0x7647f): HAL_LockTypeDef
    <29b>   DW_AT_decl_file   : 5
    <29c>   DW_AT_decl_line   : 53
    <29d>   DW_AT_decl_column : 3
    <29e>   DW_AT_type        : <0x27b>
 <1><2a2>: Abbrev Number: 13 (DW_TAG_structure_type)
    <2a3>   DW_AT_byte_size   : 48
    <2a4>   DW_AT_decl_file   : 6
    <2a5>   DW_AT_decl_line   : 48
    <2a6>   DW_AT_decl_column : 9
    <2a7>   DW_AT_sibling     : <0x348>
 <2><2ab>: Abbrev Number: 14 (DW_TAG_member)
    <2ac>   DW_AT_name        : (indirect string, offset: 0x681ab): Channel
    <2b0>   DW_AT_decl_file   : 6
    <2b1>   DW_AT_decl_line   : 50
    <2b2>   DW_AT_decl_column : 12
    <2b3>   DW_AT_type        : <0x87>
    <2b7>   DW_AT_data_member_location: 0
 <2><2b8>: Abbrev Number: 14 (DW_TAG_member)
    <2b9>   DW_AT_name        : (indirect string, offset: 0x4a647): Direction
    <2bd>   DW_AT_decl_file   : 6
    <2be>   DW_AT_decl_line   : 53
    <2bf>   DW_AT_decl_column : 12
    <2c0>   DW_AT_type        : <0x87>
    <2c4>   DW_AT_data_member_location: 4
 <2><2c5>: Abbrev Number: 14 (DW_TAG_member)
    <2c6>   DW_AT_name        : (indirect string, offset: 0xcfe6): PeriphInc
    <2ca>   DW_AT_decl_file   : 6
    <2cb>   DW_AT_decl_line   : 57
    <2cc>   DW_AT_decl_column : 12
    <2cd>   DW_AT_type        : <0x87>
    <2d1>   DW_AT_data_member_location: 8
 <2><2d2>: Abbrev Number: 14 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0x1f458): MemInc
    <2d7>   DW_AT_decl_file   : 6
    <2d8>   DW_AT_decl_line   : 60
    <2d9>   DW_AT_decl_column : 12
    <2da>   DW_AT_type        : <0x87>
    <2de>   DW_AT_data_member_location: 12
 <2><2df>: Abbrev Number: 14 (DW_TAG_member)
    <2e0>   DW_AT_name        : (indirect string, offset: 0x63563): PeriphDataAlignment
    <2e4>   DW_AT_decl_file   : 6
    <2e5>   DW_AT_decl_line   : 63
    <2e6>   DW_AT_decl_column : 12
    <2e7>   DW_AT_type        : <0x87>
    <2eb>   DW_AT_data_member_location: 16
 <2><2ec>: Abbrev Number: 14 (DW_TAG_member)
    <2ed>   DW_AT_name        : (indirect string, offset: 0xb4ac2): MemDataAlignment
    <2f1>   DW_AT_decl_file   : 6
    <2f2>   DW_AT_decl_line   : 66
    <2f3>   DW_AT_decl_column : 12
    <2f4>   DW_AT_type        : <0x87>
    <2f8>   DW_AT_data_member_location: 20
 <2><2f9>: Abbrev Number: 14 (DW_TAG_member)
    <2fa>   DW_AT_name        : (indirect string, offset: 0xd29a0): Mode
    <2fe>   DW_AT_decl_file   : 6
    <2ff>   DW_AT_decl_line   : 69
    <300>   DW_AT_decl_column : 12
    <301>   DW_AT_type        : <0x87>
    <305>   DW_AT_data_member_location: 24
 <2><306>: Abbrev Number: 14 (DW_TAG_member)
    <307>   DW_AT_name        : (indirect string, offset: 0xd1750): Priority
    <30b>   DW_AT_decl_file   : 6
    <30c>   DW_AT_decl_line   : 74
    <30d>   DW_AT_decl_column : 12
    <30e>   DW_AT_type        : <0x87>
    <312>   DW_AT_data_member_location: 28
 <2><313>: Abbrev Number: 14 (DW_TAG_member)
    <314>   DW_AT_name        : (indirect string, offset: 0x56408): FIFOMode
    <318>   DW_AT_decl_file   : 6
    <319>   DW_AT_decl_line   : 77
    <31a>   DW_AT_decl_column : 12
    <31b>   DW_AT_type        : <0x87>
    <31f>   DW_AT_data_member_location: 32
 <2><320>: Abbrev Number: 14 (DW_TAG_member)
    <321>   DW_AT_name        : (indirect string, offset: 0x97e1c): FIFOThreshold
    <325>   DW_AT_decl_file   : 6
    <326>   DW_AT_decl_line   : 82
    <327>   DW_AT_decl_column : 12
    <328>   DW_AT_type        : <0x87>
    <32c>   DW_AT_data_member_location: 36
 <2><32d>: Abbrev Number: 14 (DW_TAG_member)
    <32e>   DW_AT_name        : (indirect string, offset: 0x960ce): MemBurst
    <332>   DW_AT_decl_file   : 6
    <333>   DW_AT_decl_line   : 85
    <334>   DW_AT_decl_column : 12
    <335>   DW_AT_type        : <0x87>
    <339>   DW_AT_data_member_location: 40
 <2><33a>: Abbrev Number: 14 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x44903): PeriphBurst
    <33f>   DW_AT_decl_file   : 6
    <340>   DW_AT_decl_line   : 91
    <341>   DW_AT_decl_column : 12
    <342>   DW_AT_type        : <0x87>
    <346>   DW_AT_data_member_location: 44
 <2><347>: Abbrev Number: 0
 <1><348>: Abbrev Number: 4 (DW_TAG_typedef)
    <349>   DW_AT_name        : (indirect string, offset: 0x35e7d): DMA_InitTypeDef
    <34d>   DW_AT_decl_file   : 6
    <34e>   DW_AT_decl_line   : 96
    <34f>   DW_AT_decl_column : 2
    <350>   DW_AT_type        : <0x2a2>
 <1><354>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <355>   DW_AT_encoding    : 7	(unsigned)
    <356>   DW_AT_byte_size   : 1
    <357>   DW_AT_type        : <0x4c>
    <35b>   DW_AT_decl_file   : 6
    <35c>   DW_AT_decl_line   : 103
    <35d>   DW_AT_decl_column : 1
    <35e>   DW_AT_sibling     : <0x387>
 <2><362>: Abbrev Number: 12 (DW_TAG_enumerator)
    <363>   DW_AT_name        : (indirect string, offset: 0x95052): HAL_DMA_STATE_RESET
    <367>   DW_AT_const_value : 0
 <2><368>: Abbrev Number: 12 (DW_TAG_enumerator)
    <369>   DW_AT_name        : (indirect string, offset: 0x37254): HAL_DMA_STATE_READY
    <36d>   DW_AT_const_value : 1
 <2><36e>: Abbrev Number: 12 (DW_TAG_enumerator)
    <36f>   DW_AT_name        : (indirect string, offset: 0x89f17): HAL_DMA_STATE_BUSY
    <373>   DW_AT_const_value : 2
 <2><374>: Abbrev Number: 12 (DW_TAG_enumerator)
    <375>   DW_AT_name        : (indirect string, offset: 0xc4e23): HAL_DMA_STATE_TIMEOUT
    <379>   DW_AT_const_value : 3
 <2><37a>: Abbrev Number: 12 (DW_TAG_enumerator)
    <37b>   DW_AT_name        : (indirect string, offset: 0x978a4): HAL_DMA_STATE_ERROR
    <37f>   DW_AT_const_value : 4
 <2><380>: Abbrev Number: 12 (DW_TAG_enumerator)
    <381>   DW_AT_name        : (indirect string, offset: 0x4e5d5): HAL_DMA_STATE_ABORT
    <385>   DW_AT_const_value : 5
 <2><386>: Abbrev Number: 0
 <1><387>: Abbrev Number: 4 (DW_TAG_typedef)
    <388>   DW_AT_name        : (indirect string, offset: 0xb3ec1): HAL_DMA_StateTypeDef
    <38c>   DW_AT_decl_file   : 6
    <38d>   DW_AT_decl_line   : 110
    <38e>   DW_AT_decl_column : 2
    <38f>   DW_AT_type        : <0x354>
 <1><393>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <394>   DW_AT_type        : <0x387>
 <1><398>: Abbrev Number: 15 (DW_TAG_structure_type)
    <399>   DW_AT_name        : (indirect string, offset: 0xa9e05): __DMA_HandleTypeDef
    <39d>   DW_AT_byte_size   : 96
    <39e>   DW_AT_decl_file   : 6
    <39f>   DW_AT_decl_line   : 138
    <3a0>   DW_AT_decl_column : 16
    <3a1>   DW_AT_sibling     : <0x45c>
 <2><3a5>: Abbrev Number: 14 (DW_TAG_member)
    <3a6>   DW_AT_name        : (indirect string, offset: 0xc1295): Instance
    <3aa>   DW_AT_decl_file   : 6
    <3ab>   DW_AT_decl_line   : 140
    <3ac>   DW_AT_decl_column : 31
    <3ad>   DW_AT_type        : <0x45c>
    <3b1>   DW_AT_data_member_location: 0
 <2><3b2>: Abbrev Number: 14 (DW_TAG_member)
    <3b3>   DW_AT_name        : (indirect string, offset: 0xcc3b4): Init
    <3b7>   DW_AT_decl_file   : 6
    <3b8>   DW_AT_decl_line   : 142
    <3b9>   DW_AT_decl_column : 30
    <3ba>   DW_AT_type        : <0x348>
    <3be>   DW_AT_data_member_location: 4
 <2><3bf>: Abbrev Number: 14 (DW_TAG_member)
    <3c0>   DW_AT_name        : (indirect string, offset: 0x8e29c): Lock
    <3c4>   DW_AT_decl_file   : 6
    <3c5>   DW_AT_decl_line   : 144
    <3c6>   DW_AT_decl_column : 30
    <3c7>   DW_AT_type        : <0x296>
    <3cb>   DW_AT_data_member_location: 52
 <2><3cc>: Abbrev Number: 14 (DW_TAG_member)
    <3cd>   DW_AT_name        : (indirect string, offset: 0xcd692): State
    <3d1>   DW_AT_decl_file   : 6
    <3d2>   DW_AT_decl_line   : 146
    <3d3>   DW_AT_decl_column : 30
    <3d4>   DW_AT_type        : <0x393>
    <3d8>   DW_AT_data_member_location: 53
 <2><3d9>: Abbrev Number: 14 (DW_TAG_member)
    <3da>   DW_AT_name        : (indirect string, offset: 0xbe12b): Parent
    <3de>   DW_AT_decl_file   : 6
    <3df>   DW_AT_decl_line   : 148
    <3e0>   DW_AT_decl_column : 31
    <3e1>   DW_AT_type        : <0x98>
    <3e5>   DW_AT_data_member_location: 56
 <2><3e6>: Abbrev Number: 14 (DW_TAG_member)
    <3e7>   DW_AT_name        : (indirect string, offset: 0xc72c3): XferCpltCallback
    <3eb>   DW_AT_decl_file   : 6
    <3ec>   DW_AT_decl_line   : 150
    <3ed>   DW_AT_decl_column : 33
    <3ee>   DW_AT_type        : <0x473>
    <3f2>   DW_AT_data_member_location: 60
 <2><3f3>: Abbrev Number: 14 (DW_TAG_member)
    <3f4>   DW_AT_name        : (indirect string, offset: 0x9b422): XferHalfCpltCallback
    <3f8>   DW_AT_decl_file   : 6
    <3f9>   DW_AT_decl_line   : 152
    <3fa>   DW_AT_decl_column : 33
    <3fb>   DW_AT_type        : <0x473>
    <3ff>   DW_AT_data_member_location: 64
 <2><400>: Abbrev Number: 14 (DW_TAG_member)
    <401>   DW_AT_name        : (indirect string, offset: 0x75aaf): XferM1CpltCallback
    <405>   DW_AT_decl_file   : 6
    <406>   DW_AT_decl_line   : 154
    <407>   DW_AT_decl_column : 33
    <408>   DW_AT_type        : <0x473>
    <40c>   DW_AT_data_member_location: 68
 <2><40d>: Abbrev Number: 14 (DW_TAG_member)
    <40e>   DW_AT_name        : (indirect string, offset: 0x6033f): XferM1HalfCpltCallback
    <412>   DW_AT_decl_file   : 6
    <413>   DW_AT_decl_line   : 156
    <414>   DW_AT_decl_column : 33
    <415>   DW_AT_type        : <0x473>
    <419>   DW_AT_data_member_location: 72
 <2><41a>: Abbrev Number: 14 (DW_TAG_member)
    <41b>   DW_AT_name        : (indirect string, offset: 0x1cbf6): XferErrorCallback
    <41f>   DW_AT_decl_file   : 6
    <420>   DW_AT_decl_line   : 158
    <421>   DW_AT_decl_column : 33
    <422>   DW_AT_type        : <0x473>
    <426>   DW_AT_data_member_location: 76
 <2><427>: Abbrev Number: 14 (DW_TAG_member)
    <428>   DW_AT_name        : (indirect string, offset: 0xba837): XferAbortCallback
    <42c>   DW_AT_decl_file   : 6
    <42d>   DW_AT_decl_line   : 160
    <42e>   DW_AT_decl_column : 33
    <42f>   DW_AT_type        : <0x473>
    <433>   DW_AT_data_member_location: 80
 <2><434>: Abbrev Number: 14 (DW_TAG_member)
    <435>   DW_AT_name        : (indirect string, offset: 0xc35bc): ErrorCode
    <439>   DW_AT_decl_file   : 6
    <43a>   DW_AT_decl_line   : 162
    <43b>   DW_AT_decl_column : 30
    <43c>   DW_AT_type        : <0x93>
    <440>   DW_AT_data_member_location: 84
 <2><441>: Abbrev Number: 14 (DW_TAG_member)
    <442>   DW_AT_name        : (indirect string, offset: 0x597da): StreamBaseAddress
    <446>   DW_AT_decl_file   : 6
    <447>   DW_AT_decl_line   : 164
    <448>   DW_AT_decl_column : 30
    <449>   DW_AT_type        : <0x87>
    <44d>   DW_AT_data_member_location: 88
 <2><44e>: Abbrev Number: 14 (DW_TAG_member)
    <44f>   DW_AT_name        : (indirect string, offset: 0xa7e6a): StreamIndex
    <453>   DW_AT_decl_file   : 6
    <454>   DW_AT_decl_line   : 166
    <455>   DW_AT_decl_column : 30
    <456>   DW_AT_type        : <0x87>
    <45a>   DW_AT_data_member_location: 92
 <2><45b>: Abbrev Number: 0
 <1><45c>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <45d>   DW_AT_byte_size   : 4
    <45e>   DW_AT_type        : <0xff>
 <1><462>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <463>   DW_AT_prototyped  : 1
    <463>   DW_AT_sibling     : <0x46d>
 <2><467>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <468>   DW_AT_type        : <0x46d>
 <2><46c>: Abbrev Number: 0
 <1><46d>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <46e>   DW_AT_byte_size   : 4
    <46f>   DW_AT_type        : <0x398>
 <1><473>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <474>   DW_AT_byte_size   : 4
    <475>   DW_AT_type        : <0x462>
 <1><479>: Abbrev Number: 4 (DW_TAG_typedef)
    <47a>   DW_AT_name        : (indirect string, offset: 0xa9e07): DMA_HandleTypeDef
    <47e>   DW_AT_decl_file   : 6
    <47f>   DW_AT_decl_line   : 168
    <480>   DW_AT_decl_column : 2
    <481>   DW_AT_type        : <0x398>
 <1><485>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <486>   DW_AT_byte_size   : 4
    <487>   DW_AT_type        : <0x479>
 <1><48b>: Abbrev Number: 13 (DW_TAG_structure_type)
    <48c>   DW_AT_byte_size   : 24
    <48d>   DW_AT_decl_file   : 7
    <48e>   DW_AT_decl_line   : 46
    <48f>   DW_AT_decl_column : 9
    <490>   DW_AT_sibling     : <0x4e3>
 <2><494>: Abbrev Number: 14 (DW_TAG_member)
    <495>   DW_AT_name        : (indirect string, offset: 0xcf71c): Prescaler
    <499>   DW_AT_decl_file   : 7
    <49a>   DW_AT_decl_line   : 48
    <49b>   DW_AT_decl_column : 12
    <49c>   DW_AT_type        : <0x87>
    <4a0>   DW_AT_data_member_location: 0
 <2><4a1>: Abbrev Number: 14 (DW_TAG_member)
    <4a2>   DW_AT_name        : (indirect string, offset: 0xb577f): CounterMode
    <4a6>   DW_AT_decl_file   : 7
    <4a7>   DW_AT_decl_line   : 51
    <4a8>   DW_AT_decl_column : 12
    <4a9>   DW_AT_type        : <0x87>
    <4ad>   DW_AT_data_member_location: 4
 <2><4ae>: Abbrev Number: 14 (DW_TAG_member)
    <4af>   DW_AT_name        : (indirect string, offset: 0xd8786): Period
    <4b3>   DW_AT_decl_file   : 7
    <4b4>   DW_AT_decl_line   : 54
    <4b5>   DW_AT_decl_column : 12
    <4b6>   DW_AT_type        : <0x87>
    <4ba>   DW_AT_data_member_location: 8
 <2><4bb>: Abbrev Number: 14 (DW_TAG_member)
    <4bc>   DW_AT_name        : (indirect string, offset: 0x51772): ClockDivision
    <4c0>   DW_AT_decl_file   : 7
    <4c1>   DW_AT_decl_line   : 58
    <4c2>   DW_AT_decl_column : 12
    <4c3>   DW_AT_type        : <0x87>
    <4c7>   DW_AT_data_member_location: 12
 <2><4c8>: Abbrev Number: 14 (DW_TAG_member)
    <4c9>   DW_AT_name        : (indirect string, offset: 0x8b6d4): RepetitionCounter
    <4cd>   DW_AT_decl_file   : 7
    <4ce>   DW_AT_decl_line   : 61
    <4cf>   DW_AT_decl_column : 12
    <4d0>   DW_AT_type        : <0x87>
    <4d4>   DW_AT_data_member_location: 16
 <2><4d5>: Abbrev Number: 14 (DW_TAG_member)
    <4d6>   DW_AT_name        : (indirect string, offset: 0xb83fc): AutoReloadPreload
    <4da>   DW_AT_decl_file   : 7
    <4db>   DW_AT_decl_line   : 72
    <4dc>   DW_AT_decl_column : 12
    <4dd>   DW_AT_type        : <0x87>
    <4e1>   DW_AT_data_member_location: 20
 <2><4e2>: Abbrev Number: 0
 <1><4e3>: Abbrev Number: 4 (DW_TAG_typedef)
    <4e4>   DW_AT_name        : (indirect string, offset: 0x4525e): TIM_Base_InitTypeDef
    <4e8>   DW_AT_decl_file   : 7
    <4e9>   DW_AT_decl_line   : 74
    <4ea>   DW_AT_decl_column : 3
    <4eb>   DW_AT_type        : <0x48b>
 <1><4ef>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <4f0>   DW_AT_encoding    : 7	(unsigned)
    <4f1>   DW_AT_byte_size   : 1
    <4f2>   DW_AT_type        : <0x4c>
    <4f6>   DW_AT_decl_file   : 7
    <4f7>   DW_AT_decl_line   : 291
    <4f9>   DW_AT_decl_column : 1
    <4fa>   DW_AT_sibling     : <0x51d>
 <2><4fe>: Abbrev Number: 12 (DW_TAG_enumerator)
    <4ff>   DW_AT_name        : (indirect string, offset: 0x7d840): HAL_TIM_STATE_RESET
    <503>   DW_AT_const_value : 0
 <2><504>: Abbrev Number: 12 (DW_TAG_enumerator)
    <505>   DW_AT_name        : (indirect string, offset: 0x6e05): HAL_TIM_STATE_READY
    <509>   DW_AT_const_value : 1
 <2><50a>: Abbrev Number: 12 (DW_TAG_enumerator)
    <50b>   DW_AT_name        : (indirect string, offset: 0x328c0): HAL_TIM_STATE_BUSY
    <50f>   DW_AT_const_value : 2
 <2><510>: Abbrev Number: 12 (DW_TAG_enumerator)
    <511>   DW_AT_name        : (indirect string, offset: 0xa6f75): HAL_TIM_STATE_TIMEOUT
    <515>   DW_AT_const_value : 3
 <2><516>: Abbrev Number: 12 (DW_TAG_enumerator)
    <517>   DW_AT_name        : (indirect string, offset: 0x7b96b): HAL_TIM_STATE_ERROR
    <51b>   DW_AT_const_value : 4
 <2><51c>: Abbrev Number: 0
 <1><51d>: Abbrev Number: 10 (DW_TAG_typedef)
    <51e>   DW_AT_name        : (indirect string, offset: 0x832ef): HAL_TIM_StateTypeDef
    <522>   DW_AT_decl_file   : 7
    <523>   DW_AT_decl_line   : 297
    <525>   DW_AT_decl_column : 3
    <526>   DW_AT_type        : <0x4ef>
 <1><52a>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <52b>   DW_AT_type        : <0x51d>
 <1><52f>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <530>   DW_AT_encoding    : 7	(unsigned)
    <531>   DW_AT_byte_size   : 1
    <532>   DW_AT_type        : <0x4c>
    <536>   DW_AT_decl_file   : 7
    <537>   DW_AT_decl_line   : 303
    <539>   DW_AT_decl_column : 1
    <53a>   DW_AT_sibling     : <0x551>
 <2><53e>: Abbrev Number: 12 (DW_TAG_enumerator)
    <53f>   DW_AT_name        : (indirect string, offset: 0xae91): HAL_TIM_CHANNEL_STATE_RESET
    <543>   DW_AT_const_value : 0
 <2><544>: Abbrev Number: 12 (DW_TAG_enumerator)
    <545>   DW_AT_name        : (indirect string, offset: 0x75da1): HAL_TIM_CHANNEL_STATE_READY
    <549>   DW_AT_const_value : 1
 <2><54a>: Abbrev Number: 12 (DW_TAG_enumerator)
    <54b>   DW_AT_name        : (indirect string, offset: 0x604ec): HAL_TIM_CHANNEL_STATE_BUSY
    <54f>   DW_AT_const_value : 2
 <2><550>: Abbrev Number: 0
 <1><551>: Abbrev Number: 10 (DW_TAG_typedef)
    <552>   DW_AT_name        : (indirect string, offset: 0x2a446): HAL_TIM_ChannelStateTypeDef
    <556>   DW_AT_decl_file   : 7
    <557>   DW_AT_decl_line   : 307
    <559>   DW_AT_decl_column : 3
    <55a>   DW_AT_type        : <0x52f>
 <1><55e>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <55f>   DW_AT_type        : <0x551>
 <1><563>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <564>   DW_AT_encoding    : 7	(unsigned)
    <565>   DW_AT_byte_size   : 1
    <566>   DW_AT_type        : <0x4c>
    <56a>   DW_AT_decl_file   : 7
    <56b>   DW_AT_decl_line   : 313
    <56d>   DW_AT_decl_column : 1
    <56e>   DW_AT_sibling     : <0x585>
 <2><572>: Abbrev Number: 12 (DW_TAG_enumerator)
    <573>   DW_AT_name        : (indirect string, offset: 0x3ee7): HAL_DMA_BURST_STATE_RESET
    <577>   DW_AT_const_value : 0
 <2><578>: Abbrev Number: 12 (DW_TAG_enumerator)
    <579>   DW_AT_name        : (indirect string, offset: 0x6e86e): HAL_DMA_BURST_STATE_READY
    <57d>   DW_AT_const_value : 1
 <2><57e>: Abbrev Number: 12 (DW_TAG_enumerator)
    <57f>   DW_AT_name        : (indirect string, offset: 0x43a1b): HAL_DMA_BURST_STATE_BUSY
    <583>   DW_AT_const_value : 2
 <2><584>: Abbrev Number: 0
 <1><585>: Abbrev Number: 10 (DW_TAG_typedef)
    <586>   DW_AT_name        : (indirect string, offset: 0x1b22c): HAL_TIM_DMABurstStateTypeDef
    <58a>   DW_AT_decl_file   : 7
    <58b>   DW_AT_decl_line   : 317
    <58d>   DW_AT_decl_column : 3
    <58e>   DW_AT_type        : <0x563>
 <1><592>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <593>   DW_AT_type        : <0x585>
 <1><597>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <598>   DW_AT_encoding    : 7	(unsigned)
    <599>   DW_AT_byte_size   : 1
    <59a>   DW_AT_type        : <0x4c>
    <59e>   DW_AT_decl_file   : 7
    <59f>   DW_AT_decl_line   : 323
    <5a1>   DW_AT_decl_column : 1
    <5a2>   DW_AT_sibling     : <0x5c5>
 <2><5a6>: Abbrev Number: 12 (DW_TAG_enumerator)
    <5a7>   DW_AT_name        : (indirect string, offset: 0x70893): HAL_TIM_ACTIVE_CHANNEL_1
    <5ab>   DW_AT_const_value : 1
 <2><5ac>: Abbrev Number: 12 (DW_TAG_enumerator)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x708ac): HAL_TIM_ACTIVE_CHANNEL_2
    <5b1>   DW_AT_const_value : 2
 <2><5b2>: Abbrev Number: 12 (DW_TAG_enumerator)
    <5b3>   DW_AT_name        : (indirect string, offset: 0x708c5): HAL_TIM_ACTIVE_CHANNEL_3
    <5b7>   DW_AT_const_value : 4
 <2><5b8>: Abbrev Number: 12 (DW_TAG_enumerator)
    <5b9>   DW_AT_name        : (indirect string, offset: 0x708de): HAL_TIM_ACTIVE_CHANNEL_4
    <5bd>   DW_AT_const_value : 8
 <2><5be>: Abbrev Number: 12 (DW_TAG_enumerator)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x529e4): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <5c3>   DW_AT_const_value : 0
 <2><5c4>: Abbrev Number: 0
 <1><5c5>: Abbrev Number: 10 (DW_TAG_typedef)
    <5c6>   DW_AT_name        : (indirect string, offset: 0x6819d): HAL_TIM_ActiveChannel
    <5ca>   DW_AT_decl_file   : 7
    <5cb>   DW_AT_decl_line   : 329
    <5cd>   DW_AT_decl_column : 3
    <5ce>   DW_AT_type        : <0x597>
 <1><5d2>: Abbrev Number: 7 (DW_TAG_structure_type)
    <5d3>   DW_AT_byte_size   : 72
    <5d4>   DW_AT_decl_file   : 7
    <5d5>   DW_AT_decl_line   : 337
    <5d7>   DW_AT_decl_column : 9
    <5d8>   DW_AT_sibling     : <0x65b>
 <2><5dc>: Abbrev Number: 9 (DW_TAG_member)
    <5dd>   DW_AT_name        : (indirect string, offset: 0xc1295): Instance
    <5e1>   DW_AT_decl_file   : 7
    <5e2>   DW_AT_decl_line   : 340
    <5e4>   DW_AT_decl_column : 39
    <5e5>   DW_AT_type        : <0x65b>
    <5e9>   DW_AT_data_member_location: 0
 <2><5ea>: Abbrev Number: 9 (DW_TAG_member)
    <5eb>   DW_AT_name        : (indirect string, offset: 0xcc3b4): Init
    <5ef>   DW_AT_decl_file   : 7
    <5f0>   DW_AT_decl_line   : 341
    <5f2>   DW_AT_decl_column : 38
    <5f3>   DW_AT_type        : <0x4e3>
    <5f7>   DW_AT_data_member_location: 4
 <2><5f8>: Abbrev Number: 9 (DW_TAG_member)
    <5f9>   DW_AT_name        : (indirect string, offset: 0x681ab): Channel
    <5fd>   DW_AT_decl_file   : 7
    <5fe>   DW_AT_decl_line   : 342
    <600>   DW_AT_decl_column : 38
    <601>   DW_AT_type        : <0x5c5>
    <605>   DW_AT_data_member_location: 28
 <2><606>: Abbrev Number: 9 (DW_TAG_member)
    <607>   DW_AT_name        : (indirect string, offset: 0x782ce): hdma
    <60b>   DW_AT_decl_file   : 7
    <60c>   DW_AT_decl_line   : 343
    <60e>   DW_AT_decl_column : 39
    <60f>   DW_AT_type        : <0x661>
    <613>   DW_AT_data_member_location: 32
 <2><614>: Abbrev Number: 9 (DW_TAG_member)
    <615>   DW_AT_name        : (indirect string, offset: 0x8e29c): Lock
    <619>   DW_AT_decl_file   : 7
    <61a>   DW_AT_decl_line   : 345
    <61c>   DW_AT_decl_column : 38
    <61d>   DW_AT_type        : <0x296>
    <621>   DW_AT_data_member_location: 60
 <2><622>: Abbrev Number: 9 (DW_TAG_member)
    <623>   DW_AT_name        : (indirect string, offset: 0xcd692): State
    <627>   DW_AT_decl_file   : 7
    <628>   DW_AT_decl_line   : 346
    <62a>   DW_AT_decl_column : 38
    <62b>   DW_AT_type        : <0x52a>
    <62f>   DW_AT_data_member_location: 61
 <2><630>: Abbrev Number: 9 (DW_TAG_member)
    <631>   DW_AT_name        : (indirect string, offset: 0xd306b): ChannelState
    <635>   DW_AT_decl_file   : 7
    <636>   DW_AT_decl_line   : 347
    <638>   DW_AT_decl_column : 38
    <639>   DW_AT_type        : <0x681>
    <63d>   DW_AT_data_member_location: 62
 <2><63e>: Abbrev Number: 9 (DW_TAG_member)
    <63f>   DW_AT_name        : (indirect string, offset: 0xd362c): ChannelNState
    <643>   DW_AT_decl_file   : 7
    <644>   DW_AT_decl_line   : 348
    <646>   DW_AT_decl_column : 38
    <647>   DW_AT_type        : <0x681>
    <64b>   DW_AT_data_member_location: 66
 <2><64c>: Abbrev Number: 9 (DW_TAG_member)
    <64d>   DW_AT_name        : (indirect string, offset: 0xd2c0d): DMABurstState
    <651>   DW_AT_decl_file   : 7
    <652>   DW_AT_decl_line   : 349
    <654>   DW_AT_decl_column : 38
    <655>   DW_AT_type        : <0x592>
    <659>   DW_AT_data_member_location: 70
 <2><65a>: Abbrev Number: 0
 <1><65b>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <65c>   DW_AT_byte_size   : 4
    <65d>   DW_AT_type        : <0x23b>
 <1><661>: Abbrev Number: 20 (DW_TAG_array_type)
    <662>   DW_AT_type        : <0x485>
    <666>   DW_AT_sibling     : <0x671>
 <2><66a>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <66b>   DW_AT_type        : <0x30>
    <66f>   DW_AT_upper_bound : 6
 <2><670>: Abbrev Number: 0
 <1><671>: Abbrev Number: 20 (DW_TAG_array_type)
    <672>   DW_AT_type        : <0x55e>
    <676>   DW_AT_sibling     : <0x681>
 <2><67a>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <67b>   DW_AT_type        : <0x30>
    <67f>   DW_AT_upper_bound : 3
 <2><680>: Abbrev Number: 0
 <1><681>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <682>   DW_AT_type        : <0x671>
 <1><686>: Abbrev Number: 10 (DW_TAG_typedef)
    <687>   DW_AT_name        : (indirect string, offset: 0x44cac): TIM_HandleTypeDef
    <68b>   DW_AT_decl_file   : 7
    <68c>   DW_AT_decl_line   : 380
    <68e>   DW_AT_decl_column : 3
    <68f>   DW_AT_type        : <0x5d2>
 <1><693>: Abbrev Number: 22 (DW_TAG_variable)
    <694>   DW_AT_name        : (indirect string, offset: 0x9be09): ulStatsTimerTicks
    <698>   DW_AT_decl_file   : 1
    <699>   DW_AT_decl_line   : 47
    <69a>   DW_AT_decl_column : 24
    <69b>   DW_AT_type        : <0x7b>
    <69f>   DW_AT_external    : 1
    <69f>   DW_AT_location    : 5 byte block: 3 fc 1 0 20 	(DW_OP_addr: 200001fc)
 <1><6a5>: Abbrev Number: 23 (DW_TAG_variable)
    <6a6>   DW_AT_name        : (indirect string, offset: 0x7a125): htim7
    <6aa>   DW_AT_decl_file   : 1
    <6ab>   DW_AT_decl_line   : 48
    <6ac>   DW_AT_decl_column : 26
    <6ad>   DW_AT_type        : <0x686>
    <6b1>   DW_AT_external    : 1
    <6b1>   DW_AT_declaration : 1
 <1><6b1>: Abbrev Number: 24 (DW_TAG_subprogram)
    <6b2>   DW_AT_external    : 1
    <6b2>   DW_AT_name        : (indirect string, offset: 0x54e85): HAL_TIM_Base_Start_IT
    <6b6>   DW_AT_decl_file   : 7
    <6b7>   DW_AT_decl_line   : 1896
    <6b9>   DW_AT_decl_column : 19
    <6ba>   DW_AT_prototyped  : 1
    <6ba>   DW_AT_type        : <0x26f>
    <6be>   DW_AT_declaration : 1
    <6be>   DW_AT_sibling     : <0x6c8>
 <2><6c2>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <6c3>   DW_AT_type        : <0x6c8>
 <2><6c7>: Abbrev Number: 0
 <1><6c8>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <6c9>   DW_AT_byte_size   : 4
    <6ca>   DW_AT_type        : <0x686>
 <1><6ce>: Abbrev Number: 25 (DW_TAG_subprogram)
    <6cf>   DW_AT_external    : 1
    <6cf>   DW_AT_name        : (indirect string, offset: 0x5b0ff): getRunTimeCounterValue
    <6d3>   DW_AT_decl_file   : 1
    <6d4>   DW_AT_decl_line   : 68
    <6d5>   DW_AT_decl_column : 22
    <6d6>   DW_AT_prototyped  : 1
    <6d6>   DW_AT_type        : <0x74>
    <6da>   DW_AT_low_pc      : 0x8000f68
    <6de>   DW_AT_high_pc     : 0x18
    <6e2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6e4>   DW_AT_GNU_all_call_sites: 1
 <1><6e4>: Abbrev Number: 26 (DW_TAG_subprogram)
    <6e5>   DW_AT_external    : 1
    <6e5>   DW_AT_name        : (indirect string, offset: 0x2a343): configureTimerForRunTimeStats
    <6e9>   DW_AT_decl_file   : 1
    <6ea>   DW_AT_decl_line   : 62
    <6eb>   DW_AT_decl_column : 13
    <6ec>   DW_AT_prototyped  : 1
    <6ec>   DW_AT_low_pc      : 0x8000f4c
    <6f0>   DW_AT_high_pc     : 0x1c
    <6f4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6f6>   DW_AT_GNU_all_tail_call_sites: 1
 <1><6f6>: Abbrev Number: 0
  Compilation Unit @ offset 0x6f7:
   Length:        0x23dd (32-bit)
   Version:       4
   Abbrev Offset: 0x188
   Pointer Size:  4
 <0><702>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <703>   DW_AT_producer    : (indirect string, offset: 0xc20b3): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <707>   DW_AT_language    : 12	(ANSI C99)
    <708>   DW_AT_name        : (indirect string, offset: 0xce9ff): ../Core/Src/main.c
    <70c>   DW_AT_comp_dir    : (indirect string, offset: 0x5ecc5): C:/Users/crazy/STM32CubeIDE/workspace_1.10.0/LIS3DSH_RTOS3/Debug
    <710>   DW_AT_ranges      : 0x18
    <714>   DW_AT_low_pc      : 0x0
    <718>   DW_AT_stmt_list   : 0x7e6
    <71c>   DW_AT_GNU_macros  : 0x1f975
 <1><720>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <721>   DW_AT_encoding    : 5	(signed)
    <722>   DW_AT_byte_size   : 1
    <723>   DW_AT_type        : <0x945>
    <727>   DW_AT_decl_file   : 3
    <728>   DW_AT_decl_line   : 66
    <729>   DW_AT_decl_column : 1
    <72a>   DW_AT_sibling     : <0x945>
 <2><72e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <72f>   DW_AT_name        : (indirect string, offset: 0xc9bd5): NonMaskableInt_IRQn
    <733>   DW_AT_const_value : -14
 <2><734>: Abbrev Number: 3 (DW_TAG_enumerator)
    <735>   DW_AT_name        : (indirect string, offset: 0xcc080): MemoryManagement_IRQn
    <739>   DW_AT_const_value : -12
 <2><73a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <73b>   DW_AT_name        : (indirect string, offset: 0xcdf19): BusFault_IRQn
    <73f>   DW_AT_const_value : -11
 <2><740>: Abbrev Number: 3 (DW_TAG_enumerator)
    <741>   DW_AT_name        : (indirect string, offset: 0xcd3fc): UsageFault_IRQn
    <745>   DW_AT_const_value : -10
 <2><746>: Abbrev Number: 3 (DW_TAG_enumerator)
    <747>   DW_AT_name        : (indirect string, offset: 0xc8dcc): SVCall_IRQn
    <74b>   DW_AT_const_value : -5
 <2><74c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <74d>   DW_AT_name        : (indirect string, offset: 0xcc096): DebugMonitor_IRQn
    <751>   DW_AT_const_value : -4
 <2><752>: Abbrev Number: 3 (DW_TAG_enumerator)
    <753>   DW_AT_name        : (indirect string, offset: 0xcc54a): PendSV_IRQn
    <757>   DW_AT_const_value : -2
 <2><758>: Abbrev Number: 3 (DW_TAG_enumerator)
    <759>   DW_AT_name        : (indirect string, offset: 0xce119): SysTick_IRQn
    <75d>   DW_AT_const_value : -1
 <2><75e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <75f>   DW_AT_name        : (indirect string, offset: 0xcd6a8): WWDG_IRQn
    <763>   DW_AT_const_value : 0
 <2><764>: Abbrev Number: 4 (DW_TAG_enumerator)
    <765>   DW_AT_name        : (indirect string, offset: 0xc9b6c): PVD_IRQn
    <769>   DW_AT_const_value : 1
 <2><76a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <76b>   DW_AT_name        : (indirect string, offset: 0xcf2bf): TAMP_STAMP_IRQn
    <76f>   DW_AT_const_value : 2
 <2><770>: Abbrev Number: 4 (DW_TAG_enumerator)
    <771>   DW_AT_name        : (indirect string, offset: 0xccba1): RTC_WKUP_IRQn
    <775>   DW_AT_const_value : 3
 <2><776>: Abbrev Number: 4 (DW_TAG_enumerator)
    <777>   DW_AT_name        : (indirect string, offset: 0xca55d): FLASH_IRQn
    <77b>   DW_AT_const_value : 4
 <2><77c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <77d>   DW_AT_name        : (indirect string, offset: 0xcdf07): RCC_IRQn
    <781>   DW_AT_const_value : 5
 <2><782>: Abbrev Number: 4 (DW_TAG_enumerator)
    <783>   DW_AT_name        : (indirect string, offset: 0x4d0c0): EXTI0_IRQn
    <787>   DW_AT_const_value : 6
 <2><788>: Abbrev Number: 4 (DW_TAG_enumerator)
    <789>   DW_AT_name        : (indirect string, offset: 0xcf1aa): EXTI1_IRQn
    <78d>   DW_AT_const_value : 7
 <2><78e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <78f>   DW_AT_name        : (indirect string, offset: 0xcb866): EXTI2_IRQn
    <793>   DW_AT_const_value : 8
 <2><794>: Abbrev Number: 4 (DW_TAG_enumerator)
    <795>   DW_AT_name        : (indirect string, offset: 0xce1cd): EXTI3_IRQn
    <799>   DW_AT_const_value : 9
 <2><79a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <79b>   DW_AT_name        : (indirect string, offset: 0xc9926): EXTI4_IRQn
    <79f>   DW_AT_const_value : 10
 <2><7a0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7a1>   DW_AT_name        : (indirect string, offset: 0xc988d): DMA1_Stream0_IRQn
    <7a5>   DW_AT_const_value : 11
 <2><7a6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7a7>   DW_AT_name        : (indirect string, offset: 0xcbba5): DMA1_Stream1_IRQn
    <7ab>   DW_AT_const_value : 12
 <2><7ac>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7ad>   DW_AT_name        : (indirect string, offset: 0xcb9fe): DMA1_Stream2_IRQn
    <7b1>   DW_AT_const_value : 13
 <2><7b2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7b3>   DW_AT_name        : (indirect string, offset: 0xce935): DMA1_Stream3_IRQn
    <7b7>   DW_AT_const_value : 14
 <2><7b8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7b9>   DW_AT_name        : (indirect string, offset: 0xcade2): DMA1_Stream4_IRQn
    <7bd>   DW_AT_const_value : 15
 <2><7be>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7bf>   DW_AT_name        : (indirect string, offset: 0xcdc77): DMA1_Stream5_IRQn
    <7c3>   DW_AT_const_value : 16
 <2><7c4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7c5>   DW_AT_name        : (indirect string, offset: 0xca3d6): DMA1_Stream6_IRQn
    <7c9>   DW_AT_const_value : 17
 <2><7ca>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7cb>   DW_AT_name        : (indirect string, offset: 0xcc15d): ADC_IRQn
    <7cf>   DW_AT_const_value : 18
 <2><7d0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7d1>   DW_AT_name        : (indirect string, offset: 0xceb27): CAN1_TX_IRQn
    <7d5>   DW_AT_const_value : 19
 <2><7d6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7d7>   DW_AT_name        : (indirect string, offset: 0xca4ca): CAN1_RX0_IRQn
    <7db>   DW_AT_const_value : 20
 <2><7dc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7dd>   DW_AT_name        : (indirect string, offset: 0xcd472): CAN1_RX1_IRQn
    <7e1>   DW_AT_const_value : 21
 <2><7e2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7e3>   DW_AT_name        : (indirect string, offset: 0xcd42d): CAN1_SCE_IRQn
    <7e7>   DW_AT_const_value : 22
 <2><7e8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7e9>   DW_AT_name        : (indirect string, offset: 0xcdbff): EXTI9_5_IRQn
    <7ed>   DW_AT_const_value : 23
 <2><7ee>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7ef>   DW_AT_name        : (indirect string, offset: 0xcb8b1): TIM1_BRK_TIM9_IRQn
    <7f3>   DW_AT_const_value : 24
 <2><7f4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7f5>   DW_AT_name        : (indirect string, offset: 0xcc861): TIM1_UP_TIM10_IRQn
    <7f9>   DW_AT_const_value : 25
 <2><7fa>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7fb>   DW_AT_name        : (indirect string, offset: 0xcba7d): TIM1_TRG_COM_TIM11_IRQn
    <7ff>   DW_AT_const_value : 26
 <2><800>: Abbrev Number: 4 (DW_TAG_enumerator)
    <801>   DW_AT_name        : (indirect string, offset: 0xcbd44): TIM1_CC_IRQn
    <805>   DW_AT_const_value : 27
 <2><806>: Abbrev Number: 4 (DW_TAG_enumerator)
    <807>   DW_AT_name        : (indirect string, offset: 0xc9759): TIM2_IRQn
    <80b>   DW_AT_const_value : 28
 <2><80c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <80d>   DW_AT_name        : (indirect string, offset: 0xcc7cb): TIM3_IRQn
    <811>   DW_AT_const_value : 29
 <2><812>: Abbrev Number: 4 (DW_TAG_enumerator)
    <813>   DW_AT_name        : (indirect string, offset: 0xcb390): TIM4_IRQn
    <817>   DW_AT_const_value : 30
 <2><818>: Abbrev Number: 4 (DW_TAG_enumerator)
    <819>   DW_AT_name        : (indirect string, offset: 0xcb3b9): I2C1_EV_IRQn
    <81d>   DW_AT_const_value : 31
 <2><81e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <81f>   DW_AT_name        : (indirect string, offset: 0xccd28): I2C1_ER_IRQn
    <823>   DW_AT_const_value : 32
 <2><824>: Abbrev Number: 4 (DW_TAG_enumerator)
    <825>   DW_AT_name        : (indirect string, offset: 0xc972a): I2C2_EV_IRQn
    <829>   DW_AT_const_value : 33
 <2><82a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <82b>   DW_AT_name        : (indirect string, offset: 0xcb7e8): I2C2_ER_IRQn
    <82f>   DW_AT_const_value : 34
 <2><830>: Abbrev Number: 4 (DW_TAG_enumerator)
    <831>   DW_AT_name        : (indirect string, offset: 0xc9737): SPI1_IRQn
    <835>   DW_AT_const_value : 35
 <2><836>: Abbrev Number: 4 (DW_TAG_enumerator)
    <837>   DW_AT_name        : (indirect string, offset: 0xcc7c1): SPI2_IRQn
    <83b>   DW_AT_const_value : 36
 <2><83c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <83d>   DW_AT_name        : (indirect string, offset: 0xcdffe): USART1_IRQn
    <841>   DW_AT_const_value : 37
 <2><842>: Abbrev Number: 4 (DW_TAG_enumerator)
    <843>   DW_AT_name        : (indirect string, offset: 0xca7e8): USART2_IRQn
    <847>   DW_AT_const_value : 38
 <2><848>: Abbrev Number: 4 (DW_TAG_enumerator)
    <849>   DW_AT_name        : (indirect string, offset: 0xcd6f6): USART3_IRQn
    <84d>   DW_AT_const_value : 39
 <2><84e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <84f>   DW_AT_name        : (indirect string, offset: 0xce447): EXTI15_10_IRQn
    <853>   DW_AT_const_value : 40
 <2><854>: Abbrev Number: 4 (DW_TAG_enumerator)
    <855>   DW_AT_name        : (indirect string, offset: 0xce4f3): RTC_Alarm_IRQn
    <859>   DW_AT_const_value : 41
 <2><85a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <85b>   DW_AT_name        : (indirect string, offset: 0xca54c): OTG_FS_WKUP_IRQn
    <85f>   DW_AT_const_value : 42
 <2><860>: Abbrev Number: 4 (DW_TAG_enumerator)
    <861>   DW_AT_name        : (indirect string, offset: 0xce0e1): TIM8_BRK_TIM12_IRQn
    <865>   DW_AT_const_value : 43
 <2><866>: Abbrev Number: 4 (DW_TAG_enumerator)
    <867>   DW_AT_name        : (indirect string, offset: 0xcd9a5): TIM8_UP_TIM13_IRQn
    <86b>   DW_AT_const_value : 44
 <2><86c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <86d>   DW_AT_name        : (indirect string, offset: 0xcd652): TIM8_TRG_COM_TIM14_IRQn
    <871>   DW_AT_const_value : 45
 <2><872>: Abbrev Number: 4 (DW_TAG_enumerator)
    <873>   DW_AT_name        : (indirect string, offset: 0xcdcf2): TIM8_CC_IRQn
    <877>   DW_AT_const_value : 46
 <2><878>: Abbrev Number: 4 (DW_TAG_enumerator)
    <879>   DW_AT_name        : (indirect string, offset: 0xccc7b): DMA1_Stream7_IRQn
    <87d>   DW_AT_const_value : 47
 <2><87e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <87f>   DW_AT_name        : (indirect string, offset: 0x1db63): FSMC_IRQn
    <883>   DW_AT_const_value : 48
 <2><884>: Abbrev Number: 4 (DW_TAG_enumerator)
    <885>   DW_AT_name        : (indirect string, offset: 0x443dd): SDIO_IRQn
    <889>   DW_AT_const_value : 49
 <2><88a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <88b>   DW_AT_name        : (indirect string, offset: 0xcba22): TIM5_IRQn
    <88f>   DW_AT_const_value : 50
 <2><890>: Abbrev Number: 4 (DW_TAG_enumerator)
    <891>   DW_AT_name        : (indirect string, offset: 0xcf39e): SPI3_IRQn
    <895>   DW_AT_const_value : 51
 <2><896>: Abbrev Number: 4 (DW_TAG_enumerator)
    <897>   DW_AT_name        : (indirect string, offset: 0xcd6eb): UART4_IRQn
    <89b>   DW_AT_const_value : 52
 <2><89c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89d>   DW_AT_name        : (indirect string, offset: 0xc95a9): UART5_IRQn
    <8a1>   DW_AT_const_value : 53
 <2><8a2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8a3>   DW_AT_name        : (indirect string, offset: 0xcf539): TIM6_DAC_IRQn
    <8a7>   DW_AT_const_value : 54
 <2><8a8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8a9>   DW_AT_name        : (indirect string, offset: 0xcc19d): TIM7_IRQn
    <8ad>   DW_AT_const_value : 55
 <2><8ae>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8af>   DW_AT_name        : (indirect string, offset: 0xcd576): DMA2_Stream0_IRQn
    <8b3>   DW_AT_const_value : 56
 <2><8b4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8b5>   DW_AT_name        : (indirect string, offset: 0xc9873): DMA2_Stream1_IRQn
    <8b9>   DW_AT_const_value : 57
 <2><8ba>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8bb>   DW_AT_name        : (indirect string, offset: 0xcc423): DMA2_Stream2_IRQn
    <8bf>   DW_AT_const_value : 58
 <2><8c0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8c1>   DW_AT_name        : (indirect string, offset: 0xce7c2): DMA2_Stream3_IRQn
    <8c5>   DW_AT_const_value : 59
 <2><8c6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8c7>   DW_AT_name        : (indirect string, offset: 0xcadfe): DMA2_Stream4_IRQn
    <8cb>   DW_AT_const_value : 60
 <2><8cc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8cd>   DW_AT_name        : (indirect string, offset: 0xcb0f3): ETH_IRQn
    <8d1>   DW_AT_const_value : 61
 <2><8d2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8d3>   DW_AT_name        : (indirect string, offset: 0xcb4aa): ETH_WKUP_IRQn
    <8d7>   DW_AT_const_value : 62
 <2><8d8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8d9>   DW_AT_name        : (indirect string, offset: 0xcc17f): CAN2_TX_IRQn
    <8dd>   DW_AT_const_value : 63
 <2><8de>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8df>   DW_AT_name        : (indirect string, offset: 0xca18f): CAN2_RX0_IRQn
    <8e3>   DW_AT_const_value : 64
 <2><8e4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8e5>   DW_AT_name        : (indirect string, offset: 0xcd003): CAN2_RX1_IRQn
    <8e9>   DW_AT_const_value : 65
 <2><8ea>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8eb>   DW_AT_name        : (indirect string, offset: 0xcf0e5): CAN2_SCE_IRQn
    <8ef>   DW_AT_const_value : 66
 <2><8f0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8f1>   DW_AT_name        : (indirect string, offset: 0xcc7d5): OTG_FS_IRQn
    <8f5>   DW_AT_const_value : 67
 <2><8f6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8f7>   DW_AT_name        : (indirect string, offset: 0xccdce): DMA2_Stream5_IRQn
    <8fb>   DW_AT_const_value : 68
 <2><8fc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8fd>   DW_AT_name        : (indirect string, offset: 0xcaf8b): DMA2_Stream6_IRQn
    <901>   DW_AT_const_value : 69
 <2><902>: Abbrev Number: 4 (DW_TAG_enumerator)
    <903>   DW_AT_name        : (indirect string, offset: 0xcdd32): DMA2_Stream7_IRQn
    <907>   DW_AT_const_value : 70
 <2><908>: Abbrev Number: 4 (DW_TAG_enumerator)
    <909>   DW_AT_name        : (indirect string, offset: 0xce133): USART6_IRQn
    <90d>   DW_AT_const_value : 71
 <2><90e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <90f>   DW_AT_name        : (indirect string, offset: 0xcea12): I2C3_EV_IRQn
    <913>   DW_AT_const_value : 72
 <2><914>: Abbrev Number: 4 (DW_TAG_enumerator)
    <915>   DW_AT_name        : (indirect string, offset: 0xc9ef1): I2C3_ER_IRQn
    <919>   DW_AT_const_value : 73
 <2><91a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <91b>   DW_AT_name        : (indirect string, offset: 0xcb3a5): OTG_HS_EP1_OUT_IRQn
    <91f>   DW_AT_const_value : 74
 <2><920>: Abbrev Number: 4 (DW_TAG_enumerator)
    <921>   DW_AT_name        : (indirect string, offset: 0xcd97a): OTG_HS_EP1_IN_IRQn
    <925>   DW_AT_const_value : 75
 <2><926>: Abbrev Number: 4 (DW_TAG_enumerator)
    <927>   DW_AT_name        : (indirect string, offset: 0xcc7a3): OTG_HS_WKUP_IRQn
    <92b>   DW_AT_const_value : 76
 <2><92c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <92d>   DW_AT_name        : (indirect string, offset: 0xcb8c4): OTG_HS_IRQn
    <931>   DW_AT_const_value : 77
 <2><932>: Abbrev Number: 4 (DW_TAG_enumerator)
    <933>   DW_AT_name        : (indirect string, offset: 0xcf00c): DCMI_IRQn
    <937>   DW_AT_const_value : 78
 <2><938>: Abbrev Number: 4 (DW_TAG_enumerator)
    <939>   DW_AT_name        : (indirect string, offset: 0xb40f2): RNG_IRQn
    <93d>   DW_AT_const_value : 80
 <2><93e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <93f>   DW_AT_name        : (indirect string, offset: 0xcb2db): FPU_IRQn
    <943>   DW_AT_const_value : 81
 <2><944>: Abbrev Number: 0
 <1><945>: Abbrev Number: 5 (DW_TAG_base_type)
    <946>   DW_AT_byte_size   : 1
    <947>   DW_AT_encoding    : 6	(signed char)
    <948>   DW_AT_name        : (indirect string, offset: 0x64241): signed char
 <1><94c>: Abbrev Number: 6 (DW_TAG_typedef)
    <94d>   DW_AT_name        : (indirect string, offset: 0xce801): IRQn_Type
    <951>   DW_AT_decl_file   : 3
    <952>   DW_AT_decl_line   : 158
    <953>   DW_AT_decl_column : 3
    <954>   DW_AT_type        : <0x720>
 <1><958>: Abbrev Number: 6 (DW_TAG_typedef)
    <959>   DW_AT_name        : (indirect string, offset: 0xc91be): __int8_t
    <95d>   DW_AT_decl_file   : 4
    <95e>   DW_AT_decl_line   : 41
    <95f>   DW_AT_decl_column : 23
    <960>   DW_AT_type        : <0x945>
 <1><964>: Abbrev Number: 6 (DW_TAG_typedef)
    <965>   DW_AT_name        : (indirect string, offset: 0xcadf4): __uint8_t
    <969>   DW_AT_decl_file   : 4
    <96a>   DW_AT_decl_line   : 43
    <96b>   DW_AT_decl_column : 24
    <96c>   DW_AT_type        : <0x970>
 <1><970>: Abbrev Number: 5 (DW_TAG_base_type)
    <971>   DW_AT_byte_size   : 1
    <972>   DW_AT_encoding    : 8	(unsigned char)
    <973>   DW_AT_name        : (indirect string, offset: 0xc0e4a): unsigned char
 <1><977>: Abbrev Number: 6 (DW_TAG_typedef)
    <978>   DW_AT_name        : (indirect string, offset: 0xce0ce): __int16_t
    <97c>   DW_AT_decl_file   : 4
    <97d>   DW_AT_decl_line   : 55
    <97e>   DW_AT_decl_column : 24
    <97f>   DW_AT_type        : <0x983>
 <1><983>: Abbrev Number: 5 (DW_TAG_base_type)
    <984>   DW_AT_byte_size   : 2
    <985>   DW_AT_encoding    : 5	(signed)
    <986>   DW_AT_name        : (indirect string, offset: 0x94d2d): short int
 <1><98a>: Abbrev Number: 6 (DW_TAG_typedef)
    <98b>   DW_AT_name        : (indirect string, offset: 0xce23a): __uint16_t
    <98f>   DW_AT_decl_file   : 4
    <990>   DW_AT_decl_line   : 57
    <991>   DW_AT_decl_column : 25
    <992>   DW_AT_type        : <0x996>
 <1><996>: Abbrev Number: 5 (DW_TAG_base_type)
    <997>   DW_AT_byte_size   : 2
    <998>   DW_AT_encoding    : 7	(unsigned)
    <999>   DW_AT_name        : (indirect string, offset: 0xbf60f): short unsigned int
 <1><99d>: Abbrev Number: 5 (DW_TAG_base_type)
    <99e>   DW_AT_byte_size   : 4
    <99f>   DW_AT_encoding    : 5	(signed)
    <9a0>   DW_AT_name        : (indirect string, offset: 0x10a38): long int
 <1><9a4>: Abbrev Number: 6 (DW_TAG_typedef)
    <9a5>   DW_AT_name        : (indirect string, offset: 0x7f619): __uint32_t
    <9a9>   DW_AT_decl_file   : 4
    <9aa>   DW_AT_decl_line   : 79
    <9ab>   DW_AT_decl_column : 25
    <9ac>   DW_AT_type        : <0x9b0>
 <1><9b0>: Abbrev Number: 5 (DW_TAG_base_type)
    <9b1>   DW_AT_byte_size   : 4
    <9b2>   DW_AT_encoding    : 7	(unsigned)
    <9b3>   DW_AT_name        : (indirect string, offset: 0x4c9a0): long unsigned int
 <1><9b7>: Abbrev Number: 5 (DW_TAG_base_type)
    <9b8>   DW_AT_byte_size   : 8
    <9b9>   DW_AT_encoding    : 5	(signed)
    <9ba>   DW_AT_name        : (indirect string, offset: 0x5b613): long long int
 <1><9be>: Abbrev Number: 5 (DW_TAG_base_type)
    <9bf>   DW_AT_byte_size   : 8
    <9c0>   DW_AT_encoding    : 7	(unsigned)
    <9c1>   DW_AT_name        : (indirect string, offset: 0x29e96): long long unsigned int
 <1><9c5>: Abbrev Number: 7 (DW_TAG_base_type)
    <9c6>   DW_AT_byte_size   : 4
    <9c7>   DW_AT_encoding    : 5	(signed)
    <9c8>   DW_AT_name        : int
 <1><9cc>: Abbrev Number: 5 (DW_TAG_base_type)
    <9cd>   DW_AT_byte_size   : 4
    <9ce>   DW_AT_encoding    : 7	(unsigned)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x10109): unsigned int
 <1><9d3>: Abbrev Number: 6 (DW_TAG_typedef)
    <9d4>   DW_AT_name        : (indirect string, offset: 0xc91c0): int8_t
    <9d8>   DW_AT_decl_file   : 5
    <9d9>   DW_AT_decl_line   : 20
    <9da>   DW_AT_decl_column : 18
    <9db>   DW_AT_type        : <0x958>
 <1><9df>: Abbrev Number: 6 (DW_TAG_typedef)
    <9e0>   DW_AT_name        : (indirect string, offset: 0xcadf6): uint8_t
    <9e4>   DW_AT_decl_file   : 5
    <9e5>   DW_AT_decl_line   : 24
    <9e6>   DW_AT_decl_column : 19
    <9e7>   DW_AT_type        : <0x964>
 <1><9eb>: Abbrev Number: 8 (DW_TAG_const_type)
    <9ec>   DW_AT_type        : <0x9df>
 <1><9f0>: Abbrev Number: 6 (DW_TAG_typedef)
    <9f1>   DW_AT_name        : (indirect string, offset: 0xce0d0): int16_t
    <9f5>   DW_AT_decl_file   : 5
    <9f6>   DW_AT_decl_line   : 32
    <9f7>   DW_AT_decl_column : 19
    <9f8>   DW_AT_type        : <0x977>
 <1><9fc>: Abbrev Number: 6 (DW_TAG_typedef)
    <9fd>   DW_AT_name        : (indirect string, offset: 0x91993): uint16_t
    <a01>   DW_AT_decl_file   : 5
    <a02>   DW_AT_decl_line   : 36
    <a03>   DW_AT_decl_column : 20
    <a04>   DW_AT_type        : <0x98a>
 <1><a08>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <a09>   DW_AT_type        : <0x9fc>
 <1><a0d>: Abbrev Number: 6 (DW_TAG_typedef)
    <a0e>   DW_AT_name        : (indirect string, offset: 0x90ff0): uint32_t
    <a12>   DW_AT_decl_file   : 5
    <a13>   DW_AT_decl_line   : 48
    <a14>   DW_AT_decl_column : 20
    <a15>   DW_AT_type        : <0x9a4>
 <1><a19>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <a1a>   DW_AT_type        : <0xa0d>
 <1><a1e>: Abbrev Number: 10 (DW_TAG_array_type)
    <a1f>   DW_AT_type        : <0xa0d>
    <a23>   DW_AT_sibling     : <0xa2e>
 <2><a27>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a28>   DW_AT_type        : <0x9cc>
    <a2c>   DW_AT_upper_bound : 1
 <2><a2d>: Abbrev Number: 0
 <1><a2e>: Abbrev Number: 12 (DW_TAG_structure_type)
    <a2f>   DW_AT_byte_size   : 24
    <a30>   DW_AT_decl_file   : 3
    <a31>   DW_AT_decl_line   : 345
    <a33>   DW_AT_decl_column : 9
    <a34>   DW_AT_sibling     : <0xa8c>
 <2><a38>: Abbrev Number: 13 (DW_TAG_member)
    <a39>   DW_AT_name        : CR
    <a3c>   DW_AT_decl_file   : 3
    <a3d>   DW_AT_decl_line   : 347
    <a3f>   DW_AT_decl_column : 17
    <a40>   DW_AT_type        : <0xa19>
    <a44>   DW_AT_data_member_location: 0
 <2><a45>: Abbrev Number: 14 (DW_TAG_member)
    <a46>   DW_AT_name        : (indirect string, offset: 0x4c20a): NDTR
    <a4a>   DW_AT_decl_file   : 3
    <a4b>   DW_AT_decl_line   : 348
    <a4d>   DW_AT_decl_column : 17
    <a4e>   DW_AT_type        : <0xa19>
    <a52>   DW_AT_data_member_location: 4
 <2><a53>: Abbrev Number: 13 (DW_TAG_member)
    <a54>   DW_AT_name        : PAR
    <a58>   DW_AT_decl_file   : 3
    <a59>   DW_AT_decl_line   : 349
    <a5b>   DW_AT_decl_column : 17
    <a5c>   DW_AT_type        : <0xa19>
    <a60>   DW_AT_data_member_location: 8
 <2><a61>: Abbrev Number: 14 (DW_TAG_member)
    <a62>   DW_AT_name        : (indirect string, offset: 0x53351): M0AR
    <a66>   DW_AT_decl_file   : 3
    <a67>   DW_AT_decl_line   : 350
    <a69>   DW_AT_decl_column : 17
    <a6a>   DW_AT_type        : <0xa19>
    <a6e>   DW_AT_data_member_location: 12
 <2><a6f>: Abbrev Number: 14 (DW_TAG_member)
    <a70>   DW_AT_name        : (indirect string, offset: 0x6ee0b): M1AR
    <a74>   DW_AT_decl_file   : 3
    <a75>   DW_AT_decl_line   : 351
    <a77>   DW_AT_decl_column : 17
    <a78>   DW_AT_type        : <0xa19>
    <a7c>   DW_AT_data_member_location: 16
 <2><a7d>: Abbrev Number: 13 (DW_TAG_member)
    <a7e>   DW_AT_name        : FCR
    <a82>   DW_AT_decl_file   : 3
    <a83>   DW_AT_decl_line   : 352
    <a85>   DW_AT_decl_column : 17
    <a86>   DW_AT_type        : <0xa19>
    <a8a>   DW_AT_data_member_location: 20
 <2><a8b>: Abbrev Number: 0
 <1><a8c>: Abbrev Number: 15 (DW_TAG_typedef)
    <a8d>   DW_AT_name        : (indirect string, offset: 0xb55f5): DMA_Stream_TypeDef
    <a91>   DW_AT_decl_file   : 3
    <a92>   DW_AT_decl_line   : 353
    <a94>   DW_AT_decl_column : 3
    <a95>   DW_AT_type        : <0xa2e>
 <1><a99>: Abbrev Number: 12 (DW_TAG_structure_type)
    <a9a>   DW_AT_byte_size   : 40
    <a9b>   DW_AT_decl_file   : 3
    <a9c>   DW_AT_decl_line   : 526
    <a9e>   DW_AT_decl_column : 9
    <a9f>   DW_AT_sibling     : <0xb22>
 <2><aa3>: Abbrev Number: 14 (DW_TAG_member)
    <aa4>   DW_AT_name        : (indirect string, offset: 0xcd24d): MODER
    <aa8>   DW_AT_decl_file   : 3
    <aa9>   DW_AT_decl_line   : 528
    <aab>   DW_AT_decl_column : 17
    <aac>   DW_AT_type        : <0xa19>
    <ab0>   DW_AT_data_member_location: 0
 <2><ab1>: Abbrev Number: 14 (DW_TAG_member)
    <ab2>   DW_AT_name        : (indirect string, offset: 0xcdf9f): OTYPER
    <ab6>   DW_AT_decl_file   : 3
    <ab7>   DW_AT_decl_line   : 529
    <ab9>   DW_AT_decl_column : 17
    <aba>   DW_AT_type        : <0xa19>
    <abe>   DW_AT_data_member_location: 4
 <2><abf>: Abbrev Number: 14 (DW_TAG_member)
    <ac0>   DW_AT_name        : (indirect string, offset: 0xce7a4): OSPEEDR
    <ac4>   DW_AT_decl_file   : 3
    <ac5>   DW_AT_decl_line   : 530
    <ac7>   DW_AT_decl_column : 17
    <ac8>   DW_AT_type        : <0xa19>
    <acc>   DW_AT_data_member_location: 8
 <2><acd>: Abbrev Number: 14 (DW_TAG_member)
    <ace>   DW_AT_name        : (indirect string, offset: 0xcc9f5): PUPDR
    <ad2>   DW_AT_decl_file   : 3
    <ad3>   DW_AT_decl_line   : 531
    <ad5>   DW_AT_decl_column : 17
    <ad6>   DW_AT_type        : <0xa19>
    <ada>   DW_AT_data_member_location: 12
 <2><adb>: Abbrev Number: 13 (DW_TAG_member)
    <adc>   DW_AT_name        : IDR
    <ae0>   DW_AT_decl_file   : 3
    <ae1>   DW_AT_decl_line   : 532
    <ae3>   DW_AT_decl_column : 17
    <ae4>   DW_AT_type        : <0xa19>
    <ae8>   DW_AT_data_member_location: 16
 <2><ae9>: Abbrev Number: 13 (DW_TAG_member)
    <aea>   DW_AT_name        : ODR
    <aee>   DW_AT_decl_file   : 3
    <aef>   DW_AT_decl_line   : 533
    <af1>   DW_AT_decl_column : 17
    <af2>   DW_AT_type        : <0xa19>
    <af6>   DW_AT_data_member_location: 20
 <2><af7>: Abbrev Number: 14 (DW_TAG_member)
    <af8>   DW_AT_name        : (indirect string, offset: 0xca6f4): BSRR
    <afc>   DW_AT_decl_file   : 3
    <afd>   DW_AT_decl_line   : 534
    <aff>   DW_AT_decl_column : 17
    <b00>   DW_AT_type        : <0xa19>
    <b04>   DW_AT_data_member_location: 24
 <2><b05>: Abbrev Number: 14 (DW_TAG_member)
    <b06>   DW_AT_name        : (indirect string, offset: 0xce6ae): LCKR
    <b0a>   DW_AT_decl_file   : 3
    <b0b>   DW_AT_decl_line   : 535
    <b0d>   DW_AT_decl_column : 17
    <b0e>   DW_AT_type        : <0xa19>
    <b12>   DW_AT_data_member_location: 28
 <2><b13>: Abbrev Number: 13 (DW_TAG_member)
    <b14>   DW_AT_name        : AFR
    <b18>   DW_AT_decl_file   : 3
    <b19>   DW_AT_decl_line   : 536
    <b1b>   DW_AT_decl_column : 17
    <b1c>   DW_AT_type        : <0xb32>
    <b20>   DW_AT_data_member_location: 32
 <2><b21>: Abbrev Number: 0
 <1><b22>: Abbrev Number: 10 (DW_TAG_array_type)
    <b23>   DW_AT_type        : <0xa19>
    <b27>   DW_AT_sibling     : <0xb32>
 <2><b2b>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <b2c>   DW_AT_type        : <0x9cc>
    <b30>   DW_AT_upper_bound : 1
 <2><b31>: Abbrev Number: 0
 <1><b32>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <b33>   DW_AT_type        : <0xb22>
 <1><b37>: Abbrev Number: 15 (DW_TAG_typedef)
    <b38>   DW_AT_name        : (indirect string, offset: 0xcf331): GPIO_TypeDef
    <b3c>   DW_AT_decl_file   : 3
    <b3d>   DW_AT_decl_line   : 537
    <b3f>   DW_AT_decl_column : 3
    <b40>   DW_AT_type        : <0xa99>
 <1><b44>: Abbrev Number: 12 (DW_TAG_structure_type)
    <b45>   DW_AT_byte_size   : 8
    <b46>   DW_AT_decl_file   : 3
    <b47>   DW_AT_decl_line   : 586
    <b49>   DW_AT_decl_column : 9
    <b4a>   DW_AT_sibling     : <0xb6a>
 <2><b4e>: Abbrev Number: 13 (DW_TAG_member)
    <b4f>   DW_AT_name        : CR
    <b52>   DW_AT_decl_file   : 3
    <b53>   DW_AT_decl_line   : 588
    <b55>   DW_AT_decl_column : 17
    <b56>   DW_AT_type        : <0xa19>
    <b5a>   DW_AT_data_member_location: 0
 <2><b5b>: Abbrev Number: 13 (DW_TAG_member)
    <b5c>   DW_AT_name        : CSR
    <b60>   DW_AT_decl_file   : 3
    <b61>   DW_AT_decl_line   : 589
    <b63>   DW_AT_decl_column : 17
    <b64>   DW_AT_type        : <0xa19>
    <b68>   DW_AT_data_member_location: 4
 <2><b69>: Abbrev Number: 0
 <1><b6a>: Abbrev Number: 15 (DW_TAG_typedef)
    <b6b>   DW_AT_name        : (indirect string, offset: 0xcdb4b): PWR_TypeDef
    <b6f>   DW_AT_decl_file   : 3
    <b70>   DW_AT_decl_line   : 590
    <b72>   DW_AT_decl_column : 3
    <b73>   DW_AT_type        : <0xb44>
 <1><b77>: Abbrev Number: 12 (DW_TAG_structure_type)
    <b78>   DW_AT_byte_size   : 136
    <b79>   DW_AT_decl_file   : 3
    <b7a>   DW_AT_decl_line   : 596
    <b7c>   DW_AT_decl_column : 9
    <b7d>   DW_AT_sibling     : <0xd25>
 <2><b81>: Abbrev Number: 13 (DW_TAG_member)
    <b82>   DW_AT_name        : CR
    <b85>   DW_AT_decl_file   : 3
    <b86>   DW_AT_decl_line   : 598
    <b88>   DW_AT_decl_column : 17
    <b89>   DW_AT_type        : <0xa19>
    <b8d>   DW_AT_data_member_location: 0
 <2><b8e>: Abbrev Number: 14 (DW_TAG_member)
    <b8f>   DW_AT_name        : (indirect string, offset: 0xcd94c): PLLCFGR
    <b93>   DW_AT_decl_file   : 3
    <b94>   DW_AT_decl_line   : 599
    <b96>   DW_AT_decl_column : 17
    <b97>   DW_AT_type        : <0xa19>
    <b9b>   DW_AT_data_member_location: 4
 <2><b9c>: Abbrev Number: 14 (DW_TAG_member)
    <b9d>   DW_AT_name        : (indirect string, offset: 0xcd94f): CFGR
    <ba1>   DW_AT_decl_file   : 3
    <ba2>   DW_AT_decl_line   : 600
    <ba4>   DW_AT_decl_column : 17
    <ba5>   DW_AT_type        : <0xa19>
    <ba9>   DW_AT_data_member_location: 8
 <2><baa>: Abbrev Number: 13 (DW_TAG_member)
    <bab>   DW_AT_name        : CIR
    <baf>   DW_AT_decl_file   : 3
    <bb0>   DW_AT_decl_line   : 601
    <bb2>   DW_AT_decl_column : 17
    <bb3>   DW_AT_type        : <0xa19>
    <bb7>   DW_AT_data_member_location: 12
 <2><bb8>: Abbrev Number: 14 (DW_TAG_member)
    <bb9>   DW_AT_name        : (indirect string, offset: 0xce0d8): AHB1RSTR
    <bbd>   DW_AT_decl_file   : 3
    <bbe>   DW_AT_decl_line   : 602
    <bc0>   DW_AT_decl_column : 17
    <bc1>   DW_AT_type        : <0xa19>
    <bc5>   DW_AT_data_member_location: 16
 <2><bc6>: Abbrev Number: 14 (DW_TAG_member)
    <bc7>   DW_AT_name        : (indirect string, offset: 0xc97a2): AHB2RSTR
    <bcb>   DW_AT_decl_file   : 3
    <bcc>   DW_AT_decl_line   : 603
    <bce>   DW_AT_decl_column : 17
    <bcf>   DW_AT_type        : <0xa19>
    <bd3>   DW_AT_data_member_location: 20
 <2><bd4>: Abbrev Number: 14 (DW_TAG_member)
    <bd5>   DW_AT_name        : (indirect string, offset: 0xcb337): AHB3RSTR
    <bd9>   DW_AT_decl_file   : 3
    <bda>   DW_AT_decl_line   : 604
    <bdc>   DW_AT_decl_column : 17
    <bdd>   DW_AT_type        : <0xa19>
    <be1>   DW_AT_data_member_location: 24
 <2><be2>: Abbrev Number: 14 (DW_TAG_member)
    <be3>   DW_AT_name        : (indirect string, offset: 0xcf0a9): RESERVED0
    <be7>   DW_AT_decl_file   : 3
    <be8>   DW_AT_decl_line   : 605
    <bea>   DW_AT_decl_column : 17
    <beb>   DW_AT_type        : <0xa0d>
    <bef>   DW_AT_data_member_location: 28
 <2><bf0>: Abbrev Number: 14 (DW_TAG_member)
    <bf1>   DW_AT_name        : (indirect string, offset: 0xc9750): APB1RSTR
    <bf5>   DW_AT_decl_file   : 3
    <bf6>   DW_AT_decl_line   : 606
    <bf8>   DW_AT_decl_column : 17
    <bf9>   DW_AT_type        : <0xa19>
    <bfd>   DW_AT_data_member_location: 32
 <2><bfe>: Abbrev Number: 14 (DW_TAG_member)
    <bff>   DW_AT_name        : (indirect string, offset: 0xcba74): APB2RSTR
    <c03>   DW_AT_decl_file   : 3
    <c04>   DW_AT_decl_line   : 607
    <c06>   DW_AT_decl_column : 17
    <c07>   DW_AT_type        : <0xa19>
    <c0b>   DW_AT_data_member_location: 36
 <2><c0c>: Abbrev Number: 14 (DW_TAG_member)
    <c0d>   DW_AT_name        : (indirect string, offset: 0xcf0b3): RESERVED1
    <c11>   DW_AT_decl_file   : 3
    <c12>   DW_AT_decl_line   : 608
    <c14>   DW_AT_decl_column : 17
    <c15>   DW_AT_type        : <0xa1e>
    <c19>   DW_AT_data_member_location: 40
 <2><c1a>: Abbrev Number: 14 (DW_TAG_member)
    <c1b>   DW_AT_name        : (indirect string, offset: 0xc9503): AHB1ENR
    <c1f>   DW_AT_decl_file   : 3
    <c20>   DW_AT_decl_line   : 609
    <c22>   DW_AT_decl_column : 17
    <c23>   DW_AT_type        : <0xa19>
    <c27>   DW_AT_data_member_location: 48
 <2><c28>: Abbrev Number: 14 (DW_TAG_member)
    <c29>   DW_AT_name        : (indirect string, offset: 0xcabec): AHB2ENR
    <c2d>   DW_AT_decl_file   : 3
    <c2e>   DW_AT_decl_line   : 610
    <c30>   DW_AT_decl_column : 17
    <c31>   DW_AT_type        : <0xa19>
    <c35>   DW_AT_data_member_location: 52
 <2><c36>: Abbrev Number: 14 (DW_TAG_member)
    <c37>   DW_AT_name        : (indirect string, offset: 0xcbbd1): AHB3ENR
    <c3b>   DW_AT_decl_file   : 3
    <c3c>   DW_AT_decl_line   : 611
    <c3e>   DW_AT_decl_column : 17
    <c3f>   DW_AT_type        : <0xa19>
    <c43>   DW_AT_data_member_location: 56
 <2><c44>: Abbrev Number: 14 (DW_TAG_member)
    <c45>   DW_AT_name        : (indirect string, offset: 0xcf0bd): RESERVED2
    <c49>   DW_AT_decl_file   : 3
    <c4a>   DW_AT_decl_line   : 612
    <c4c>   DW_AT_decl_column : 17
    <c4d>   DW_AT_type        : <0xa0d>
    <c51>   DW_AT_data_member_location: 60
 <2><c52>: Abbrev Number: 14 (DW_TAG_member)
    <c53>   DW_AT_name        : (indirect string, offset: 0xcc874): APB1ENR
    <c57>   DW_AT_decl_file   : 3
    <c58>   DW_AT_decl_line   : 613
    <c5a>   DW_AT_decl_column : 17
    <c5b>   DW_AT_type        : <0xa19>
    <c5f>   DW_AT_data_member_location: 64
 <2><c60>: Abbrev Number: 14 (DW_TAG_member)
    <c61>   DW_AT_name        : (indirect string, offset: 0xc9885): APB2ENR
    <c65>   DW_AT_decl_file   : 3
    <c66>   DW_AT_decl_line   : 614
    <c68>   DW_AT_decl_column : 17
    <c69>   DW_AT_type        : <0xa19>
    <c6d>   DW_AT_data_member_location: 68
 <2><c6e>: Abbrev Number: 14 (DW_TAG_member)
    <c6f>   DW_AT_name        : (indirect string, offset: 0xcf0c7): RESERVED3
    <c73>   DW_AT_decl_file   : 3
    <c74>   DW_AT_decl_line   : 615
    <c76>   DW_AT_decl_column : 17
    <c77>   DW_AT_type        : <0xa1e>
    <c7b>   DW_AT_data_member_location: 72
 <2><c7c>: Abbrev Number: 14 (DW_TAG_member)
    <c7d>   DW_AT_name        : (indirect string, offset: 0xce230): AHB1LPENR
    <c81>   DW_AT_decl_file   : 3
    <c82>   DW_AT_decl_line   : 616
    <c84>   DW_AT_decl_column : 17
    <c85>   DW_AT_type        : <0xa19>
    <c89>   DW_AT_data_member_location: 80
 <2><c8a>: Abbrev Number: 14 (DW_TAG_member)
    <c8b>   DW_AT_name        : (indirect string, offset: 0xca6d0): AHB2LPENR
    <c8f>   DW_AT_decl_file   : 3
    <c90>   DW_AT_decl_line   : 617
    <c92>   DW_AT_decl_column : 17
    <c93>   DW_AT_type        : <0xa19>
    <c97>   DW_AT_data_member_location: 84
 <2><c98>: Abbrev Number: 14 (DW_TAG_member)
    <c99>   DW_AT_name        : (indirect string, offset: 0xcd648): AHB3LPENR
    <c9d>   DW_AT_decl_file   : 3
    <c9e>   DW_AT_decl_line   : 618
    <ca0>   DW_AT_decl_column : 17
    <ca1>   DW_AT_type        : <0xa19>
    <ca5>   DW_AT_data_member_location: 88
 <2><ca6>: Abbrev Number: 14 (DW_TAG_member)
    <ca7>   DW_AT_name        : (indirect string, offset: 0xcf0d1): RESERVED4
    <cab>   DW_AT_decl_file   : 3
    <cac>   DW_AT_decl_line   : 619
    <cae>   DW_AT_decl_column : 17
    <caf>   DW_AT_type        : <0xa0d>
    <cb3>   DW_AT_data_member_location: 92
 <2><cb4>: Abbrev Number: 14 (DW_TAG_member)
    <cb5>   DW_AT_name        : (indirect string, offset: 0xce4c2): APB1LPENR
    <cb9>   DW_AT_decl_file   : 3
    <cba>   DW_AT_decl_line   : 620
    <cbc>   DW_AT_decl_column : 17
    <cbd>   DW_AT_type        : <0xa19>
    <cc1>   DW_AT_data_member_location: 96
 <2><cc2>: Abbrev Number: 14 (DW_TAG_member)
    <cc3>   DW_AT_name        : (indirect string, offset: 0xcab13): APB2LPENR
    <cc7>   DW_AT_decl_file   : 3
    <cc8>   DW_AT_decl_line   : 621
    <cca>   DW_AT_decl_column : 17
    <ccb>   DW_AT_type        : <0xa19>
    <ccf>   DW_AT_data_member_location: 100
 <2><cd0>: Abbrev Number: 14 (DW_TAG_member)
    <cd1>   DW_AT_name        : (indirect string, offset: 0xcf0db): RESERVED5
    <cd5>   DW_AT_decl_file   : 3
    <cd6>   DW_AT_decl_line   : 622
    <cd8>   DW_AT_decl_column : 17
    <cd9>   DW_AT_type        : <0xa1e>
    <cdd>   DW_AT_data_member_location: 104
 <2><cde>: Abbrev Number: 14 (DW_TAG_member)
    <cdf>   DW_AT_name        : (indirect string, offset: 0xc9955): BDCR
    <ce3>   DW_AT_decl_file   : 3
    <ce4>   DW_AT_decl_line   : 623
    <ce6>   DW_AT_decl_column : 17
    <ce7>   DW_AT_type        : <0xa19>
    <ceb>   DW_AT_data_member_location: 112
 <2><cec>: Abbrev Number: 13 (DW_TAG_member)
    <ced>   DW_AT_name        : CSR
    <cf1>   DW_AT_decl_file   : 3
    <cf2>   DW_AT_decl_line   : 624
    <cf4>   DW_AT_decl_column : 17
    <cf5>   DW_AT_type        : <0xa19>
    <cf9>   DW_AT_data_member_location: 116
 <2><cfa>: Abbrev Number: 14 (DW_TAG_member)
    <cfb>   DW_AT_name        : (indirect string, offset: 0xccbf4): RESERVED6
    <cff>   DW_AT_decl_file   : 3
    <d00>   DW_AT_decl_line   : 625
    <d02>   DW_AT_decl_column : 17
    <d03>   DW_AT_type        : <0xa1e>
    <d07>   DW_AT_data_member_location: 120
 <2><d08>: Abbrev Number: 14 (DW_TAG_member)
    <d09>   DW_AT_name        : (indirect string, offset: 0xcc435): SSCGR
    <d0d>   DW_AT_decl_file   : 3
    <d0e>   DW_AT_decl_line   : 626
    <d10>   DW_AT_decl_column : 17
    <d11>   DW_AT_type        : <0xa19>
    <d15>   DW_AT_data_member_location: 128
 <2><d16>: Abbrev Number: 14 (DW_TAG_member)
    <d17>   DW_AT_name        : (indirect string, offset: 0xcb39a): PLLI2SCFGR
    <d1b>   DW_AT_decl_file   : 3
    <d1c>   DW_AT_decl_line   : 627
    <d1e>   DW_AT_decl_column : 17
    <d1f>   DW_AT_type        : <0xa19>
    <d23>   DW_AT_data_member_location: 132
 <2><d24>: Abbrev Number: 0
 <1><d25>: Abbrev Number: 15 (DW_TAG_typedef)
    <d26>   DW_AT_name        : (indirect string, offset: 0xcbd9a): RCC_TypeDef
    <d2a>   DW_AT_decl_file   : 3
    <d2b>   DW_AT_decl_line   : 628
    <d2d>   DW_AT_decl_column : 3
    <d2e>   DW_AT_type        : <0xb77>
 <1><d32>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d33>   DW_AT_byte_size   : 36
    <d34>   DW_AT_decl_file   : 3
    <d35>   DW_AT_decl_line   : 710
    <d37>   DW_AT_decl_column : 9
    <d38>   DW_AT_sibling     : <0xdb9>
 <2><d3c>: Abbrev Number: 13 (DW_TAG_member)
    <d3d>   DW_AT_name        : CR1
    <d41>   DW_AT_decl_file   : 3
    <d42>   DW_AT_decl_line   : 712
    <d44>   DW_AT_decl_column : 17
    <d45>   DW_AT_type        : <0xa19>
    <d49>   DW_AT_data_member_location: 0
 <2><d4a>: Abbrev Number: 13 (DW_TAG_member)
    <d4b>   DW_AT_name        : CR2
    <d4f>   DW_AT_decl_file   : 3
    <d50>   DW_AT_decl_line   : 713
    <d52>   DW_AT_decl_column : 17
    <d53>   DW_AT_type        : <0xa19>
    <d57>   DW_AT_data_member_location: 4
 <2><d58>: Abbrev Number: 13 (DW_TAG_member)
    <d59>   DW_AT_name        : SR
    <d5c>   DW_AT_decl_file   : 3
    <d5d>   DW_AT_decl_line   : 714
    <d5f>   DW_AT_decl_column : 17
    <d60>   DW_AT_type        : <0xa19>
    <d64>   DW_AT_data_member_location: 8
 <2><d65>: Abbrev Number: 13 (DW_TAG_member)
    <d66>   DW_AT_name        : DR
    <d69>   DW_AT_decl_file   : 3
    <d6a>   DW_AT_decl_line   : 715
    <d6c>   DW_AT_decl_column : 17
    <d6d>   DW_AT_type        : <0xa19>
    <d71>   DW_AT_data_member_location: 12
 <2><d72>: Abbrev Number: 14 (DW_TAG_member)
    <d73>   DW_AT_name        : (indirect string, offset: 0xca91b): CRCPR
    <d77>   DW_AT_decl_file   : 3
    <d78>   DW_AT_decl_line   : 716
    <d7a>   DW_AT_decl_column : 17
    <d7b>   DW_AT_type        : <0xa19>
    <d7f>   DW_AT_data_member_location: 16
 <2><d80>: Abbrev Number: 14 (DW_TAG_member)
    <d81>   DW_AT_name        : (indirect string, offset: 0xccbc1): RXCRCR
    <d85>   DW_AT_decl_file   : 3
    <d86>   DW_AT_decl_line   : 717
    <d88>   DW_AT_decl_column : 17
    <d89>   DW_AT_type        : <0xa19>
    <d8d>   DW_AT_data_member_location: 20
 <2><d8e>: Abbrev Number: 14 (DW_TAG_member)
    <d8f>   DW_AT_name        : (indirect string, offset: 0xcc156): TXCRCR
    <d93>   DW_AT_decl_file   : 3
    <d94>   DW_AT_decl_line   : 718
    <d96>   DW_AT_decl_column : 17
    <d97>   DW_AT_type        : <0xa19>
    <d9b>   DW_AT_data_member_location: 24
 <2><d9c>: Abbrev Number: 14 (DW_TAG_member)
    <d9d>   DW_AT_name        : (indirect string, offset: 0xcb39d): I2SCFGR
    <da1>   DW_AT_decl_file   : 3
    <da2>   DW_AT_decl_line   : 719
    <da4>   DW_AT_decl_column : 17
    <da5>   DW_AT_type        : <0xa19>
    <da9>   DW_AT_data_member_location: 28
 <2><daa>: Abbrev Number: 14 (DW_TAG_member)
    <dab>   DW_AT_name        : (indirect string, offset: 0xcbe1d): I2SPR
    <daf>   DW_AT_decl_file   : 3
    <db0>   DW_AT_decl_line   : 720
    <db2>   DW_AT_decl_column : 17
    <db3>   DW_AT_type        : <0xa19>
    <db7>   DW_AT_data_member_location: 32
 <2><db8>: Abbrev Number: 0
 <1><db9>: Abbrev Number: 15 (DW_TAG_typedef)
    <dba>   DW_AT_name        : (indirect string, offset: 0xca826): SPI_TypeDef
    <dbe>   DW_AT_decl_file   : 3
    <dbf>   DW_AT_decl_line   : 721
    <dc1>   DW_AT_decl_column : 3
    <dc2>   DW_AT_type        : <0xd32>
 <1><dc6>: Abbrev Number: 12 (DW_TAG_structure_type)
    <dc7>   DW_AT_byte_size   : 84
    <dc8>   DW_AT_decl_file   : 3
    <dc9>   DW_AT_decl_line   : 728
    <dcb>   DW_AT_decl_column : 9
    <dcc>   DW_AT_sibling     : <0xef5>
 <2><dd0>: Abbrev Number: 13 (DW_TAG_member)
    <dd1>   DW_AT_name        : CR1
    <dd5>   DW_AT_decl_file   : 3
    <dd6>   DW_AT_decl_line   : 730
    <dd8>   DW_AT_decl_column : 17
    <dd9>   DW_AT_type        : <0xa19>
    <ddd>   DW_AT_data_member_location: 0
 <2><dde>: Abbrev Number: 13 (DW_TAG_member)
    <ddf>   DW_AT_name        : CR2
    <de3>   DW_AT_decl_file   : 3
    <de4>   DW_AT_decl_line   : 731
    <de6>   DW_AT_decl_column : 17
    <de7>   DW_AT_type        : <0xa19>
    <deb>   DW_AT_data_member_location: 4
 <2><dec>: Abbrev Number: 14 (DW_TAG_member)
    <ded>   DW_AT_name        : (indirect string, offset: 0x3af65): SMCR
    <df1>   DW_AT_decl_file   : 3
    <df2>   DW_AT_decl_line   : 732
    <df4>   DW_AT_decl_column : 17
    <df5>   DW_AT_type        : <0xa19>
    <df9>   DW_AT_data_member_location: 8
 <2><dfa>: Abbrev Number: 14 (DW_TAG_member)
    <dfb>   DW_AT_name        : (indirect string, offset: 0x40fe5): DIER
    <dff>   DW_AT_decl_file   : 3
    <e00>   DW_AT_decl_line   : 733
    <e02>   DW_AT_decl_column : 17
    <e03>   DW_AT_type        : <0xa19>
    <e07>   DW_AT_data_member_location: 12
 <2><e08>: Abbrev Number: 13 (DW_TAG_member)
    <e09>   DW_AT_name        : SR
    <e0c>   DW_AT_decl_file   : 3
    <e0d>   DW_AT_decl_line   : 734
    <e0f>   DW_AT_decl_column : 17
    <e10>   DW_AT_type        : <0xa19>
    <e14>   DW_AT_data_member_location: 16
 <2><e15>: Abbrev Number: 13 (DW_TAG_member)
    <e16>   DW_AT_name        : EGR
    <e1a>   DW_AT_decl_file   : 3
    <e1b>   DW_AT_decl_line   : 735
    <e1d>   DW_AT_decl_column : 17
    <e1e>   DW_AT_type        : <0xa19>
    <e22>   DW_AT_data_member_location: 20
 <2><e23>: Abbrev Number: 14 (DW_TAG_member)
    <e24>   DW_AT_name        : (indirect string, offset: 0xb63aa): CCMR1
    <e28>   DW_AT_decl_file   : 3
    <e29>   DW_AT_decl_line   : 736
    <e2b>   DW_AT_decl_column : 17
    <e2c>   DW_AT_type        : <0xa19>
    <e30>   DW_AT_data_member_location: 24
 <2><e31>: Abbrev Number: 14 (DW_TAG_member)
    <e32>   DW_AT_name        : (indirect string, offset: 0x4ff57): CCMR2
    <e36>   DW_AT_decl_file   : 3
    <e37>   DW_AT_decl_line   : 737
    <e39>   DW_AT_decl_column : 17
    <e3a>   DW_AT_type        : <0xa19>
    <e3e>   DW_AT_data_member_location: 28
 <2><e3f>: Abbrev Number: 14 (DW_TAG_member)
    <e40>   DW_AT_name        : (indirect string, offset: 0x30d6f): CCER
    <e44>   DW_AT_decl_file   : 3
    <e45>   DW_AT_decl_line   : 738
    <e47>   DW_AT_decl_column : 17
    <e48>   DW_AT_type        : <0xa19>
    <e4c>   DW_AT_data_member_location: 32
 <2><e4d>: Abbrev Number: 13 (DW_TAG_member)
    <e4e>   DW_AT_name        : CNT
    <e52>   DW_AT_decl_file   : 3
    <e53>   DW_AT_decl_line   : 739
    <e55>   DW_AT_decl_column : 17
    <e56>   DW_AT_type        : <0xa19>
    <e5a>   DW_AT_data_member_location: 36
 <2><e5b>: Abbrev Number: 13 (DW_TAG_member)
    <e5c>   DW_AT_name        : PSC
    <e60>   DW_AT_decl_file   : 3
    <e61>   DW_AT_decl_line   : 740
    <e63>   DW_AT_decl_column : 17
    <e64>   DW_AT_type        : <0xa19>
    <e68>   DW_AT_data_member_location: 40
 <2><e69>: Abbrev Number: 13 (DW_TAG_member)
    <e6a>   DW_AT_name        : ARR
    <e6e>   DW_AT_decl_file   : 3
    <e6f>   DW_AT_decl_line   : 741
    <e71>   DW_AT_decl_column : 17
    <e72>   DW_AT_type        : <0xa19>
    <e76>   DW_AT_data_member_location: 44
 <2><e77>: Abbrev Number: 13 (DW_TAG_member)
    <e78>   DW_AT_name        : RCR
    <e7c>   DW_AT_decl_file   : 3
    <e7d>   DW_AT_decl_line   : 742
    <e7f>   DW_AT_decl_column : 17
    <e80>   DW_AT_type        : <0xa19>
    <e84>   DW_AT_data_member_location: 48
 <2><e85>: Abbrev Number: 14 (DW_TAG_member)
    <e86>   DW_AT_name        : (indirect string, offset: 0x17e09): CCR1
    <e8a>   DW_AT_decl_file   : 3
    <e8b>   DW_AT_decl_line   : 743
    <e8d>   DW_AT_decl_column : 17
    <e8e>   DW_AT_type        : <0xa19>
    <e92>   DW_AT_data_member_location: 52
 <2><e93>: Abbrev Number: 14 (DW_TAG_member)
    <e94>   DW_AT_name        : (indirect string, offset: 0x53e8c): CCR2
    <e98>   DW_AT_decl_file   : 3
    <e99>   DW_AT_decl_line   : 744
    <e9b>   DW_AT_decl_column : 17
    <e9c>   DW_AT_type        : <0xa19>
    <ea0>   DW_AT_data_member_location: 56
 <2><ea1>: Abbrev Number: 14 (DW_TAG_member)
    <ea2>   DW_AT_name        : (indirect string, offset: 0x98930): CCR3
    <ea6>   DW_AT_decl_file   : 3
    <ea7>   DW_AT_decl_line   : 745
    <ea9>   DW_AT_decl_column : 17
    <eaa>   DW_AT_type        : <0xa19>
    <eae>   DW_AT_data_member_location: 60
 <2><eaf>: Abbrev Number: 14 (DW_TAG_member)
    <eb0>   DW_AT_name        : (indirect string, offset: 0xc403): CCR4
    <eb4>   DW_AT_decl_file   : 3
    <eb5>   DW_AT_decl_line   : 746
    <eb7>   DW_AT_decl_column : 17
    <eb8>   DW_AT_type        : <0xa19>
    <ebc>   DW_AT_data_member_location: 64
 <2><ebd>: Abbrev Number: 14 (DW_TAG_member)
    <ebe>   DW_AT_name        : (indirect string, offset: 0x54a2f): BDTR
    <ec2>   DW_AT_decl_file   : 3
    <ec3>   DW_AT_decl_line   : 747
    <ec5>   DW_AT_decl_column : 17
    <ec6>   DW_AT_type        : <0xa19>
    <eca>   DW_AT_data_member_location: 68
 <2><ecb>: Abbrev Number: 13 (DW_TAG_member)
    <ecc>   DW_AT_name        : DCR
    <ed0>   DW_AT_decl_file   : 3
    <ed1>   DW_AT_decl_line   : 748
    <ed3>   DW_AT_decl_column : 17
    <ed4>   DW_AT_type        : <0xa19>
    <ed8>   DW_AT_data_member_location: 72
 <2><ed9>: Abbrev Number: 14 (DW_TAG_member)
    <eda>   DW_AT_name        : (indirect string, offset: 0xab80b): DMAR
    <ede>   DW_AT_decl_file   : 3
    <edf>   DW_AT_decl_line   : 749
    <ee1>   DW_AT_decl_column : 17
    <ee2>   DW_AT_type        : <0xa19>
    <ee6>   DW_AT_data_member_location: 76
 <2><ee7>: Abbrev Number: 13 (DW_TAG_member)
    <ee8>   DW_AT_name        : OR
    <eeb>   DW_AT_decl_file   : 3
    <eec>   DW_AT_decl_line   : 750
    <eee>   DW_AT_decl_column : 17
    <eef>   DW_AT_type        : <0xa19>
    <ef3>   DW_AT_data_member_location: 80
 <2><ef4>: Abbrev Number: 0
 <1><ef5>: Abbrev Number: 15 (DW_TAG_typedef)
    <ef6>   DW_AT_name        : (indirect string, offset: 0xbd308): TIM_TypeDef
    <efa>   DW_AT_decl_file   : 3
    <efb>   DW_AT_decl_line   : 751
    <efd>   DW_AT_decl_column : 3
    <efe>   DW_AT_type        : <0xdc6>
 <1><f02>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f03>   DW_AT_byte_size   : 28
    <f04>   DW_AT_decl_file   : 3
    <f05>   DW_AT_decl_line   : 757
    <f07>   DW_AT_decl_column : 9
    <f08>   DW_AT_sibling     : <0xf6d>
 <2><f0c>: Abbrev Number: 13 (DW_TAG_member)
    <f0d>   DW_AT_name        : SR
    <f10>   DW_AT_decl_file   : 3
    <f11>   DW_AT_decl_line   : 759
    <f13>   DW_AT_decl_column : 17
    <f14>   DW_AT_type        : <0xa19>
    <f18>   DW_AT_data_member_location: 0
 <2><f19>: Abbrev Number: 13 (DW_TAG_member)
    <f1a>   DW_AT_name        : DR
    <f1d>   DW_AT_decl_file   : 3
    <f1e>   DW_AT_decl_line   : 760
    <f20>   DW_AT_decl_column : 17
    <f21>   DW_AT_type        : <0xa19>
    <f25>   DW_AT_data_member_location: 4
 <2><f26>: Abbrev Number: 13 (DW_TAG_member)
    <f27>   DW_AT_name        : BRR
    <f2b>   DW_AT_decl_file   : 3
    <f2c>   DW_AT_decl_line   : 761
    <f2e>   DW_AT_decl_column : 17
    <f2f>   DW_AT_type        : <0xa19>
    <f33>   DW_AT_data_member_location: 8
 <2><f34>: Abbrev Number: 13 (DW_TAG_member)
    <f35>   DW_AT_name        : CR1
    <f39>   DW_AT_decl_file   : 3
    <f3a>   DW_AT_decl_line   : 762
    <f3c>   DW_AT_decl_column : 17
    <f3d>   DW_AT_type        : <0xa19>
    <f41>   DW_AT_data_member_location: 12
 <2><f42>: Abbrev Number: 13 (DW_TAG_member)
    <f43>   DW_AT_name        : CR2
    <f47>   DW_AT_decl_file   : 3
    <f48>   DW_AT_decl_line   : 763
    <f4a>   DW_AT_decl_column : 17
    <f4b>   DW_AT_type        : <0xa19>
    <f4f>   DW_AT_data_member_location: 16
 <2><f50>: Abbrev Number: 13 (DW_TAG_member)
    <f51>   DW_AT_name        : CR3
    <f55>   DW_AT_decl_file   : 3
    <f56>   DW_AT_decl_line   : 764
    <f58>   DW_AT_decl_column : 17
    <f59>   DW_AT_type        : <0xa19>
    <f5d>   DW_AT_data_member_location: 20
 <2><f5e>: Abbrev Number: 14 (DW_TAG_member)
    <f5f>   DW_AT_name        : (indirect string, offset: 0xcacbb): GTPR
    <f63>   DW_AT_decl_file   : 3
    <f64>   DW_AT_decl_line   : 765
    <f66>   DW_AT_decl_column : 17
    <f67>   DW_AT_type        : <0xa19>
    <f6b>   DW_AT_data_member_location: 24
 <2><f6c>: Abbrev Number: 0
 <1><f6d>: Abbrev Number: 15 (DW_TAG_typedef)
    <f6e>   DW_AT_name        : (indirect string, offset: 0xcf484): USART_TypeDef
    <f72>   DW_AT_decl_file   : 3
    <f73>   DW_AT_decl_line   : 766
    <f75>   DW_AT_decl_column : 3
    <f76>   DW_AT_type        : <0xf02>
 <1><f7a>: Abbrev Number: 6 (DW_TAG_typedef)
    <f7b>   DW_AT_name        : (indirect string, offset: 0x84af): size_t
    <f7f>   DW_AT_decl_file   : 6
    <f80>   DW_AT_decl_line   : 209
    <f81>   DW_AT_decl_column : 23
    <f82>   DW_AT_type        : <0x9cc>
 <1><f86>: Abbrev Number: 5 (DW_TAG_base_type)
    <f87>   DW_AT_byte_size   : 8
    <f88>   DW_AT_encoding    : 4	(float)
    <f89>   DW_AT_name        : (indirect string, offset: 0xca1aa): long double
 <1><f8d>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <f8e>   DW_AT_encoding    : 7	(unsigned)
    <f8f>   DW_AT_byte_size   : 1
    <f90>   DW_AT_type        : <0x970>
    <f94>   DW_AT_decl_file   : 7
    <f95>   DW_AT_decl_line   : 39
    <f96>   DW_AT_decl_column : 1
    <f97>   DW_AT_sibling     : <0xfb4>
 <2><f9b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f9c>   DW_AT_name        : (indirect string, offset: 0x43ace): HAL_OK
    <fa0>   DW_AT_const_value : 0
 <2><fa1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fa2>   DW_AT_name        : (indirect string, offset: 0x7d25e): HAL_ERROR
    <fa6>   DW_AT_const_value : 1
 <2><fa7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fa8>   DW_AT_name        : (indirect string, offset: 0x23456): HAL_BUSY
    <fac>   DW_AT_const_value : 2
 <2><fad>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fae>   DW_AT_name        : (indirect string, offset: 0x3aeae): HAL_TIMEOUT
    <fb2>   DW_AT_const_value : 3
 <2><fb3>: Abbrev Number: 0
 <1><fb4>: Abbrev Number: 6 (DW_TAG_typedef)
    <fb5>   DW_AT_name        : (indirect string, offset: 0x2345): HAL_StatusTypeDef
    <fb9>   DW_AT_decl_file   : 7
    <fba>   DW_AT_decl_line   : 44
    <fbb>   DW_AT_decl_column : 3
    <fbc>   DW_AT_type        : <0xf8d>
 <1><fc0>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <fc1>   DW_AT_encoding    : 7	(unsigned)
    <fc2>   DW_AT_byte_size   : 1
    <fc3>   DW_AT_type        : <0x970>
    <fc7>   DW_AT_decl_file   : 7
    <fc8>   DW_AT_decl_line   : 50
    <fc9>   DW_AT_decl_column : 1
    <fca>   DW_AT_sibling     : <0xfdb>
 <2><fce>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fcf>   DW_AT_name        : (indirect string, offset: 0x93af7): HAL_UNLOCKED
    <fd3>   DW_AT_const_value : 0
 <2><fd4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fd5>   DW_AT_name        : (indirect string, offset: 0xc7f50): HAL_LOCKED
    <fd9>   DW_AT_const_value : 1
 <2><fda>: Abbrev Number: 0
 <1><fdb>: Abbrev Number: 6 (DW_TAG_typedef)
    <fdc>   DW_AT_name        : (indirect string, offset: 0x7647f): HAL_LockTypeDef
    <fe0>   DW_AT_decl_file   : 7
    <fe1>   DW_AT_decl_line   : 53
    <fe2>   DW_AT_decl_column : 3
    <fe3>   DW_AT_type        : <0xfc0>
 <1><fe7>: Abbrev Number: 16 (DW_TAG_structure_type)
    <fe8>   DW_AT_byte_size   : 24
    <fe9>   DW_AT_decl_file   : 8
    <fea>   DW_AT_decl_line   : 45
    <feb>   DW_AT_decl_column : 9
    <fec>   DW_AT_sibling     : <0x103f>
 <2><ff0>: Abbrev Number: 17 (DW_TAG_member)
    <ff1>   DW_AT_name        : (indirect string, offset: 0xcd5a0): PLLState
    <ff5>   DW_AT_decl_file   : 8
    <ff6>   DW_AT_decl_line   : 47
    <ff7>   DW_AT_decl_column : 12
    <ff8>   DW_AT_type        : <0xa0d>
    <ffc>   DW_AT_data_member_location: 0
 <2><ffd>: Abbrev Number: 17 (DW_TAG_member)
    <ffe>   DW_AT_name        : (indirect string, offset: 0xcd898): PLLSource
    <1002>   DW_AT_decl_file   : 8
    <1003>   DW_AT_decl_line   : 50
    <1004>   DW_AT_decl_column : 12
    <1005>   DW_AT_type        : <0xa0d>
    <1009>   DW_AT_data_member_location: 4
 <2><100a>: Abbrev Number: 17 (DW_TAG_member)
    <100b>   DW_AT_name        : (indirect string, offset: 0xce32f): PLLM
    <100f>   DW_AT_decl_file   : 8
    <1010>   DW_AT_decl_line   : 53
    <1011>   DW_AT_decl_column : 12
    <1012>   DW_AT_type        : <0xa0d>
    <1016>   DW_AT_data_member_location: 8
 <2><1017>: Abbrev Number: 17 (DW_TAG_member)
    <1018>   DW_AT_name        : (indirect string, offset: 0xce334): PLLN
    <101c>   DW_AT_decl_file   : 8
    <101d>   DW_AT_decl_line   : 56
    <101e>   DW_AT_decl_column : 12
    <101f>   DW_AT_type        : <0xa0d>
    <1023>   DW_AT_data_member_location: 12
 <2><1024>: Abbrev Number: 17 (DW_TAG_member)
    <1025>   DW_AT_name        : (indirect string, offset: 0xce339): PLLP
    <1029>   DW_AT_decl_file   : 8
    <102a>   DW_AT_decl_line   : 60
    <102b>   DW_AT_decl_column : 12
    <102c>   DW_AT_type        : <0xa0d>
    <1030>   DW_AT_data_member_location: 16
 <2><1031>: Abbrev Number: 17 (DW_TAG_member)
    <1032>   DW_AT_name        : (indirect string, offset: 0x4aa1f): PLLQ
    <1036>   DW_AT_decl_file   : 8
    <1037>   DW_AT_decl_line   : 63
    <1038>   DW_AT_decl_column : 12
    <1039>   DW_AT_type        : <0xa0d>
    <103d>   DW_AT_data_member_location: 20
 <2><103e>: Abbrev Number: 0
 <1><103f>: Abbrev Number: 6 (DW_TAG_typedef)
    <1040>   DW_AT_name        : (indirect string, offset: 0xccc8d): RCC_PLLInitTypeDef
    <1044>   DW_AT_decl_file   : 8
    <1045>   DW_AT_decl_line   : 73
    <1046>   DW_AT_decl_column : 2
    <1047>   DW_AT_type        : <0xfe7>
 <1><104b>: Abbrev Number: 16 (DW_TAG_structure_type)
    <104c>   DW_AT_byte_size   : 48
    <104d>   DW_AT_decl_file   : 9
    <104e>   DW_AT_decl_line   : 49
    <104f>   DW_AT_decl_column : 9
    <1050>   DW_AT_sibling     : <0x10b0>
 <2><1054>: Abbrev Number: 17 (DW_TAG_member)
    <1055>   DW_AT_name        : (indirect string, offset: 0xce210): OscillatorType
    <1059>   DW_AT_decl_file   : 9
    <105a>   DW_AT_decl_line   : 51
    <105b>   DW_AT_decl_column : 12
    <105c>   DW_AT_type        : <0xa0d>
    <1060>   DW_AT_data_member_location: 0
 <2><1061>: Abbrev Number: 17 (DW_TAG_member)
    <1062>   DW_AT_name        : (indirect string, offset: 0xcd68f): HSEState
    <1066>   DW_AT_decl_file   : 9
    <1067>   DW_AT_decl_line   : 54
    <1068>   DW_AT_decl_column : 12
    <1069>   DW_AT_type        : <0xa0d>
    <106d>   DW_AT_data_member_location: 4
 <2><106e>: Abbrev Number: 17 (DW_TAG_member)
    <106f>   DW_AT_name        : (indirect string, offset: 0xccee3): LSEState
    <1073>   DW_AT_decl_file   : 9
    <1074>   DW_AT_decl_line   : 57
    <1075>   DW_AT_decl_column : 12
    <1076>   DW_AT_type        : <0xa0d>
    <107a>   DW_AT_data_member_location: 8
 <2><107b>: Abbrev Number: 17 (DW_TAG_member)
    <107c>   DW_AT_name        : (indirect string, offset: 0xcbb6a): HSIState
    <1080>   DW_AT_decl_file   : 9
    <1081>   DW_AT_decl_line   : 60
    <1082>   DW_AT_decl_column : 12
    <1083>   DW_AT_type        : <0xa0d>
    <1087>   DW_AT_data_member_location: 12
 <2><1088>: Abbrev Number: 17 (DW_TAG_member)
    <1089>   DW_AT_name        : (indirect string, offset: 0xce710): HSICalibrationValue
    <108d>   DW_AT_decl_file   : 9
    <108e>   DW_AT_decl_line   : 63
    <108f>   DW_AT_decl_column : 12
    <1090>   DW_AT_type        : <0xa0d>
    <1094>   DW_AT_data_member_location: 16
 <2><1095>: Abbrev Number: 17 (DW_TAG_member)
    <1096>   DW_AT_name        : (indirect string, offset: 0xcb476): LSIState
    <109a>   DW_AT_decl_file   : 9
    <109b>   DW_AT_decl_line   : 66
    <109c>   DW_AT_decl_column : 12
    <109d>   DW_AT_type        : <0xa0d>
    <10a1>   DW_AT_data_member_location: 20
 <2><10a2>: Abbrev Number: 18 (DW_TAG_member)
    <10a3>   DW_AT_name        : PLL
    <10a7>   DW_AT_decl_file   : 9
    <10a8>   DW_AT_decl_line   : 69
    <10a9>   DW_AT_decl_column : 22
    <10aa>   DW_AT_type        : <0x103f>
    <10ae>   DW_AT_data_member_location: 24
 <2><10af>: Abbrev Number: 0
 <1><10b0>: Abbrev Number: 6 (DW_TAG_typedef)
    <10b1>   DW_AT_name        : (indirect string, offset: 0xcc43b): RCC_OscInitTypeDef
    <10b5>   DW_AT_decl_file   : 9
    <10b6>   DW_AT_decl_line   : 70
    <10b7>   DW_AT_decl_column : 2
    <10b8>   DW_AT_type        : <0x104b>
 <1><10bc>: Abbrev Number: 16 (DW_TAG_structure_type)
    <10bd>   DW_AT_byte_size   : 20
    <10be>   DW_AT_decl_file   : 9
    <10bf>   DW_AT_decl_line   : 75
    <10c0>   DW_AT_decl_column : 9
    <10c1>   DW_AT_sibling     : <0x1107>
 <2><10c5>: Abbrev Number: 17 (DW_TAG_member)
    <10c6>   DW_AT_name        : (indirect string, offset: 0xcb112): ClockType
    <10ca>   DW_AT_decl_file   : 9
    <10cb>   DW_AT_decl_line   : 77
    <10cc>   DW_AT_decl_column : 12
    <10cd>   DW_AT_type        : <0xa0d>
    <10d1>   DW_AT_data_member_location: 0
 <2><10d2>: Abbrev Number: 17 (DW_TAG_member)
    <10d3>   DW_AT_name        : (indirect string, offset: 0xccc6e): SYSCLKSource
    <10d7>   DW_AT_decl_file   : 9
