Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x6f3 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xc332d): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xc6c17): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xb5667): C:/Users/crazy/STM32CubeIDE/workspace_1.10.0/LIS3DSH_USB_HID/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0x101ec): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x5be37): long long int
 <1><3e>: Abbrev Number: 3 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 8
    <40>   DW_AT_encoding    : 4	(float)
    <41>   DW_AT_name        : (indirect string, offset: 0xcb7ad): long double
 <1><45>: Abbrev Number: 3 (DW_TAG_base_type)
    <46>   DW_AT_byte_size   : 1
    <47>   DW_AT_encoding    : 6	(signed char)
    <48>   DW_AT_name        : (indirect string, offset: 0x64ba0): signed char
 <1><4c>: Abbrev Number: 3 (DW_TAG_base_type)
    <4d>   DW_AT_byte_size   : 1
    <4e>   DW_AT_encoding    : 8	(unsigned char)
    <4f>   DW_AT_name        : (indirect string, offset: 0xc20c4): unsigned char
 <1><53>: Abbrev Number: 3 (DW_TAG_base_type)
    <54>   DW_AT_byte_size   : 2
    <55>   DW_AT_encoding    : 5	(signed)
    <56>   DW_AT_name        : (indirect string, offset: 0x95afb): short int
 <1><5a>: Abbrev Number: 3 (DW_TAG_base_type)
    <5b>   DW_AT_byte_size   : 2
    <5c>   DW_AT_encoding    : 7	(unsigned)
    <5d>   DW_AT_name        : (indirect string, offset: 0xc0818): short unsigned int
 <1><61>: Abbrev Number: 3 (DW_TAG_base_type)
    <62>   DW_AT_byte_size   : 4
    <63>   DW_AT_encoding    : 5	(signed)
    <64>   DW_AT_name        : (indirect string, offset: 0x10b39): long int
 <1><68>: Abbrev Number: 4 (DW_TAG_typedef)
    <69>   DW_AT_name        : (indirect string, offset: 0x802a5): __uint32_t
    <6d>   DW_AT_decl_file   : 2
    <6e>   DW_AT_decl_line   : 79
    <6f>   DW_AT_decl_column : 25
    <70>   DW_AT_type        : <0x74>
 <1><74>: Abbrev Number: 3 (DW_TAG_base_type)
    <75>   DW_AT_byte_size   : 4
    <76>   DW_AT_encoding    : 7	(unsigned)
    <77>   DW_AT_name        : (indirect string, offset: 0x4d081): long unsigned int
 <1><7b>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <7c>   DW_AT_type        : <0x74>
 <1><80>: Abbrev Number: 3 (DW_TAG_base_type)
    <81>   DW_AT_byte_size   : 8
    <82>   DW_AT_encoding    : 7	(unsigned)
    <83>   DW_AT_name        : (indirect string, offset: 0x2a1f1): long long unsigned int
 <1><87>: Abbrev Number: 4 (DW_TAG_typedef)
    <88>   DW_AT_name        : (indirect string, offset: 0x91d60): uint32_t
    <8c>   DW_AT_decl_file   : 3
    <8d>   DW_AT_decl_line   : 48
    <8e>   DW_AT_decl_column : 20
    <8f>   DW_AT_type        : <0x68>
 <1><93>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <94>   DW_AT_type        : <0x87>
 <1><98>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <99>   DW_AT_byte_size   : 4
 <1><9a>: Abbrev Number: 3 (DW_TAG_base_type)
    <9b>   DW_AT_byte_size   : 1
    <9c>   DW_AT_encoding    : 8	(unsigned char)
    <9d>   DW_AT_name        : (indirect string, offset: 0x4186d): char
 <1><a1>: Abbrev Number: 7 (DW_TAG_structure_type)
    <a2>   DW_AT_byte_size   : 24
    <a3>   DW_AT_decl_file   : 4
    <a4>   DW_AT_decl_line   : 345
    <a6>   DW_AT_decl_column : 9
    <a7>   DW_AT_sibling     : <0xff>
 <2><ab>: Abbrev Number: 8 (DW_TAG_member)
    <ac>   DW_AT_name        : CR
    <af>   DW_AT_decl_file   : 4
    <b0>   DW_AT_decl_line   : 347
    <b2>   DW_AT_decl_column : 17
    <b3>   DW_AT_type        : <0x93>
    <b7>   DW_AT_data_member_location: 0
 <2><b8>: Abbrev Number: 9 (DW_TAG_member)
    <b9>   DW_AT_name        : (indirect string, offset: 0x4c8eb): NDTR
    <bd>   DW_AT_decl_file   : 4
    <be>   DW_AT_decl_line   : 348
    <c0>   DW_AT_decl_column : 17
    <c1>   DW_AT_type        : <0x93>
    <c5>   DW_AT_data_member_location: 4
 <2><c6>: Abbrev Number: 8 (DW_TAG_member)
    <c7>   DW_AT_name        : PAR
    <cb>   DW_AT_decl_file   : 4
    <cc>   DW_AT_decl_line   : 349
    <ce>   DW_AT_decl_column : 17
    <cf>   DW_AT_type        : <0x93>
    <d3>   DW_AT_data_member_location: 8
 <2><d4>: Abbrev Number: 9 (DW_TAG_member)
    <d5>   DW_AT_name        : (indirect string, offset: 0x53ac9): M0AR
    <d9>   DW_AT_decl_file   : 4
    <da>   DW_AT_decl_line   : 350
    <dc>   DW_AT_decl_column : 17
    <dd>   DW_AT_type        : <0x93>
    <e1>   DW_AT_data_member_location: 12
 <2><e2>: Abbrev Number: 9 (DW_TAG_member)
    <e3>   DW_AT_name        : (indirect string, offset: 0x6f84f): M1AR
    <e7>   DW_AT_decl_file   : 4
    <e8>   DW_AT_decl_line   : 351
    <ea>   DW_AT_decl_column : 17
    <eb>   DW_AT_type        : <0x93>
    <ef>   DW_AT_data_member_location: 16
 <2><f0>: Abbrev Number: 8 (DW_TAG_member)
    <f1>   DW_AT_name        : FCR
    <f5>   DW_AT_decl_file   : 4
    <f6>   DW_AT_decl_line   : 352
    <f8>   DW_AT_decl_column : 17
    <f9>   DW_AT_type        : <0x93>
    <fd>   DW_AT_data_member_location: 20
 <2><fe>: Abbrev Number: 0
 <1><ff>: Abbrev Number: 10 (DW_TAG_typedef)
    <100>   DW_AT_name        : (indirect string, offset: 0xb66a3): DMA_Stream_TypeDef
    <104>   DW_AT_decl_file   : 4
    <105>   DW_AT_decl_line   : 353
    <107>   DW_AT_decl_column : 3
    <108>   DW_AT_type        : <0xa1>
 <1><10c>: Abbrev Number: 7 (DW_TAG_structure_type)
    <10d>   DW_AT_byte_size   : 84
    <10e>   DW_AT_decl_file   : 4
    <10f>   DW_AT_decl_line   : 728
    <111>   DW_AT_decl_column : 9
    <112>   DW_AT_sibling     : <0x23b>
 <2><116>: Abbrev Number: 8 (DW_TAG_member)
    <117>   DW_AT_name        : CR1
    <11b>   DW_AT_decl_file   : 4
    <11c>   DW_AT_decl_line   : 730
    <11e>   DW_AT_decl_column : 17
    <11f>   DW_AT_type        : <0x93>
    <123>   DW_AT_data_member_location: 0
 <2><124>: Abbrev Number: 8 (DW_TAG_member)
    <125>   DW_AT_name        : CR2
    <129>   DW_AT_decl_file   : 4
    <12a>   DW_AT_decl_line   : 731
    <12c>   DW_AT_decl_column : 17
    <12d>   DW_AT_type        : <0x93>
    <131>   DW_AT_data_member_location: 4
 <2><132>: Abbrev Number: 9 (DW_TAG_member)
    <133>   DW_AT_name        : (indirect string, offset: 0x3b519): SMCR
    <137>   DW_AT_decl_file   : 4
    <138>   DW_AT_decl_line   : 732
    <13a>   DW_AT_decl_column : 17
    <13b>   DW_AT_type        : <0x93>
    <13f>   DW_AT_data_member_location: 8
 <2><140>: Abbrev Number: 9 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x4167b): DIER
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 733
    <148>   DW_AT_decl_column : 17
    <149>   DW_AT_type        : <0x93>
    <14d>   DW_AT_data_member_location: 12
 <2><14e>: Abbrev Number: 8 (DW_TAG_member)
    <14f>   DW_AT_name        : SR
    <152>   DW_AT_decl_file   : 4
    <153>   DW_AT_decl_line   : 734
    <155>   DW_AT_decl_column : 17
    <156>   DW_AT_type        : <0x93>
    <15a>   DW_AT_data_member_location: 16
 <2><15b>: Abbrev Number: 8 (DW_TAG_member)
    <15c>   DW_AT_name        : EGR
    <160>   DW_AT_decl_file   : 4
    <161>   DW_AT_decl_line   : 735
    <163>   DW_AT_decl_column : 17
    <164>   DW_AT_type        : <0x93>
    <168>   DW_AT_data_member_location: 20
 <2><169>: Abbrev Number: 9 (DW_TAG_member)
    <16a>   DW_AT_name        : (indirect string, offset: 0xb7458): CCMR1
    <16e>   DW_AT_decl_file   : 4
    <16f>   DW_AT_decl_line   : 736
    <171>   DW_AT_decl_column : 17
    <172>   DW_AT_type        : <0x93>
    <176>   DW_AT_data_member_location: 24
 <2><177>: Abbrev Number: 9 (DW_TAG_member)
    <178>   DW_AT_name        : (indirect string, offset: 0x506be): CCMR2
    <17c>   DW_AT_decl_file   : 4
    <17d>   DW_AT_decl_line   : 737
    <17f>   DW_AT_decl_column : 17
    <180>   DW_AT_type        : <0x93>
    <184>   DW_AT_data_member_location: 28
 <2><185>: Abbrev Number: 9 (DW_TAG_member)
    <186>   DW_AT_name        : (indirect string, offset: 0x31146): CCER
    <18a>   DW_AT_decl_file   : 4
    <18b>   DW_AT_decl_line   : 738
    <18d>   DW_AT_decl_column : 17
    <18e>   DW_AT_type        : <0x93>
    <192>   DW_AT_data_member_location: 32
 <2><193>: Abbrev Number: 8 (DW_TAG_member)
    <194>   DW_AT_name        : CNT
    <198>   DW_AT_decl_file   : 4
    <199>   DW_AT_decl_line   : 739
    <19b>   DW_AT_decl_column : 17
    <19c>   DW_AT_type        : <0x93>
    <1a0>   DW_AT_data_member_location: 36
 <2><1a1>: Abbrev Number: 8 (DW_TAG_member)
    <1a2>   DW_AT_name        : PSC
    <1a6>   DW_AT_decl_file   : 4
    <1a7>   DW_AT_decl_line   : 740
    <1a9>   DW_AT_decl_column : 17
    <1aa>   DW_AT_type        : <0x93>
    <1ae>   DW_AT_data_member_location: 40
 <2><1af>: Abbrev Number: 8 (DW_TAG_member)
    <1b0>   DW_AT_name        : ARR
    <1b4>   DW_AT_decl_file   : 4
    <1b5>   DW_AT_decl_line   : 741
    <1b7>   DW_AT_decl_column : 17
    <1b8>   DW_AT_type        : <0x93>
    <1bc>   DW_AT_data_member_location: 44
 <2><1bd>: Abbrev Number: 8 (DW_TAG_member)
    <1be>   DW_AT_name        : RCR
    <1c2>   DW_AT_decl_file   : 4
    <1c3>   DW_AT_decl_line   : 742
    <1c5>   DW_AT_decl_column : 17
    <1c6>   DW_AT_type        : <0x93>
    <1ca>   DW_AT_data_member_location: 48
 <2><1cb>: Abbrev Number: 9 (DW_TAG_member)
    <1cc>   DW_AT_name        : (indirect string, offset: 0x18050): CCR1
    <1d0>   DW_AT_decl_file   : 4
    <1d1>   DW_AT_decl_line   : 743
    <1d3>   DW_AT_decl_column : 17
    <1d4>   DW_AT_type        : <0x93>
    <1d8>   DW_AT_data_member_location: 52
 <2><1d9>: Abbrev Number: 9 (DW_TAG_member)
    <1da>   DW_AT_name        : (indirect string, offset: 0x54615): CCR2
    <1de>   DW_AT_decl_file   : 4
    <1df>   DW_AT_decl_line   : 744
    <1e1>   DW_AT_decl_column : 17
    <1e2>   DW_AT_type        : <0x93>
    <1e6>   DW_AT_data_member_location: 56
 <2><1e7>: Abbrev Number: 9 (DW_TAG_member)
    <1e8>   DW_AT_name        : (indirect string, offset: 0x99751): CCR3
    <1ec>   DW_AT_decl_file   : 4
    <1ed>   DW_AT_decl_line   : 745
    <1ef>   DW_AT_decl_column : 17
    <1f0>   DW_AT_type        : <0x93>
    <1f4>   DW_AT_data_member_location: 60
 <2><1f5>: Abbrev Number: 9 (DW_TAG_member)
    <1f6>   DW_AT_name        : (indirect string, offset: 0xc49e): CCR4
    <1fa>   DW_AT_decl_file   : 4
    <1fb>   DW_AT_decl_line   : 746
    <1fd>   DW_AT_decl_column : 17
    <1fe>   DW_AT_type        : <0x93>
    <202>   DW_AT_data_member_location: 64
 <2><203>: Abbrev Number: 9 (DW_TAG_member)
    <204>   DW_AT_name        : (indirect string, offset: 0x551b8): BDTR
    <208>   DW_AT_decl_file   : 4
    <209>   DW_AT_decl_line   : 747
    <20b>   DW_AT_decl_column : 17
    <20c>   DW_AT_type        : <0x93>
    <210>   DW_AT_data_member_location: 68
 <2><211>: Abbrev Number: 8 (DW_TAG_member)
    <212>   DW_AT_name        : DCR
    <216>   DW_AT_decl_file   : 4
    <217>   DW_AT_decl_line   : 748
    <219>   DW_AT_decl_column : 17
    <21a>   DW_AT_type        : <0x93>
    <21e>   DW_AT_data_member_location: 72
 <2><21f>: Abbrev Number: 9 (DW_TAG_member)
    <220>   DW_AT_name        : (indirect string, offset: 0xac7c2): DMAR
    <224>   DW_AT_decl_file   : 4
    <225>   DW_AT_decl_line   : 749
    <227>   DW_AT_decl_column : 17
    <228>   DW_AT_type        : <0x93>
    <22c>   DW_AT_data_member_location: 76
 <2><22d>: Abbrev Number: 8 (DW_TAG_member)
    <22e>   DW_AT_name        : OR
    <231>   DW_AT_decl_file   : 4
    <232>   DW_AT_decl_line   : 750
    <234>   DW_AT_decl_column : 17
    <235>   DW_AT_type        : <0x93>
    <239>   DW_AT_data_member_location: 80
 <2><23a>: Abbrev Number: 0
 <1><23b>: Abbrev Number: 10 (DW_TAG_typedef)
    <23c>   DW_AT_name        : (indirect string, offset: 0xbe4f7): TIM_TypeDef
    <240>   DW_AT_decl_file   : 4
    <241>   DW_AT_decl_line   : 751
    <243>   DW_AT_decl_column : 3
    <244>   DW_AT_type        : <0x10c>
 <1><248>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <249>   DW_AT_encoding    : 7	(unsigned)
    <24a>   DW_AT_byte_size   : 1
    <24b>   DW_AT_type        : <0x4c>
    <24f>   DW_AT_decl_file   : 5
    <250>   DW_AT_decl_line   : 39
    <251>   DW_AT_decl_column : 1
    <252>   DW_AT_sibling     : <0x26f>
 <2><256>: Abbrev Number: 12 (DW_TAG_enumerator)
    <257>   DW_AT_name        : (indirect string, offset: 0x44173): HAL_OK
    <25b>   DW_AT_const_value : 0
 <2><25c>: Abbrev Number: 12 (DW_TAG_enumerator)
    <25d>   DW_AT_name        : (indirect string, offset: 0x7deb9): HAL_ERROR
    <261>   DW_AT_const_value : 1
 <2><262>: Abbrev Number: 12 (DW_TAG_enumerator)
    <263>   DW_AT_name        : (indirect string, offset: 0x2375e): HAL_BUSY
    <267>   DW_AT_const_value : 2
 <2><268>: Abbrev Number: 12 (DW_TAG_enumerator)
    <269>   DW_AT_name        : (indirect string, offset: 0x3b462): HAL_TIMEOUT
    <26d>   DW_AT_const_value : 3
 <2><26e>: Abbrev Number: 0
 <1><26f>: Abbrev Number: 4 (DW_TAG_typedef)
    <270>   DW_AT_name        : (indirect string, offset: 0x2345): HAL_StatusTypeDef
    <274>   DW_AT_decl_file   : 5
    <275>   DW_AT_decl_line   : 44
    <276>   DW_AT_decl_column : 3
    <277>   DW_AT_type        : <0x248>
 <1><27b>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <27c>   DW_AT_encoding    : 7	(unsigned)
    <27d>   DW_AT_byte_size   : 1
    <27e>   DW_AT_type        : <0x4c>
    <282>   DW_AT_decl_file   : 5
    <283>   DW_AT_decl_line   : 50
    <284>   DW_AT_decl_column : 1
    <285>   DW_AT_sibling     : <0x296>
 <2><289>: Abbrev Number: 12 (DW_TAG_enumerator)
    <28a>   DW_AT_name        : (indirect string, offset: 0x948c5): HAL_UNLOCKED
    <28e>   DW_AT_const_value : 0
 <2><28f>: Abbrev Number: 12 (DW_TAG_enumerator)
    <290>   DW_AT_name        : (indirect string, offset: 0xc9286): HAL_LOCKED
    <294>   DW_AT_const_value : 1
 <2><295>: Abbrev Number: 0
 <1><296>: Abbrev Number: 4 (DW_TAG_typedef)
    <297>   DW_AT_name        : (indirect string, offset: 0x76fa3): HAL_LockTypeDef
    <29b>   DW_AT_decl_file   : 5
    <29c>   DW_AT_decl_line   : 53
    <29d>   DW_AT_decl_column : 3
    <29e>   DW_AT_type        : <0x27b>
 <1><2a2>: Abbrev Number: 13 (DW_TAG_structure_type)
    <2a3>   DW_AT_byte_size   : 48
    <2a4>   DW_AT_decl_file   : 6
    <2a5>   DW_AT_decl_line   : 48
    <2a6>   DW_AT_decl_column : 9
    <2a7>   DW_AT_sibling     : <0x348>
 <2><2ab>: Abbrev Number: 14 (DW_TAG_member)
    <2ac>   DW_AT_name        : (indirect string, offset: 0x68b80): Channel
    <2b0>   DW_AT_decl_file   : 6
    <2b1>   DW_AT_decl_line   : 50
    <2b2>   DW_AT_decl_column : 12
    <2b3>   DW_AT_type        : <0x87>
    <2b7>   DW_AT_data_member_location: 0
 <2><2b8>: Abbrev Number: 14 (DW_TAG_member)
    <2b9>   DW_AT_name        : (indirect string, offset: 0x4ad19): Direction
    <2bd>   DW_AT_decl_file   : 6
    <2be>   DW_AT_decl_line   : 53
    <2bf>   DW_AT_decl_column : 12
    <2c0>   DW_AT_type        : <0x87>
    <2c4>   DW_AT_data_member_location: 4
 <2><2c5>: Abbrev Number: 14 (DW_TAG_member)
    <2c6>   DW_AT_name        : (indirect string, offset: 0xd081): PeriphInc
    <2ca>   DW_AT_decl_file   : 6
    <2cb>   DW_AT_decl_line   : 57
    <2cc>   DW_AT_decl_column : 12
    <2cd>   DW_AT_type        : <0x87>
    <2d1>   DW_AT_data_member_location: 8
 <2><2d2>: Abbrev Number: 14 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0x1f6df): MemInc
    <2d7>   DW_AT_decl_file   : 6
    <2d8>   DW_AT_decl_line   : 60
    <2d9>   DW_AT_decl_column : 12
    <2da>   DW_AT_type        : <0x87>
    <2de>   DW_AT_data_member_location: 12
 <2><2df>: Abbrev Number: 14 (DW_TAG_member)
    <2e0>   DW_AT_name        : (indirect string, offset: 0x63ec2): PeriphDataAlignment
    <2e4>   DW_AT_decl_file   : 6
    <2e5>   DW_AT_decl_line   : 63
    <2e6>   DW_AT_decl_column : 12
    <2e7>   DW_AT_type        : <0x87>
    <2eb>   DW_AT_data_member_location: 16
 <2><2ec>: Abbrev Number: 14 (DW_TAG_member)
    <2ed>   DW_AT_name        : (indirect string, offset: 0xb5b70): MemDataAlignment
    <2f1>   DW_AT_decl_file   : 6
    <2f2>   DW_AT_decl_line   : 66
    <2f3>   DW_AT_decl_column : 12
    <2f4>   DW_AT_type        : <0x87>
    <2f8>   DW_AT_data_member_location: 20
 <2><2f9>: Abbrev Number: 14 (DW_TAG_member)
    <2fa>   DW_AT_name        : (indirect string, offset: 0xd592f): Mode
    <2fe>   DW_AT_decl_file   : 6
    <2ff>   DW_AT_decl_line   : 69
    <300>   DW_AT_decl_column : 12
    <301>   DW_AT_type        : <0x87>
    <305>   DW_AT_data_member_location: 24
 <2><306>: Abbrev Number: 14 (DW_TAG_member)
    <307>   DW_AT_name        : (indirect string, offset: 0xd3db2): Priority
    <30b>   DW_AT_decl_file   : 6
    <30c>   DW_AT_decl_line   : 74
    <30d>   DW_AT_decl_column : 12
    <30e>   DW_AT_type        : <0x87>
    <312>   DW_AT_data_member_location: 28
 <2><313>: Abbrev Number: 14 (DW_TAG_member)
    <314>   DW_AT_name        : (indirect string, offset: 0x56bab): FIFOMode
    <318>   DW_AT_decl_file   : 6
    <319>   DW_AT_decl_line   : 77
    <31a>   DW_AT_decl_column : 12
    <31b>   DW_AT_type        : <0x87>
    <31f>   DW_AT_data_member_location: 32
 <2><320>: Abbrev Number: 14 (DW_TAG_member)
    <321>   DW_AT_name        : (indirect string, offset: 0x98c3d): FIFOThreshold
    <325>   DW_AT_decl_file   : 6
    <326>   DW_AT_decl_line   : 82
    <327>   DW_AT_decl_column : 12
    <328>   DW_AT_type        : <0x87>
    <32c>   DW_AT_data_member_location: 36
 <2><32d>: Abbrev Number: 14 (DW_TAG_member)
    <32e>   DW_AT_name        : (indirect string, offset: 0x96eef): MemBurst
    <332>   DW_AT_decl_file   : 6
    <333>   DW_AT_decl_line   : 85
    <334>   DW_AT_decl_column : 12
    <335>   DW_AT_type        : <0x87>
    <339>   DW_AT_data_member_location: 40
 <2><33a>: Abbrev Number: 14 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x44fa8): PeriphBurst
    <33f>   DW_AT_decl_file   : 6
    <340>   DW_AT_decl_line   : 91
    <341>   DW_AT_decl_column : 12
    <342>   DW_AT_type        : <0x87>
    <346>   DW_AT_data_member_location: 44
 <2><347>: Abbrev Number: 0
 <1><348>: Abbrev Number: 4 (DW_TAG_typedef)
    <349>   DW_AT_name        : (indirect string, offset: 0x36353): DMA_InitTypeDef
    <34d>   DW_AT_decl_file   : 6
    <34e>   DW_AT_decl_line   : 96
    <34f>   DW_AT_decl_column : 2
    <350>   DW_AT_type        : <0x2a2>
 <1><354>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <355>   DW_AT_encoding    : 7	(unsigned)
    <356>   DW_AT_byte_size   : 1
    <357>   DW_AT_type        : <0x4c>
    <35b>   DW_AT_decl_file   : 6
    <35c>   DW_AT_decl_line   : 103
    <35d>   DW_AT_decl_column : 1
    <35e>   DW_AT_sibling     : <0x387>
 <2><362>: Abbrev Number: 12 (DW_TAG_enumerator)
    <363>   DW_AT_name        : (indirect string, offset: 0x95e20): HAL_DMA_STATE_RESET
    <367>   DW_AT_const_value : 0
 <2><368>: Abbrev Number: 12 (DW_TAG_enumerator)
    <369>   DW_AT_name        : (indirect string, offset: 0x377d4): HAL_DMA_STATE_READY
    <36d>   DW_AT_const_value : 1
 <2><36e>: Abbrev Number: 12 (DW_TAG_enumerator)
    <36f>   DW_AT_name        : (indirect string, offset: 0x8abf7): HAL_DMA_STATE_BUSY
    <373>   DW_AT_const_value : 2
 <2><374>: Abbrev Number: 12 (DW_TAG_enumerator)
    <375>   DW_AT_name        : (indirect string, offset: 0xc609d): HAL_DMA_STATE_TIMEOUT
    <379>   DW_AT_const_value : 3
 <2><37a>: Abbrev Number: 12 (DW_TAG_enumerator)
    <37b>   DW_AT_name        : (indirect string, offset: 0x986c5): HAL_DMA_STATE_ERROR
    <37f>   DW_AT_const_value : 4
 <2><380>: Abbrev Number: 12 (DW_TAG_enumerator)
    <381>   DW_AT_name        : (indirect string, offset: 0x4ecaa): HAL_DMA_STATE_ABORT
    <385>   DW_AT_const_value : 5
 <2><386>: Abbrev Number: 0
 <1><387>: Abbrev Number: 4 (DW_TAG_typedef)
    <388>   DW_AT_name        : (indirect string, offset: 0xb4e65): HAL_DMA_StateTypeDef
    <38c>   DW_AT_decl_file   : 6
    <38d>   DW_AT_decl_line   : 110
    <38e>   DW_AT_decl_column : 2
    <38f>   DW_AT_type        : <0x354>
 <1><393>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <394>   DW_AT_type        : <0x387>
 <1><398>: Abbrev Number: 15 (DW_TAG_structure_type)
    <399>   DW_AT_name        : (indirect string, offset: 0xaad75): __DMA_HandleTypeDef
    <39d>   DW_AT_byte_size   : 96
    <39e>   DW_AT_decl_file   : 6
    <39f>   DW_AT_decl_line   : 138
    <3a0>   DW_AT_decl_column : 16
    <3a1>   DW_AT_sibling     : <0x45c>
 <2><3a5>: Abbrev Number: 14 (DW_TAG_member)
    <3a6>   DW_AT_name        : (indirect string, offset: 0xc250f): Instance
    <3aa>   DW_AT_decl_file   : 6
    <3ab>   DW_AT_decl_line   : 140
    <3ac>   DW_AT_decl_column : 31
    <3ad>   DW_AT_type        : <0x45c>
    <3b1>   DW_AT_data_member_location: 0
 <2><3b2>: Abbrev Number: 14 (DW_TAG_member)
    <3b3>   DW_AT_name        : (indirect string, offset: 0xcdf18): Init
    <3b7>   DW_AT_decl_file   : 6
    <3b8>   DW_AT_decl_line   : 142
    <3b9>   DW_AT_decl_column : 30
    <3ba>   DW_AT_type        : <0x348>
    <3be>   DW_AT_data_member_location: 4
 <2><3bf>: Abbrev Number: 14 (DW_TAG_member)
    <3c0>   DW_AT_name        : (indirect string, offset: 0x8f00f): Lock
    <3c4>   DW_AT_decl_file   : 6
    <3c5>   DW_AT_decl_line   : 144
    <3c6>   DW_AT_decl_column : 30
    <3c7>   DW_AT_type        : <0x296>
    <3cb>   DW_AT_data_member_location: 52
 <2><3cc>: Abbrev Number: 14 (DW_TAG_member)
    <3cd>   DW_AT_name        : (indirect string, offset: 0xcf468): State
    <3d1>   DW_AT_decl_file   : 6
    <3d2>   DW_AT_decl_line   : 146
    <3d3>   DW_AT_decl_column : 30
    <3d4>   DW_AT_type        : <0x393>
    <3d8>   DW_AT_data_member_location: 53
 <2><3d9>: Abbrev Number: 14 (DW_TAG_member)
    <3da>   DW_AT_name        : (indirect string, offset: 0xbf31a): Parent
    <3de>   DW_AT_decl_file   : 6
    <3df>   DW_AT_decl_line   : 148
    <3e0>   DW_AT_decl_column : 31
    <3e1>   DW_AT_type        : <0x98>
    <3e5>   DW_AT_data_member_location: 56
 <2><3e6>: Abbrev Number: 14 (DW_TAG_member)
    <3e7>   DW_AT_name        : (indirect string, offset: 0xc85d0): XferCpltCallback
    <3eb>   DW_AT_decl_file   : 6
    <3ec>   DW_AT_decl_line   : 150
    <3ed>   DW_AT_decl_column : 33
    <3ee>   DW_AT_type        : <0x473>
    <3f2>   DW_AT_data_member_location: 60
 <2><3f3>: Abbrev Number: 14 (DW_TAG_member)
    <3f4>   DW_AT_name        : (indirect string, offset: 0x9c25d): XferHalfCpltCallback
    <3f8>   DW_AT_decl_file   : 6
    <3f9>   DW_AT_decl_line   : 152
    <3fa>   DW_AT_decl_column : 33
    <3fb>   DW_AT_type        : <0x473>
    <3ff>   DW_AT_data_member_location: 64
 <2><400>: Abbrev Number: 14 (DW_TAG_member)
    <401>   DW_AT_name        : (indirect string, offset: 0x765d3): XferM1CpltCallback
    <405>   DW_AT_decl_file   : 6
    <406>   DW_AT_decl_line   : 154
    <407>   DW_AT_decl_column : 33
    <408>   DW_AT_type        : <0x473>
    <40c>   DW_AT_data_member_location: 68
 <2><40d>: Abbrev Number: 14 (DW_TAG_member)
    <40e>   DW_AT_name        : (indirect string, offset: 0x60b71): XferM1HalfCpltCallback
    <412>   DW_AT_decl_file   : 6
    <413>   DW_AT_decl_line   : 156
    <414>   DW_AT_decl_column : 33
    <415>   DW_AT_type        : <0x473>
    <419>   DW_AT_data_member_location: 72
 <2><41a>: Abbrev Number: 14 (DW_TAG_member)
    <41b>   DW_AT_name        : (indirect string, offset: 0x1ce70): XferErrorCallback
    <41f>   DW_AT_decl_file   : 6
    <420>   DW_AT_decl_line   : 158
    <421>   DW_AT_decl_column : 33
    <422>   DW_AT_type        : <0x473>
    <426>   DW_AT_data_member_location: 76
 <2><427>: Abbrev Number: 14 (DW_TAG_member)
    <428>   DW_AT_name        : (indirect string, offset: 0xbb981): XferAbortCallback
    <42c>   DW_AT_decl_file   : 6
    <42d>   DW_AT_decl_line   : 160
    <42e>   DW_AT_decl_column : 33
    <42f>   DW_AT_type        : <0x473>
    <433>   DW_AT_data_member_location: 80
 <2><434>: Abbrev Number: 14 (DW_TAG_member)
    <435>   DW_AT_name        : (indirect string, offset: 0xc4836): ErrorCode
    <439>   DW_AT_decl_file   : 6
    <43a>   DW_AT_decl_line   : 162
    <43b>   DW_AT_decl_column : 30
    <43c>   DW_AT_type        : <0x93>
    <440>   DW_AT_data_member_location: 84
 <2><441>: Abbrev Number: 14 (DW_TAG_member)
    <442>   DW_AT_name        : (indirect string, offset: 0x59ffe): StreamBaseAddress
    <446>   DW_AT_decl_file   : 6
    <447>   DW_AT_decl_line   : 164
    <448>   DW_AT_decl_column : 30
    <449>   DW_AT_type        : <0x87>
    <44d>   DW_AT_data_member_location: 88
 <2><44e>: Abbrev Number: 14 (DW_TAG_member)
    <44f>   DW_AT_name        : (indirect string, offset: 0xa8dbb): StreamIndex
    <453>   DW_AT_decl_file   : 6
    <454>   DW_AT_decl_line   : 166
    <455>   DW_AT_decl_column : 30
    <456>   DW_AT_type        : <0x87>
    <45a>   DW_AT_data_member_location: 92
 <2><45b>: Abbrev Number: 0
 <1><45c>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <45d>   DW_AT_byte_size   : 4
    <45e>   DW_AT_type        : <0xff>
 <1><462>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <463>   DW_AT_prototyped  : 1
    <463>   DW_AT_sibling     : <0x46d>
 <2><467>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <468>   DW_AT_type        : <0x46d>
 <2><46c>: Abbrev Number: 0
 <1><46d>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <46e>   DW_AT_byte_size   : 4
    <46f>   DW_AT_type        : <0x398>
 <1><473>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <474>   DW_AT_byte_size   : 4
    <475>   DW_AT_type        : <0x462>
 <1><479>: Abbrev Number: 4 (DW_TAG_typedef)
    <47a>   DW_AT_name        : (indirect string, offset: 0xaad77): DMA_HandleTypeDef
    <47e>   DW_AT_decl_file   : 6
    <47f>   DW_AT_decl_line   : 168
    <480>   DW_AT_decl_column : 2
    <481>   DW_AT_type        : <0x398>
 <1><485>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <486>   DW_AT_byte_size   : 4
    <487>   DW_AT_type        : <0x479>
 <1><48b>: Abbrev Number: 13 (DW_TAG_structure_type)
    <48c>   DW_AT_byte_size   : 24
    <48d>   DW_AT_decl_file   : 7
    <48e>   DW_AT_decl_line   : 46
    <48f>   DW_AT_decl_column : 9
    <490>   DW_AT_sibling     : <0x4e3>
 <2><494>: Abbrev Number: 14 (DW_TAG_member)
    <495>   DW_AT_name        : (indirect string, offset: 0xd1ac8): Prescaler
    <499>   DW_AT_decl_file   : 7
    <49a>   DW_AT_decl_line   : 48
    <49b>   DW_AT_decl_column : 12
    <49c>   DW_AT_type        : <0x87>
    <4a0>   DW_AT_data_member_location: 0
 <2><4a1>: Abbrev Number: 14 (DW_TAG_member)
    <4a2>   DW_AT_name        : (indirect string, offset: 0xb682d): CounterMode
    <4a6>   DW_AT_decl_file   : 7
    <4a7>   DW_AT_decl_line   : 51
    <4a8>   DW_AT_decl_column : 12
    <4a9>   DW_AT_type        : <0x87>
    <4ad>   DW_AT_data_member_location: 4
 <2><4ae>: Abbrev Number: 14 (DW_TAG_member)
    <4af>   DW_AT_name        : (indirect string, offset: 0xdc52a): Period
    <4b3>   DW_AT_decl_file   : 7
    <4b4>   DW_AT_decl_line   : 54
    <4b5>   DW_AT_decl_column : 12
    <4b6>   DW_AT_type        : <0x87>
    <4ba>   DW_AT_data_member_location: 8
 <2><4bb>: Abbrev Number: 14 (DW_TAG_member)
    <4bc>   DW_AT_name        : (indirect string, offset: 0x51ed9): ClockDivision
    <4c0>   DW_AT_decl_file   : 7
    <4c1>   DW_AT_decl_line   : 58
    <4c2>   DW_AT_decl_column : 12
    <4c3>   DW_AT_type        : <0x87>
    <4c7>   DW_AT_data_member_location: 12
 <2><4c8>: Abbrev Number: 14 (DW_TAG_member)
    <4c9>   DW_AT_name        : (indirect string, offset: 0x8c3e4): RepetitionCounter
    <4cd>   DW_AT_decl_file   : 7
    <4ce>   DW_AT_decl_line   : 61
    <4cf>   DW_AT_decl_column : 12
    <4d0>   DW_AT_type        : <0x87>
    <4d4>   DW_AT_data_member_location: 16
 <2><4d5>: Abbrev Number: 14 (DW_TAG_member)
    <4d6>   DW_AT_name        : (indirect string, offset: 0xb94b4): AutoReloadPreload
    <4da>   DW_AT_decl_file   : 7
    <4db>   DW_AT_decl_line   : 72
    <4dc>   DW_AT_decl_column : 12
    <4dd>   DW_AT_type        : <0x87>
    <4e1>   DW_AT_data_member_location: 20
 <2><4e2>: Abbrev Number: 0
 <1><4e3>: Abbrev Number: 4 (DW_TAG_typedef)
    <4e4>   DW_AT_name        : (indirect string, offset: 0x45903): TIM_Base_InitTypeDef
    <4e8>   DW_AT_decl_file   : 7
    <4e9>   DW_AT_decl_line   : 74
    <4ea>   DW_AT_decl_column : 3
    <4eb>   DW_AT_type        : <0x48b>
 <1><4ef>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <4f0>   DW_AT_encoding    : 7	(unsigned)
    <4f1>   DW_AT_byte_size   : 1
    <4f2>   DW_AT_type        : <0x4c>
    <4f6>   DW_AT_decl_file   : 7
    <4f7>   DW_AT_decl_line   : 291
    <4f9>   DW_AT_decl_column : 1
    <4fa>   DW_AT_sibling     : <0x51d>
 <2><4fe>: Abbrev Number: 12 (DW_TAG_enumerator)
    <4ff>   DW_AT_name        : (indirect string, offset: 0x7e4bc): HAL_TIM_STATE_RESET
    <503>   DW_AT_const_value : 0
 <2><504>: Abbrev Number: 12 (DW_TAG_enumerator)
    <505>   DW_AT_name        : (indirect string, offset: 0x6e2a): HAL_TIM_STATE_READY
    <509>   DW_AT_const_value : 1
 <2><50a>: Abbrev Number: 12 (DW_TAG_enumerator)
    <50b>   DW_AT_name        : (indirect string, offset: 0x32d1e): HAL_TIM_STATE_BUSY
    <50f>   DW_AT_const_value : 2
 <2><510>: Abbrev Number: 12 (DW_TAG_enumerator)
    <511>   DW_AT_name        : (indirect string, offset: 0xa7e88): HAL_TIM_STATE_TIMEOUT
    <515>   DW_AT_const_value : 3
 <2><516>: Abbrev Number: 12 (DW_TAG_enumerator)
    <517>   DW_AT_name        : (indirect string, offset: 0x7c5af): HAL_TIM_STATE_ERROR
    <51b>   DW_AT_const_value : 4
 <2><51c>: Abbrev Number: 0
 <1><51d>: Abbrev Number: 10 (DW_TAG_typedef)
    <51e>   DW_AT_name        : (indirect string, offset: 0x83f9c): HAL_TIM_StateTypeDef
    <522>   DW_AT_decl_file   : 7
    <523>   DW_AT_decl_line   : 297
    <525>   DW_AT_decl_column : 3
    <526>   DW_AT_type        : <0x4ef>
 <1><52a>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <52b>   DW_AT_type        : <0x51d>
 <1><52f>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <530>   DW_AT_encoding    : 7	(unsigned)
    <531>   DW_AT_byte_size   : 1
    <532>   DW_AT_type        : <0x4c>
    <536>   DW_AT_decl_file   : 7
    <537>   DW_AT_decl_line   : 303
    <539>   DW_AT_decl_column : 1
    <53a>   DW_AT_sibling     : <0x551>
 <2><53e>: Abbrev Number: 12 (DW_TAG_enumerator)
    <53f>   DW_AT_name        : (indirect string, offset: 0xaf12): HAL_TIM_CHANNEL_STATE_RESET
    <543>   DW_AT_const_value : 0
 <2><544>: Abbrev Number: 12 (DW_TAG_enumerator)
    <545>   DW_AT_name        : (indirect string, offset: 0x768c5): HAL_TIM_CHANNEL_STATE_READY
    <549>   DW_AT_const_value : 1
 <2><54a>: Abbrev Number: 12 (DW_TAG_enumerator)
    <54b>   DW_AT_name        : (indirect string, offset: 0x60d1e): HAL_TIM_CHANNEL_STATE_BUSY
    <54f>   DW_AT_const_value : 2
 <2><550>: Abbrev Number: 0
 <1><551>: Abbrev Number: 10 (DW_TAG_typedef)
    <552>   DW_AT_name        : (indirect string, offset: 0x2a7a1): HAL_TIM_ChannelStateTypeDef
    <556>   DW_AT_decl_file   : 7
    <557>   DW_AT_decl_line   : 307
    <559>   DW_AT_decl_column : 3
    <55a>   DW_AT_type        : <0x52f>
 <1><55e>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <55f>   DW_AT_type        : <0x551>
 <1><563>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <564>   DW_AT_encoding    : 7	(unsigned)
    <565>   DW_AT_byte_size   : 1
    <566>   DW_AT_type        : <0x4c>
    <56a>   DW_AT_decl_file   : 7
    <56b>   DW_AT_decl_line   : 313
    <56d>   DW_AT_decl_column : 1
    <56e>   DW_AT_sibling     : <0x585>
 <2><572>: Abbrev Number: 12 (DW_TAG_enumerator)
    <573>   DW_AT_name        : (indirect string, offset: 0x3ee7): HAL_DMA_BURST_STATE_RESET
    <577>   DW_AT_const_value : 0
 <2><578>: Abbrev Number: 12 (DW_TAG_enumerator)
    <579>   DW_AT_name        : (indirect string, offset: 0x6f298): HAL_DMA_BURST_STATE_READY
    <57d>   DW_AT_const_value : 1
 <2><57e>: Abbrev Number: 12 (DW_TAG_enumerator)
    <57f>   DW_AT_name        : (indirect string, offset: 0x440c0): HAL_DMA_BURST_STATE_BUSY
    <583>   DW_AT_const_value : 2
 <2><584>: Abbrev Number: 0
 <1><585>: Abbrev Number: 10 (DW_TAG_typedef)
    <586>   DW_AT_name        : (indirect string, offset: 0x1b4a6): HAL_TIM_DMABurstStateTypeDef
    <58a>   DW_AT_decl_file   : 7
    <58b>   DW_AT_decl_line   : 317
    <58d>   DW_AT_decl_column : 3
    <58e>   DW_AT_type        : <0x563>
 <1><592>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <593>   DW_AT_type        : <0x585>
 <1><597>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <598>   DW_AT_encoding    : 7	(unsigned)
    <599>   DW_AT_byte_size   : 1
    <59a>   DW_AT_type        : <0x4c>
    <59e>   DW_AT_decl_file   : 7
    <59f>   DW_AT_decl_line   : 323
    <5a1>   DW_AT_decl_column : 1
    <5a2>   DW_AT_sibling     : <0x5c5>
 <2><5a6>: Abbrev Number: 12 (DW_TAG_enumerator)
    <5a7>   DW_AT_name        : (indirect string, offset: 0x71364): HAL_TIM_ACTIVE_CHANNEL_1
    <5ab>   DW_AT_const_value : 1
 <2><5ac>: Abbrev Number: 12 (DW_TAG_enumerator)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x7137d): HAL_TIM_ACTIVE_CHANNEL_2
    <5b1>   DW_AT_const_value : 2
 <2><5b2>: Abbrev Number: 12 (DW_TAG_enumerator)
    <5b3>   DW_AT_name        : (indirect string, offset: 0x71396): HAL_TIM_ACTIVE_CHANNEL_3
    <5b7>   DW_AT_const_value : 4
 <2><5b8>: Abbrev Number: 12 (DW_TAG_enumerator)
    <5b9>   DW_AT_name        : (indirect string, offset: 0x713af): HAL_TIM_ACTIVE_CHANNEL_4
    <5bd>   DW_AT_const_value : 8
 <2><5be>: Abbrev Number: 12 (DW_TAG_enumerator)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x5315c): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <5c3>   DW_AT_const_value : 0
 <2><5c4>: Abbrev Number: 0
 <1><5c5>: Abbrev Number: 10 (DW_TAG_typedef)
    <5c6>   DW_AT_name        : (indirect string, offset: 0x68b72): HAL_TIM_ActiveChannel
    <5ca>   DW_AT_decl_file   : 7
    <5cb>   DW_AT_decl_line   : 329
    <5cd>   DW_AT_decl_column : 3
    <5ce>   DW_AT_type        : <0x597>
 <1><5d2>: Abbrev Number: 7 (DW_TAG_structure_type)
    <5d3>   DW_AT_byte_size   : 72
    <5d4>   DW_AT_decl_file   : 7
    <5d5>   DW_AT_decl_line   : 337
    <5d7>   DW_AT_decl_column : 9
    <5d8>   DW_AT_sibling     : <0x65b>
 <2><5dc>: Abbrev Number: 9 (DW_TAG_member)
    <5dd>   DW_AT_name        : (indirect string, offset: 0xc250f): Instance
    <5e1>   DW_AT_decl_file   : 7
    <5e2>   DW_AT_decl_line   : 340
    <5e4>   DW_AT_decl_column : 39
    <5e5>   DW_AT_type        : <0x65b>
    <5e9>   DW_AT_data_member_location: 0
 <2><5ea>: Abbrev Number: 9 (DW_TAG_member)
    <5eb>   DW_AT_name        : (indirect string, offset: 0xcdf18): Init
    <5ef>   DW_AT_decl_file   : 7
    <5f0>   DW_AT_decl_line   : 341
    <5f2>   DW_AT_decl_column : 38
    <5f3>   DW_AT_type        : <0x4e3>
    <5f7>   DW_AT_data_member_location: 4
 <2><5f8>: Abbrev Number: 9 (DW_TAG_member)
    <5f9>   DW_AT_name        : (indirect string, offset: 0x68b80): Channel
    <5fd>   DW_AT_decl_file   : 7
    <5fe>   DW_AT_decl_line   : 342
    <600>   DW_AT_decl_column : 38
    <601>   DW_AT_type        : <0x5c5>
    <605>   DW_AT_data_member_location: 28
 <2><606>: Abbrev Number: 9 (DW_TAG_member)
    <607>   DW_AT_name        : (indirect string, offset: 0x78df2): hdma
    <60b>   DW_AT_decl_file   : 7
    <60c>   DW_AT_decl_line   : 343
    <60e>   DW_AT_decl_column : 39
    <60f>   DW_AT_type        : <0x661>
    <613>   DW_AT_data_member_location: 32
 <2><614>: Abbrev Number: 9 (DW_TAG_member)
    <615>   DW_AT_name        : (indirect string, offset: 0x8f00f): Lock
    <619>   DW_AT_decl_file   : 7
    <61a>   DW_AT_decl_line   : 345
    <61c>   DW_AT_decl_column : 38
    <61d>   DW_AT_type        : <0x296>
    <621>   DW_AT_data_member_location: 60
 <2><622>: Abbrev Number: 9 (DW_TAG_member)
    <623>   DW_AT_name        : (indirect string, offset: 0xcf468): State
    <627>   DW_AT_decl_file   : 7
    <628>   DW_AT_decl_line   : 346
    <62a>   DW_AT_decl_column : 38
    <62b>   DW_AT_type        : <0x52a>
    <62f>   DW_AT_data_member_location: 61
 <2><630>: Abbrev Number: 9 (DW_TAG_member)
    <631>   DW_AT_name        : (indirect string, offset: 0xd5ffa): ChannelState
    <635>   DW_AT_decl_file   : 7
    <636>   DW_AT_decl_line   : 347
    <638>   DW_AT_decl_column : 38
    <639>   DW_AT_type        : <0x681>
    <63d>   DW_AT_data_member_location: 62
 <2><63e>: Abbrev Number: 9 (DW_TAG_member)
    <63f>   DW_AT_name        : (indirect string, offset: 0xd65b3): ChannelNState
    <643>   DW_AT_decl_file   : 7
    <644>   DW_AT_decl_line   : 348
    <646>   DW_AT_decl_column : 38
    <647>   DW_AT_type        : <0x681>
    <64b>   DW_AT_data_member_location: 66
 <2><64c>: Abbrev Number: 9 (DW_TAG_member)
    <64d>   DW_AT_name        : (indirect string, offset: 0xd5b9c): DMABurstState
    <651>   DW_AT_decl_file   : 7
    <652>   DW_AT_decl_line   : 349
    <654>   DW_AT_decl_column : 38
    <655>   DW_AT_type        : <0x592>
    <659>   DW_AT_data_member_location: 70
 <2><65a>: Abbrev Number: 0
 <1><65b>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <65c>   DW_AT_byte_size   : 4
    <65d>   DW_AT_type        : <0x23b>
 <1><661>: Abbrev Number: 20 (DW_TAG_array_type)
    <662>   DW_AT_type        : <0x485>
    <666>   DW_AT_sibling     : <0x671>
 <2><66a>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <66b>   DW_AT_type        : <0x30>
    <66f>   DW_AT_upper_bound : 6
 <2><670>: Abbrev Number: 0
 <1><671>: Abbrev Number: 20 (DW_TAG_array_type)
    <672>   DW_AT_type        : <0x55e>
    <676>   DW_AT_sibling     : <0x681>
 <2><67a>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <67b>   DW_AT_type        : <0x30>
    <67f>   DW_AT_upper_bound : 3
 <2><680>: Abbrev Number: 0
 <1><681>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <682>   DW_AT_type        : <0x671>
 <1><686>: Abbrev Number: 10 (DW_TAG_typedef)
    <687>   DW_AT_name        : (indirect string, offset: 0x45351): TIM_HandleTypeDef
    <68b>   DW_AT_decl_file   : 7
    <68c>   DW_AT_decl_line   : 380
    <68e>   DW_AT_decl_column : 3
    <68f>   DW_AT_type        : <0x5d2>
 <1><693>: Abbrev Number: 22 (DW_TAG_variable)
    <694>   DW_AT_name        : (indirect string, offset: 0x9cc94): ulStatsTimerTicks
    <698>   DW_AT_decl_file   : 1
    <699>   DW_AT_decl_line   : 47
    <69a>   DW_AT_decl_column : 24
    <69b>   DW_AT_type        : <0x7b>
    <69f>   DW_AT_external    : 1
    <69f>   DW_AT_location    : 5 byte block: 3 f4 2 0 20 	(DW_OP_addr: 200002f4)
 <1><6a5>: Abbrev Number: 23 (DW_TAG_variable)
    <6a6>   DW_AT_name        : (indirect string, offset: 0x7ac49): htim7
    <6aa>   DW_AT_decl_file   : 1
    <6ab>   DW_AT_decl_line   : 48
    <6ac>   DW_AT_decl_column : 26
    <6ad>   DW_AT_type        : <0x686>
    <6b1>   DW_AT_external    : 1
    <6b1>   DW_AT_declaration : 1
 <1><6b1>: Abbrev Number: 24 (DW_TAG_subprogram)
    <6b2>   DW_AT_external    : 1
    <6b2>   DW_AT_name        : (indirect string, offset: 0x5560e): HAL_TIM_Base_Start_IT
    <6b6>   DW_AT_decl_file   : 7
    <6b7>   DW_AT_decl_line   : 1896
    <6b9>   DW_AT_decl_column : 19
    <6ba>   DW_AT_prototyped  : 1
    <6ba>   DW_AT_type        : <0x26f>
    <6be>   DW_AT_declaration : 1
    <6be>   DW_AT_sibling     : <0x6c8>
 <2><6c2>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <6c3>   DW_AT_type        : <0x6c8>
 <2><6c7>: Abbrev Number: 0
 <1><6c8>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <6c9>   DW_AT_byte_size   : 4
    <6ca>   DW_AT_type        : <0x686>
 <1><6ce>: Abbrev Number: 25 (DW_TAG_subprogram)
    <6cf>   DW_AT_external    : 1
    <6cf>   DW_AT_name        : (indirect string, offset: 0x5b923): getRunTimeCounterValue
    <6d3>   DW_AT_decl_file   : 1
    <6d4>   DW_AT_decl_line   : 68
    <6d5>   DW_AT_decl_column : 22
    <6d6>   DW_AT_prototyped  : 1
    <6d6>   DW_AT_type        : <0x74>
    <6da>   DW_AT_low_pc      : 0x8000ec8
    <6de>   DW_AT_high_pc     : 0x18
    <6e2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6e4>   DW_AT_GNU_all_call_sites: 1
 <1><6e4>: Abbrev Number: 26 (DW_TAG_subprogram)
    <6e5>   DW_AT_external    : 1
    <6e5>   DW_AT_name        : (indirect string, offset: 0x2a69e): configureTimerForRunTimeStats
    <6e9>   DW_AT_decl_file   : 1
    <6ea>   DW_AT_decl_line   : 62
    <6eb>   DW_AT_decl_column : 13
    <6ec>   DW_AT_prototyped  : 1
    <6ec>   DW_AT_low_pc      : 0x8000eac
    <6f0>   DW_AT_high_pc     : 0x1c
    <6f4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6f6>   DW_AT_GNU_all_tail_call_sites: 1
 <1><6f6>: Abbrev Number: 0
  Compilation Unit @ offset 0x6f7:
   Length:        0x27f1 (32-bit)
   Version:       4
   Abbrev Offset: 0x188
   Pointer Size:  4
 <0><702>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <703>   DW_AT_producer    : (indirect string, offset: 0xc332d): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <707>   DW_AT_language    : 12	(ANSI C99)
    <708>   DW_AT_name        : (indirect string, offset: 0xd0bb0): ../Core/Src/main.c
    <70c>   DW_AT_comp_dir    : (indirect string, offset: 0xb5667): C:/Users/crazy/STM32CubeIDE/workspace_1.10.0/LIS3DSH_USB_HID/Debug
    <710>   DW_AT_ranges      : 0x18
    <714>   DW_AT_low_pc      : 0x0
    <718>   DW_AT_stmt_list   : 0x82d
    <71c>   DW_AT_GNU_macros  : 0x1fcc5
 <1><720>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <721>   DW_AT_encoding    : 5	(signed)
    <722>   DW_AT_byte_size   : 1
    <723>   DW_AT_type        : <0x945>
    <727>   DW_AT_decl_file   : 3
    <728>   DW_AT_decl_line   : 66
    <729>   DW_AT_decl_column : 1
    <72a>   DW_AT_sibling     : <0x945>
 <2><72e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <72f>   DW_AT_name        : (indirect string, offset: 0xcb188): NonMaskableInt_IRQn
    <733>   DW_AT_const_value : -14
 <2><734>: Abbrev Number: 3 (DW_TAG_enumerator)
    <735>   DW_AT_name        : (indirect string, offset: 0xcdbef): MemoryManagement_IRQn
    <739>   DW_AT_const_value : -12
 <2><73a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <73b>   DW_AT_name        : (indirect string, offset: 0xcfe5f): BusFault_IRQn
    <73f>   DW_AT_const_value : -11
 <2><740>: Abbrev Number: 3 (DW_TAG_enumerator)
    <741>   DW_AT_name        : (indirect string, offset: 0xcf167): UsageFault_IRQn
    <745>   DW_AT_const_value : -10
 <2><746>: Abbrev Number: 3 (DW_TAG_enumerator)
    <747>   DW_AT_name        : (indirect string, offset: 0xca11b): SVCall_IRQn
    <74b>   DW_AT_const_value : -5
 <2><74c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <74d>   DW_AT_name        : (indirect string, offset: 0xcdc05): DebugMonitor_IRQn
    <751>   DW_AT_const_value : -4
 <2><752>: Abbrev Number: 3 (DW_TAG_enumerator)
    <753>   DW_AT_name        : (indirect string, offset: 0xce100): PendSV_IRQn
    <757>   DW_AT_const_value : -2
 <2><758>: Abbrev Number: 3 (DW_TAG_enumerator)
    <759>   DW_AT_name        : (indirect string, offset: 0xd0112): SysTick_IRQn
    <75d>   DW_AT_const_value : -1
 <2><75e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <75f>   DW_AT_name        : (indirect string, offset: 0xcf47e): WWDG_IRQn
    <763>   DW_AT_const_value : 0
 <2><764>: Abbrev Number: 4 (DW_TAG_enumerator)
    <765>   DW_AT_name        : (indirect string, offset: 0xcb11f): PVD_IRQn
    <769>   DW_AT_const_value : 1
 <2><76a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <76b>   DW_AT_name        : (indirect string, offset: 0xd1610): TAMP_STAMP_IRQn
    <76f>   DW_AT_const_value : 2
 <2><770>: Abbrev Number: 4 (DW_TAG_enumerator)
    <771>   DW_AT_name        : (indirect string, offset: 0xce7ef): RTC_WKUP_IRQn
    <775>   DW_AT_const_value : 3
 <2><776>: Abbrev Number: 4 (DW_TAG_enumerator)
    <777>   DW_AT_name        : (indirect string, offset: 0xcbbba): FLASH_IRQn
    <77b>   DW_AT_const_value : 4
 <2><77c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <77d>   DW_AT_name        : (indirect string, offset: 0xcfe31): RCC_IRQn
    <781>   DW_AT_const_value : 5
 <2><782>: Abbrev Number: 4 (DW_TAG_enumerator)
    <783>   DW_AT_name        : (indirect string, offset: 0x9afbb): EXTI0_IRQn
    <787>   DW_AT_const_value : 6
 <2><788>: Abbrev Number: 4 (DW_TAG_enumerator)
    <789>   DW_AT_name        : (indirect string, offset: 0xd14ad): EXTI1_IRQn
    <78d>   DW_AT_const_value : 7
 <2><78e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <78f>   DW_AT_name        : (indirect string, offset: 0xcd28a): EXTI2_IRQn
    <793>   DW_AT_const_value : 8
 <2><794>: Abbrev Number: 4 (DW_TAG_enumerator)
    <795>   DW_AT_name        : (indirect string, offset: 0xd01d2): EXTI3_IRQn
    <799>   DW_AT_const_value : 9
 <2><79a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <79b>   DW_AT_name        : (indirect string, offset: 0xcaeca): EXTI4_IRQn
    <79f>   DW_AT_const_value : 10
 <2><7a0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7a1>   DW_AT_name        : (indirect string, offset: 0xcae06): DMA1_Stream0_IRQn
    <7a5>   DW_AT_const_value : 11
 <2><7a6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7a7>   DW_AT_name        : (indirect string, offset: 0xcd67b): DMA1_Stream1_IRQn
    <7ab>   DW_AT_const_value : 12
 <2><7ac>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7ad>   DW_AT_name        : (indirect string, offset: 0xcd4bf): DMA1_Stream2_IRQn
    <7b1>   DW_AT_const_value : 13
 <2><7b2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7b3>   DW_AT_name        : (indirect string, offset: 0xd0a94): DMA1_Stream3_IRQn
    <7b7>   DW_AT_const_value : 14
 <2><7b8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7b9>   DW_AT_name        : (indirect string, offset: 0xcc5d9): DMA1_Stream4_IRQn
    <7bd>   DW_AT_const_value : 15
 <2><7be>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7bf>   DW_AT_name        : (indirect string, offset: 0xcfb0f): DMA1_Stream5_IRQn
    <7c3>   DW_AT_const_value : 16
 <2><7c4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7c5>   DW_AT_name        : (indirect string, offset: 0xcba0b): DMA1_Stream6_IRQn
    <7c9>   DW_AT_const_value : 17
 <2><7ca>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7cb>   DW_AT_name        : (indirect string, offset: 0xcdcd6): ADC_IRQn
    <7cf>   DW_AT_const_value : 18
 <2><7d0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7d1>   DW_AT_name        : (indirect string, offset: 0xd0d25): CAN1_TX_IRQn
    <7d5>   DW_AT_const_value : 19
 <2><7d6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7d7>   DW_AT_name        : (indirect string, offset: 0xcbb27): CAN1_RX0_IRQn
    <7db>   DW_AT_const_value : 20
 <2><7dc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7dd>   DW_AT_name        : (indirect string, offset: 0xcf1dd): CAN1_RX1_IRQn
    <7e1>   DW_AT_const_value : 21
 <2><7e2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7e3>   DW_AT_name        : (indirect string, offset: 0xcf198): CAN1_SCE_IRQn
    <7e7>   DW_AT_const_value : 22
 <2><7e8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7e9>   DW_AT_name        : (indirect string, offset: 0xcfabe): EXTI9_5_IRQn
    <7ed>   DW_AT_const_value : 23
 <2><7ee>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7ef>   DW_AT_name        : (indirect string, offset: 0xcd2fe): TIM1_BRK_TIM9_IRQn
    <7f3>   DW_AT_const_value : 24
 <2><7f4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7f5>   DW_AT_name        : (indirect string, offset: 0xce4a2): TIM1_UP_TIM10_IRQn
    <7f9>   DW_AT_const_value : 25
 <2><7fa>: Abbrev Number: 4 (DW_TAG_enumerator)
    <7fb>   DW_AT_name        : (indirect string, offset: 0xcd53e): TIM1_TRG_COM_TIM11_IRQn
    <7ff>   DW_AT_const_value : 26
 <2><800>: Abbrev Number: 4 (DW_TAG_enumerator)
    <801>   DW_AT_name        : (indirect string, offset: 0xcd86c): TIM1_CC_IRQn
    <805>   DW_AT_const_value : 27
 <2><806>: Abbrev Number: 4 (DW_TAG_enumerator)
    <807>   DW_AT_name        : (indirect string, offset: 0xcac74): TIM2_IRQn
    <80b>   DW_AT_const_value : 28
 <2><80c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <80d>   DW_AT_name        : (indirect string, offset: 0xce3f7): TIM3_IRQn
    <811>   DW_AT_const_value : 29
 <2><812>: Abbrev Number: 4 (DW_TAG_enumerator)
    <813>   DW_AT_name        : (indirect string, offset: 0xccc1a): TIM4_IRQn
    <817>   DW_AT_const_value : 30
 <2><818>: Abbrev Number: 4 (DW_TAG_enumerator)
    <819>   DW_AT_name        : (indirect string, offset: 0xccc8f): I2C1_EV_IRQn
    <81d>   DW_AT_const_value : 31
 <2><81e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <81f>   DW_AT_name        : (indirect string, offset: 0xcea22): I2C1_ER_IRQn
    <823>   DW_AT_const_value : 32
 <2><824>: Abbrev Number: 4 (DW_TAG_enumerator)
    <825>   DW_AT_name        : (indirect string, offset: 0xcac2e): I2C2_EV_IRQn
    <829>   DW_AT_const_value : 33
 <2><82a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <82b>   DW_AT_name        : (indirect string, offset: 0xcd1e1): I2C2_ER_IRQn
    <82f>   DW_AT_const_value : 34
 <2><830>: Abbrev Number: 4 (DW_TAG_enumerator)
    <831>   DW_AT_name        : (indirect string, offset: 0xcac3b): SPI1_IRQn
    <835>   DW_AT_const_value : 35
 <2><836>: Abbrev Number: 4 (DW_TAG_enumerator)
    <837>   DW_AT_name        : (indirect string, offset: 0xce3ed): SPI2_IRQn
    <83b>   DW_AT_const_value : 36
 <2><83c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <83d>   DW_AT_name        : (indirect string, offset: 0xcff8d): USART1_IRQn
    <841>   DW_AT_const_value : 37
 <2><842>: Abbrev Number: 4 (DW_TAG_enumerator)
    <843>   DW_AT_name        : (indirect string, offset: 0xcbe7f): USART2_IRQn
    <847>   DW_AT_const_value : 38
 <2><848>: Abbrev Number: 4 (DW_TAG_enumerator)
    <849>   DW_AT_name        : (indirect string, offset: 0xcf517): USART3_IRQn
    <84d>   DW_AT_const_value : 39
 <2><84e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <84f>   DW_AT_name        : (indirect string, offset: 0xd04f0): EXTI15_10_IRQn
    <853>   DW_AT_const_value : 40
 <2><854>: Abbrev Number: 4 (DW_TAG_enumerator)
    <855>   DW_AT_name        : (indirect string, offset: 0xd05a2): RTC_Alarm_IRQn
    <859>   DW_AT_const_value : 41
 <2><85a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <85b>   DW_AT_name        : (indirect string, offset: 0xcbba9): OTG_FS_WKUP_IRQn
    <85f>   DW_AT_const_value : 42
 <2><860>: Abbrev Number: 4 (DW_TAG_enumerator)
    <861>   DW_AT_name        : (indirect string, offset: 0xd00ec): TIM8_BRK_TIM12_IRQn
    <865>   DW_AT_const_value : 43
 <2><866>: Abbrev Number: 4 (DW_TAG_enumerator)
    <867>   DW_AT_name        : (indirect string, offset: 0xcf7e0): TIM8_UP_TIM13_IRQn
    <86b>   DW_AT_const_value : 44
 <2><86c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <86d>   DW_AT_name        : (indirect string, offset: 0xcf40d): TIM8_TRG_COM_TIM14_IRQn
    <871>   DW_AT_const_value : 45
 <2><872>: Abbrev Number: 4 (DW_TAG_enumerator)
    <873>   DW_AT_name        : (indirect string, offset: 0xcfb84): TIM8_CC_IRQn
    <877>   DW_AT_const_value : 46
 <2><878>: Abbrev Number: 4 (DW_TAG_enumerator)
    <879>   DW_AT_name        : (indirect string, offset: 0xce901): DMA1_Stream7_IRQn
    <87d>   DW_AT_const_value : 47
 <2><87e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <87f>   DW_AT_name        : (indirect string, offset: 0x1ddea): FSMC_IRQn
    <883>   DW_AT_const_value : 48
 <2><884>: Abbrev Number: 4 (DW_TAG_enumerator)
    <885>   DW_AT_name        : (indirect string, offset: 0x44a82): SDIO_IRQn
    <889>   DW_AT_const_value : 49
 <2><88a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <88b>   DW_AT_name        : (indirect string, offset: 0xcd4e3): TIM5_IRQn
    <88f>   DW_AT_const_value : 50
 <2><890>: Abbrev Number: 4 (DW_TAG_enumerator)
    <891>   DW_AT_name        : (indirect string, offset: 0xd1703): SPI3_IRQn
    <895>   DW_AT_const_value : 51
 <2><896>: Abbrev Number: 4 (DW_TAG_enumerator)
    <897>   DW_AT_name        : (indirect string, offset: 0xcf50c): UART4_IRQn
    <89b>   DW_AT_const_value : 52
 <2><89c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <89d>   DW_AT_name        : (indirect string, offset: 0xcaa59): UART5_IRQn
    <8a1>   DW_AT_const_value : 53
 <2><8a2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8a3>   DW_AT_name        : (indirect string, offset: 0xd18eb): TIM6_DAC_IRQn
    <8a7>   DW_AT_const_value : 54
 <2><8a8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8a9>   DW_AT_name        : (indirect string, offset: 0xcdd16): TIM7_IRQn
    <8ad>   DW_AT_const_value : 55
 <2><8ae>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8af>   DW_AT_name        : (indirect string, offset: 0xcf2e1): DMA2_Stream0_IRQn
    <8b3>   DW_AT_const_value : 56
 <2><8b4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8b5>   DW_AT_name        : (indirect string, offset: 0xcadbe): DMA2_Stream1_IRQn
    <8b9>   DW_AT_const_value : 57
 <2><8ba>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8bb>   DW_AT_name        : (indirect string, offset: 0xcdf76): DMA2_Stream2_IRQn
    <8bf>   DW_AT_const_value : 58
 <2><8c0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8c1>   DW_AT_name        : (indirect string, offset: 0xd090d): DMA2_Stream3_IRQn
    <8c5>   DW_AT_const_value : 59
 <2><8c6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8c7>   DW_AT_name        : (indirect string, offset: 0xcc5f5): DMA2_Stream4_IRQn
    <8cb>   DW_AT_const_value : 60
 <2><8cc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8cd>   DW_AT_name        : (indirect string, offset: 0xcc920): ETH_IRQn
    <8d1>   DW_AT_const_value : 61
 <2><8d2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8d3>   DW_AT_name        : (indirect string, offset: 0xcce09): ETH_WKUP_IRQn
    <8d7>   DW_AT_const_value : 62
 <2><8d8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8d9>   DW_AT_name        : (indirect string, offset: 0xcdcf8): CAN2_TX_IRQn
    <8dd>   DW_AT_const_value : 63
 <2><8de>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8df>   DW_AT_name        : (indirect string, offset: 0xcb792): CAN2_RX0_IRQn
    <8e3>   DW_AT_const_value : 64
 <2><8e4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8e5>   DW_AT_name        : (indirect string, offset: 0xced0f): CAN2_RX1_IRQn
    <8e9>   DW_AT_const_value : 65
 <2><8ea>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8eb>   DW_AT_name        : (indirect string, offset: 0xd13aa): CAN2_SCE_IRQn
    <8ef>   DW_AT_const_value : 66
 <2><8f0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8f1>   DW_AT_name        : (indirect string, offset: 0xce401): OTG_FS_IRQn
    <8f5>   DW_AT_const_value : 67
 <2><8f6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8f7>   DW_AT_name        : (indirect string, offset: 0xceaa2): DMA2_Stream5_IRQn
    <8fb>   DW_AT_const_value : 68
 <2><8fc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8fd>   DW_AT_name        : (indirect string, offset: 0xcc782): DMA2_Stream6_IRQn
    <901>   DW_AT_const_value : 69
 <2><902>: Abbrev Number: 4 (DW_TAG_enumerator)
    <903>   DW_AT_name        : (indirect string, offset: 0xcfbd5): DMA2_Stream7_IRQn
    <907>   DW_AT_const_value : 70
 <2><908>: Abbrev Number: 4 (DW_TAG_enumerator)
    <909>   DW_AT_name        : (indirect string, offset: 0xd013a): USART6_IRQn
    <90d>   DW_AT_const_value : 71
 <2><90e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <90f>   DW_AT_name        : (indirect string, offset: 0xd0bc3): I2C3_EV_IRQn
    <913>   DW_AT_const_value : 72
 <2><914>: Abbrev Number: 4 (DW_TAG_enumerator)
    <915>   DW_AT_name        : (indirect string, offset: 0xcb4b9): I2C3_ER_IRQn
    <919>   DW_AT_const_value : 73
 <2><91a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <91b>   DW_AT_name        : (indirect string, offset: 0xccc2f): OTG_HS_EP1_OUT_IRQn
    <91f>   DW_AT_const_value : 74
 <2><920>: Abbrev Number: 4 (DW_TAG_enumerator)
    <921>   DW_AT_name        : (indirect string, offset: 0xcf7b5): OTG_HS_EP1_IN_IRQn
    <925>   DW_AT_const_value : 75
 <2><926>: Abbrev Number: 4 (DW_TAG_enumerator)
    <927>   DW_AT_name        : (indirect string, offset: 0xce3b3): OTG_HS_WKUP_IRQn
    <92b>   DW_AT_const_value : 76
 <2><92c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <92d>   DW_AT_name        : (indirect string, offset: 0xcd318): OTG_HS_IRQn
    <931>   DW_AT_const_value : 77
 <2><932>: Abbrev Number: 4 (DW_TAG_enumerator)
    <933>   DW_AT_name        : (indirect string, offset: 0xd12ba): DCMI_IRQn
    <937>   DW_AT_const_value : 78
 <2><938>: Abbrev Number: 4 (DW_TAG_enumerator)
    <939>   DW_AT_name        : (indirect string, offset: 0xb515d): RNG_IRQn
    <93d>   DW_AT_const_value : 80
 <2><93e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <93f>   DW_AT_name        : (indirect string, offset: 0xccb31): FPU_IRQn
    <943>   DW_AT_const_value : 81
 <2><944>: Abbrev Number: 0
 <1><945>: Abbrev Number: 5 (DW_TAG_base_type)
    <946>   DW_AT_byte_size   : 1
    <947>   DW_AT_encoding    : 6	(signed char)
    <948>   DW_AT_name        : (indirect string, offset: 0x64ba0): signed char
 <1><94c>: Abbrev Number: 6 (DW_TAG_typedef)
    <94d>   DW_AT_name        : (indirect string, offset: 0xd0957): IRQn_Type
    <951>   DW_AT_decl_file   : 3
    <952>   DW_AT_decl_line   : 158
    <953>   DW_AT_decl_column : 3
    <954>   DW_AT_type        : <0x720>
 <1><958>: Abbrev Number: 6 (DW_TAG_typedef)
    <959>   DW_AT_name        : (indirect string, offset: 0xca565): __int8_t
    <95d>   DW_AT_decl_file   : 4
    <95e>   DW_AT_decl_line   : 41
    <95f>   DW_AT_decl_column : 23
    <960>   DW_AT_type        : <0x945>
 <1><964>: Abbrev Number: 6 (DW_TAG_typedef)
    <965>   DW_AT_name        : (indirect string, offset: 0xcc5eb): __uint8_t
    <969>   DW_AT_decl_file   : 4
    <96a>   DW_AT_decl_line   : 43
    <96b>   DW_AT_decl_column : 24
    <96c>   DW_AT_type        : <0x970>
 <1><970>: Abbrev Number: 5 (DW_TAG_base_type)
    <971>   DW_AT_byte_size   : 1
    <972>   DW_AT_encoding    : 8	(unsigned char)
    <973>   DW_AT_name        : (indirect string, offset: 0xc20c4): unsigned char
 <1><977>: Abbrev Number: 6 (DW_TAG_typedef)
    <978>   DW_AT_name        : (indirect string, offset: 0xd00d9): __int16_t
    <97c>   DW_AT_decl_file   : 4
    <97d>   DW_AT_decl_line   : 55
    <97e>   DW_AT_decl_column : 24
    <97f>   DW_AT_type        : <0x983>
 <1><983>: Abbrev Number: 5 (DW_TAG_base_type)
    <984>   DW_AT_byte_size   : 2
    <985>   DW_AT_encoding    : 5	(signed)
    <986>   DW_AT_name        : (indirect string, offset: 0x95afb): short int
 <1><98a>: Abbrev Number: 6 (DW_TAG_typedef)
    <98b>   DW_AT_name        : (indirect string, offset: 0xd0269): __uint16_t
    <98f>   DW_AT_decl_file   : 4
    <990>   DW_AT_decl_line   : 57
    <991>   DW_AT_decl_column : 25
    <992>   DW_AT_type        : <0x996>
 <1><996>: Abbrev Number: 5 (DW_TAG_base_type)
    <997>   DW_AT_byte_size   : 2
    <998>   DW_AT_encoding    : 7	(unsigned)
    <999>   DW_AT_name        : (indirect string, offset: 0xc0818): short unsigned int
 <1><99d>: Abbrev Number: 5 (DW_TAG_base_type)
    <99e>   DW_AT_byte_size   : 4
    <99f>   DW_AT_encoding    : 5	(signed)
    <9a0>   DW_AT_name        : (indirect string, offset: 0x10b39): long int
 <1><9a4>: Abbrev Number: 6 (DW_TAG_typedef)
    <9a5>   DW_AT_name        : (indirect string, offset: 0x802a5): __uint32_t
    <9a9>   DW_AT_decl_file   : 4
    <9aa>   DW_AT_decl_line   : 79
    <9ab>   DW_AT_decl_column : 25
    <9ac>   DW_AT_type        : <0x9b0>
 <1><9b0>: Abbrev Number: 5 (DW_TAG_base_type)
    <9b1>   DW_AT_byte_size   : 4
    <9b2>   DW_AT_encoding    : 7	(unsigned)
    <9b3>   DW_AT_name        : (indirect string, offset: 0x4d081): long unsigned int
 <1><9b7>: Abbrev Number: 5 (DW_TAG_base_type)
    <9b8>   DW_AT_byte_size   : 8
    <9b9>   DW_AT_encoding    : 5	(signed)
    <9ba>   DW_AT_name        : (indirect string, offset: 0x5be37): long long int
 <1><9be>: Abbrev Number: 5 (DW_TAG_base_type)
    <9bf>   DW_AT_byte_size   : 8
    <9c0>   DW_AT_encoding    : 7	(unsigned)
    <9c1>   DW_AT_name        : (indirect string, offset: 0x2a1f1): long long unsigned int
 <1><9c5>: Abbrev Number: 7 (DW_TAG_base_type)
    <9c6>   DW_AT_byte_size   : 4
    <9c7>   DW_AT_encoding    : 5	(signed)
    <9c8>   DW_AT_name        : int
 <1><9cc>: Abbrev Number: 5 (DW_TAG_base_type)
    <9cd>   DW_AT_byte_size   : 4
    <9ce>   DW_AT_encoding    : 7	(unsigned)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x101ec): unsigned int
 <1><9d3>: Abbrev Number: 6 (DW_TAG_typedef)
    <9d4>   DW_AT_name        : (indirect string, offset: 0xca567): int8_t
    <9d8>   DW_AT_decl_file   : 5
    <9d9>   DW_AT_decl_line   : 20
    <9da>   DW_AT_decl_column : 18
    <9db>   DW_AT_type        : <0x958>
 <1><9df>: Abbrev Number: 6 (DW_TAG_typedef)
    <9e0>   DW_AT_name        : (indirect string, offset: 0xcc5ed): uint8_t
    <9e4>   DW_AT_decl_file   : 5
    <9e5>   DW_AT_decl_line   : 24
    <9e6>   DW_AT_decl_column : 19
    <9e7>   DW_AT_type        : <0x964>
 <1><9eb>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <9ec>   DW_AT_type        : <0x9df>
 <1><9f0>: Abbrev Number: 9 (DW_TAG_const_type)
    <9f1>   DW_AT_type        : <0x9df>
 <1><9f5>: Abbrev Number: 6 (DW_TAG_typedef)
    <9f6>   DW_AT_name        : (indirect string, offset: 0xd00db): int16_t
    <9fa>   DW_AT_decl_file   : 5
    <9fb>   DW_AT_decl_line   : 32
    <9fc>   DW_AT_decl_column : 19
    <9fd>   DW_AT_type        : <0x977>
 <1><a01>: Abbrev Number: 6 (DW_TAG_typedef)
    <a02>   DW_AT_name        : (indirect string, offset: 0x92703): uint16_t
    <a06>   DW_AT_decl_file   : 5
    <a07>   DW_AT_decl_line   : 36
    <a08>   DW_AT_decl_column : 20
    <a09>   DW_AT_type        : <0x98a>
 <1><a0d>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <a0e>   DW_AT_type        : <0xa01>
 <1><a12>: Abbrev Number: 6 (DW_TAG_typedef)
    <a13>   DW_AT_name        : (indirect string, offset: 0x91d60): uint32_t
    <a17>   DW_AT_decl_file   : 5
    <a18>   DW_AT_decl_line   : 48
    <a19>   DW_AT_decl_column : 20
    <a1a>   DW_AT_type        : <0x9a4>
 <1><a1e>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <a1f>   DW_AT_type        : <0xa12>
 <1><a23>: Abbrev Number: 10 (DW_TAG_array_type)
    <a24>   DW_AT_type        : <0xa12>
    <a28>   DW_AT_sibling     : <0xa33>
 <2><a2c>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a2d>   DW_AT_type        : <0x9cc>
    <a31>   DW_AT_upper_bound : 1
 <2><a32>: Abbrev Number: 0
 <1><a33>: Abbrev Number: 12 (DW_TAG_structure_type)
    <a34>   DW_AT_byte_size   : 24
    <a35>   DW_AT_decl_file   : 3
    <a36>   DW_AT_decl_line   : 345
    <a38>   DW_AT_decl_column : 9
    <a39>   DW_AT_sibling     : <0xa91>
 <2><a3d>: Abbrev Number: 13 (DW_TAG_member)
    <a3e>   DW_AT_name        : CR
    <a41>   DW_AT_decl_file   : 3
    <a42>   DW_AT_decl_line   : 347
    <a44>   DW_AT_decl_column : 17
    <a45>   DW_AT_type        : <0xa1e>
    <a49>   DW_AT_data_member_location: 0
 <2><a4a>: Abbrev Number: 14 (DW_TAG_member)
    <a4b>   DW_AT_name        : (indirect string, offset: 0x4c8eb): NDTR
    <a4f>   DW_AT_decl_file   : 3
    <a50>   DW_AT_decl_line   : 348
    <a52>   DW_AT_decl_column : 17
    <a53>   DW_AT_type        : <0xa1e>
    <a57>   DW_AT_data_member_location: 4
 <2><a58>: Abbrev Number: 13 (DW_TAG_member)
    <a59>   DW_AT_name        : PAR
    <a5d>   DW_AT_decl_file   : 3
    <a5e>   DW_AT_decl_line   : 349
    <a60>   DW_AT_decl_column : 17
    <a61>   DW_AT_type        : <0xa1e>
    <a65>   DW_AT_data_member_location: 8
 <2><a66>: Abbrev Number: 14 (DW_TAG_member)
    <a67>   DW_AT_name        : (indirect string, offset: 0x53ac9): M0AR
    <a6b>   DW_AT_decl_file   : 3
    <a6c>   DW_AT_decl_line   : 350
    <a6e>   DW_AT_decl_column : 17
    <a6f>   DW_AT_type        : <0xa1e>
    <a73>   DW_AT_data_member_location: 12
 <2><a74>: Abbrev Number: 14 (DW_TAG_member)
    <a75>   DW_AT_name        : (indirect string, offset: 0x6f84f): M1AR
    <a79>   DW_AT_decl_file   : 3
    <a7a>   DW_AT_decl_line   : 351
    <a7c>   DW_AT_decl_column : 17
    <a7d>   DW_AT_type        : <0xa1e>
    <a81>   DW_AT_data_member_location: 16
 <2><a82>: Abbrev Number: 13 (DW_TAG_member)
    <a83>   DW_AT_name        : FCR
    <a87>   DW_AT_decl_file   : 3
    <a88>   DW_AT_decl_line   : 352
    <a8a>   DW_AT_decl_column : 17
    <a8b>   DW_AT_type        : <0xa1e>
    <a8f>   DW_AT_data_member_location: 20
 <2><a90>: Abbrev Number: 0
 <1><a91>: Abbrev Number: 15 (DW_TAG_typedef)
    <a92>   DW_AT_name        : (indirect string, offset: 0xb66a3): DMA_Stream_TypeDef
    <a96>   DW_AT_decl_file   : 3
    <a97>   DW_AT_decl_line   : 353
    <a99>   DW_AT_decl_column : 3
    <a9a>   DW_AT_type        : <0xa33>
 <1><a9e>: Abbrev Number: 12 (DW_TAG_structure_type)
    <a9f>   DW_AT_byte_size   : 40
    <aa0>   DW_AT_decl_file   : 3
    <aa1>   DW_AT_decl_line   : 526
    <aa3>   DW_AT_decl_column : 9
    <aa4>   DW_AT_sibling     : <0xb27>
 <2><aa8>: Abbrev Number: 14 (DW_TAG_member)
    <aa9>   DW_AT_name        : (indirect string, offset: 0xca0b2): MODER
    <aad>   DW_AT_decl_file   : 3
    <aae>   DW_AT_decl_line   : 528
    <ab0>   DW_AT_decl_column : 17
    <ab1>   DW_AT_type        : <0xa1e>
    <ab5>   DW_AT_data_member_location: 0
 <2><ab6>: Abbrev Number: 14 (DW_TAG_member)
    <ab7>   DW_AT_name        : (indirect string, offset: 0xcfee5): OTYPER
    <abb>   DW_AT_decl_file   : 3
    <abc>   DW_AT_decl_line   : 529
    <abe>   DW_AT_decl_column : 17
    <abf>   DW_AT_type        : <0xa1e>
    <ac3>   DW_AT_data_member_location: 4
 <2><ac4>: Abbrev Number: 14 (DW_TAG_member)
    <ac5>   DW_AT_name        : (indirect string, offset: 0xd08ef): OSPEEDR
    <ac9>   DW_AT_decl_file   : 3
    <aca>   DW_AT_decl_line   : 530
    <acc>   DW_AT_decl_column : 17
    <acd>   DW_AT_type        : <0xa1e>
    <ad1>   DW_AT_data_member_location: 8
 <2><ad2>: Abbrev Number: 14 (DW_TAG_member)
    <ad3>   DW_AT_name        : (indirect string, offset: 0xce648): PUPDR
    <ad7>   DW_AT_decl_file   : 3
    <ad8>   DW_AT_decl_line   : 531
    <ada>   DW_AT_decl_column : 17
    <adb>   DW_AT_type        : <0xa1e>
    <adf>   DW_AT_data_member_location: 12
 <2><ae0>: Abbrev Number: 13 (DW_TAG_member)
    <ae1>   DW_AT_name        : IDR
    <ae5>   DW_AT_decl_file   : 3
    <ae6>   DW_AT_decl_line   : 532
    <ae8>   DW_AT_decl_column : 17
    <ae9>   DW_AT_type        : <0xa1e>
    <aed>   DW_AT_data_member_location: 16
 <2><aee>: Abbrev Number: 13 (DW_TAG_member)
    <aef>   DW_AT_name        : ODR
    <af3>   DW_AT_decl_file   : 3
    <af4>   DW_AT_decl_line   : 533
    <af6>   DW_AT_decl_column : 17
    <af7>   DW_AT_type        : <0xa1e>
    <afb>   DW_AT_data_member_location: 20
 <2><afc>: Abbrev Number: 14 (DW_TAG_member)
    <afd>   DW_AT_name        : (indirect string, offset: 0xcbd8b): BSRR
    <b01>   DW_AT_decl_file   : 3
    <b02>   DW_AT_decl_line   : 534
    <b04>   DW_AT_decl_column : 17
    <b05>   DW_AT_type        : <0xa1e>
    <b09>   DW_AT_data_member_location: 24
 <2><b0a>: Abbrev Number: 14 (DW_TAG_member)
    <b0b>   DW_AT_name        : (indirect string, offset: 0xd07df): LCKR
    <b0f>   DW_AT_decl_file   : 3
    <b10>   DW_AT_decl_line   : 535
    <b12>   DW_AT_decl_column : 17
    <b13>   DW_AT_type        : <0xa1e>
    <b17>   DW_AT_data_member_location: 28
 <2><b18>: Abbrev Number: 13 (DW_TAG_member)
    <b19>   DW_AT_name        : AFR
    <b1d>   DW_AT_decl_file   : 3
    <b1e>   DW_AT_decl_line   : 536
    <b20>   DW_AT_decl_column : 17
    <b21>   DW_AT_type        : <0xb37>
    <b25>   DW_AT_data_member_location: 32
 <2><b26>: Abbrev Number: 0
 <1><b27>: Abbrev Number: 10 (DW_TAG_array_type)
    <b28>   DW_AT_type        : <0xa1e>
    <b2c>   DW_AT_sibling     : <0xb37>
 <2><b30>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <b31>   DW_AT_type        : <0x9cc>
    <b35>   DW_AT_upper_bound : 1
 <2><b36>: Abbrev Number: 0
 <1><b37>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <b38>   DW_AT_type        : <0xb27>
 <1><b3c>: Abbrev Number: 15 (DW_TAG_typedef)
    <b3d>   DW_AT_name        : (indirect string, offset: 0xd1696): GPIO_TypeDef
    <b41>   DW_AT_decl_file   : 3
    <b42>   DW_AT_decl_line   : 537
    <b44>   DW_AT_decl_column : 3
    <b45>   DW_AT_type        : <0xa9e>
 <1><b49>: Abbrev Number: 12 (DW_TAG_structure_type)
    <b4a>   DW_AT_byte_size   : 8
    <b4b>   DW_AT_decl_file   : 3
    <b4c>   DW_AT_decl_line   : 586
    <b4e>   DW_AT_decl_column : 9
    <b4f>   DW_AT_sibling     : <0xb6f>
 <2><b53>: Abbrev Number: 13 (DW_TAG_member)
    <b54>   DW_AT_name        : CR
    <b57>   DW_AT_decl_file   : 3
    <b58>   DW_AT_decl_line   : 588
    <b5a>   DW_AT_decl_column : 17
    <b5b>   DW_AT_type        : <0xa1e>
    <b5f>   DW_AT_data_member_location: 0
 <2><b60>: Abbrev Number: 13 (DW_TAG_member)
    <b61>   DW_AT_name        : CSR
    <b65>   DW_AT_decl_file   : 3
    <b66>   DW_AT_decl_line   : 589
    <b68>   DW_AT_decl_column : 17
    <b69>   DW_AT_type        : <0xa1e>
    <b6d>   DW_AT_data_member_location: 4
 <2><b6e>: Abbrev Number: 0
 <1><b6f>: Abbrev Number: 15 (DW_TAG_typedef)
    <b70>   DW_AT_name        : (indirect string, offset: 0xcf9f5): PWR_TypeDef
    <b74>   DW_AT_decl_file   : 3
    <b75>   DW_AT_decl_line   : 590
    <b77>   DW_AT_decl_column : 3
    <b78>   DW_AT_type        : <0xb49>
 <1><b7c>: Abbrev Number: 12 (DW_TAG_structure_type)
    <b7d>   DW_AT_byte_size   : 136
    <b7e>   DW_AT_decl_file   : 3
    <b7f>   DW_AT_decl_line   : 596
    <b81>   DW_AT_decl_column : 9
    <b82>   DW_AT_sibling     : <0xd2a>
 <2><b86>: Abbrev Number: 13 (DW_TAG_member)
    <b87>   DW_AT_name        : CR
    <b8a>   DW_AT_decl_file   : 3
    <b8b>   DW_AT_decl_line   : 598
    <b8d>   DW_AT_decl_column : 17
    <b8e>   DW_AT_type        : <0xa1e>
    <b92>   DW_AT_data_member_location: 0
 <2><b93>: Abbrev Number: 14 (DW_TAG_member)
    <b94>   DW_AT_name        : (indirect string, offset: 0xcf787): PLLCFGR
    <b98>   DW_AT_decl_file   : 3
    <b99>   DW_AT_decl_line   : 599
    <b9b>   DW_AT_decl_column : 17
    <b9c>   DW_AT_type        : <0xa1e>
    <ba0>   DW_AT_data_member_location: 4
 <2><ba1>: Abbrev Number: 14 (DW_TAG_member)
    <ba2>   DW_AT_name        : (indirect string, offset: 0xcf78a): CFGR
    <ba6>   DW_AT_decl_file   : 3
    <ba7>   DW_AT_decl_line   : 600
    <ba9>   DW_AT_decl_column : 17
    <baa>   DW_AT_type        : <0xa1e>
    <bae>   DW_AT_data_member_location: 8
 <2><baf>: Abbrev Number: 13 (DW_TAG_member)
    <bb0>   DW_AT_name        : CIR
    <bb4>   DW_AT_decl_file   : 3
    <bb5>   DW_AT_decl_line   : 601
    <bb7>   DW_AT_decl_column : 17
    <bb8>   DW_AT_type        : <0xa1e>
    <bbc>   DW_AT_data_member_location: 12
 <2><bbd>: Abbrev Number: 14 (DW_TAG_member)
    <bbe>   DW_AT_name        : (indirect string, offset: 0xd00e3): AHB1RSTR
    <bc2>   DW_AT_decl_file   : 3
    <bc3>   DW_AT_decl_line   : 602
    <bc5>   DW_AT_decl_column : 17
    <bc6>   DW_AT_type        : <0xa1e>
    <bca>   DW_AT_data_member_location: 16
 <2><bcb>: Abbrev Number: 14 (DW_TAG_member)
    <bcc>   DW_AT_name        : (indirect string, offset: 0xcac91): AHB2RSTR
    <bd0>   DW_AT_decl_file   : 3
    <bd1>   DW_AT_decl_line   : 603
    <bd3>   DW_AT_decl_column : 17
    <bd4>   DW_AT_type        : <0xa1e>
    <bd8>   DW_AT_data_member_location: 20
 <2><bd9>: Abbrev Number: 14 (DW_TAG_member)
    <bda>   DW_AT_name        : (indirect string, offset: 0xccbb4): AHB3RSTR
    <bde>   DW_AT_decl_file   : 3
    <bdf>   DW_AT_decl_line   : 604
    <be1>   DW_AT_decl_column : 17
    <be2>   DW_AT_type        : <0xa1e>
    <be6>   DW_AT_data_member_location: 24
 <2><be7>: Abbrev Number: 14 (DW_TAG_member)
    <be8>   DW_AT_name        : (indirect string, offset: 0xd136e): RESERVED0
    <bec>   DW_AT_decl_file   : 3
    <bed>   DW_AT_decl_line   : 605
    <bef>   DW_AT_decl_column : 17
    <bf0>   DW_AT_type        : <0xa12>
    <bf4>   DW_AT_data_member_location: 28
 <2><bf5>: Abbrev Number: 14 (DW_TAG_member)
    <bf6>   DW_AT_name        : (indirect string, offset: 0xcac54): APB1RSTR
    <bfa>   DW_AT_decl_file   : 3
    <bfb>   DW_AT_decl_line   : 606
    <bfd>   DW_AT_decl_column : 17
    <bfe>   DW_AT_type        : <0xa1e>
    <c02>   DW_AT_data_member_location: 32
 <2><c03>: Abbrev Number: 14 (DW_TAG_member)
    <c04>   DW_AT_name        : (indirect string, offset: 0xcd535): APB2RSTR
    <c08>   DW_AT_decl_file   : 3
    <c09>   DW_AT_decl_line   : 607
    <c0b>   DW_AT_decl_column : 17
    <c0c>   DW_AT_type        : <0xa1e>
    <c10>   DW_AT_data_member_location: 36
 <2><c11>: Abbrev Number: 14 (DW_TAG_member)
    <c12>   DW_AT_name        : (indirect string, offset: 0xd1378): RESERVED1
    <c16>   DW_AT_decl_file   : 3
    <c17>   DW_AT_decl_line   : 608
    <c19>   DW_AT_decl_column : 17
    <c1a>   DW_AT_type        : <0xa23>
    <c1e>   DW_AT_data_member_location: 40
 <2><c1f>: Abbrev Number: 14 (DW_TAG_member)
    <c20>   DW_AT_name        : (indirect string, offset: 0xca97c): AHB1ENR
    <c24>   DW_AT_decl_file   : 3
    <c25>   DW_AT_decl_line   : 609
    <c27>   DW_AT_decl_column : 17
    <c28>   DW_AT_type        : <0xa1e>
    <c2c>   DW_AT_data_member_location: 48
 <2><c2d>: Abbrev Number: 14 (DW_TAG_member)
    <c2e>   DW_AT_name        : (indirect string, offset: 0xcc34d): AHB2ENR
    <c32>   DW_AT_decl_file   : 3
    <c33>   DW_AT_decl_line   : 610
    <c35>   DW_AT_decl_column : 17
    <c36>   DW_AT_type        : <0xa1e>
    <c3a>   DW_AT_data_member_location: 52
 <2><c3b>: Abbrev Number: 14 (DW_TAG_member)
    <c3c>   DW_AT_name        : (indirect string, offset: 0xcd6a7): AHB3ENR
    <c40>   DW_AT_decl_file   : 3
    <c41>   DW_AT_decl_line   : 611
    <c43>   DW_AT_decl_column : 17
    <c44>   DW_AT_type        : <0xa1e>
    <c48>   DW_AT_data_member_location: 56
 <2><c49>: Abbrev Number: 14 (DW_TAG_member)
    <c4a>   DW_AT_name        : (indirect string, offset: 0xd1382): RESERVED2
    <c4e>   DW_AT_decl_file   : 3
    <c4f>   DW_AT_decl_line   : 612
    <c51>   DW_AT_decl_column : 17
    <c52>   DW_AT_type        : <0xa12>
    <c56>   DW_AT_data_member_location: 60
 <2><c57>: Abbrev Number: 14 (DW_TAG_member)
    <c58>   DW_AT_name        : (indirect string, offset: 0xce4b5): APB1ENR
    <c5c>   DW_AT_decl_file   : 3
    <c5d>   DW_AT_decl_line   : 613
    <c5f>   DW_AT_decl_column : 17
    <c60>   DW_AT_type        : <0xa1e>
    <c64>   DW_AT_data_member_location: 64
 <2><c65>: Abbrev Number: 14 (DW_TAG_member)
    <c66>   DW_AT_name        : (indirect string, offset: 0xcadd0): APB2ENR
    <c6a>   DW_AT_decl_file   : 3
    <c6b>   DW_AT_decl_line   : 614
    <c6d>   DW_AT_decl_column : 17
    <c6e>   DW_AT_type        : <0xa1e>
    <c72>   DW_AT_data_member_location: 68
 <2><c73>: Abbrev Number: 14 (DW_TAG_member)
    <c74>   DW_AT_name        : (indirect string, offset: 0xd138c): RESERVED3
    <c78>   DW_AT_decl_file   : 3
    <c79>   DW_AT_decl_line   : 615
    <c7b>   DW_AT_decl_column : 17
    <c7c>   DW_AT_type        : <0xa23>
    <c80>   DW_AT_data_member_location: 72
 <2><c81>: Abbrev Number: 14 (DW_TAG_member)
    <c82>   DW_AT_name        : (indirect string, offset: 0xd025f): AHB1LPENR
    <c86>   DW_AT_decl_file   : 3
    <c87>   DW_AT_decl_line   : 616
    <c89>   DW_AT_decl_column : 17
    <c8a>   DW_AT_type        : <0xa1e>
    <c8e>   DW_AT_data_member_location: 80
 <2><c8f>: Abbrev Number: 14 (DW_TAG_member)
    <c90>   DW_AT_name        : (indirect string, offset: 0xcbd59): AHB2LPENR
    <c94>   DW_AT_decl_file   : 3
    <c95>   DW_AT_decl_line   : 617
    <c97>   DW_AT_decl_column : 17
    <c98>   DW_AT_type        : <0xa1e>
    <c9c>   DW_AT_data_member_location: 84
 <2><c9d>: Abbrev Number: 14 (DW_TAG_member)
    <c9e>   DW_AT_name        : (indirect string, offset: 0xcf403): AHB3LPENR
    <ca2>   DW_AT_decl_file   : 3
    <ca3>   DW_AT_decl_line   : 618
    <ca5>   DW_AT_decl_column : 17
    <ca6>   DW_AT_type        : <0xa1e>
    <caa>   DW_AT_data_member_location: 88
 <2><cab>: Abbrev Number: 14 (DW_TAG_member)
    <cac>   DW_AT_name        : (indirect string, offset: 0xd1396): RESERVED4
    <cb0>   DW_AT_decl_file   : 3
    <cb1>   DW_AT_decl_line   : 619
    <cb3>   DW_AT_decl_column : 17
    <cb4>   DW_AT_type        : <0xa12>
    <cb8>   DW_AT_data_member_location: 92
 <2><cb9>: Abbrev Number: 14 (DW_TAG_member)
    <cba>   DW_AT_name        : (indirect string, offset: 0xd0571): APB1LPENR
    <cbe>   DW_AT_decl_file   : 3
    <cbf>   DW_AT_decl_line   : 620
    <cc1>   DW_AT_decl_column : 17
    <cc2>   DW_AT_type        : <0xa1e>
    <cc6>   DW_AT_data_member_location: 96
 <2><cc7>: Abbrev Number: 14 (DW_TAG_member)
    <cc8>   DW_AT_name        : (indirect string, offset: 0xcc1e5): APB2LPENR
    <ccc>   DW_AT_decl_file   : 3
    <ccd>   DW_AT_decl_line   : 621
    <ccf>   DW_AT_decl_column : 17
    <cd0>   DW_AT_type        : <0xa1e>
    <cd4>   DW_AT_data_member_location: 100
 <2><cd5>: Abbrev Number: 14 (DW_TAG_member)
    <cd6>   DW_AT_name        : (indirect string, offset: 0xd13a0): RESERVED5
    <cda>   DW_AT_decl_file   : 3
    <cdb>   DW_AT_decl_line   : 622
    <cdd>   DW_AT_decl_column : 17
    <cde>   DW_AT_type        : <0xa23>
    <ce2>   DW_AT_data_member_location: 104
 <2><ce3>: Abbrev Number: 14 (DW_TAG_member)
    <ce4>   DW_AT_name        : (indirect string, offset: 0xcaede): BDCR
    <ce8>   DW_AT_decl_file   : 3
    <ce9>   DW_AT_decl_line   : 623
    <ceb>   DW_AT_decl_column : 17
    <cec>   DW_AT_type        : <0xa1e>
    <cf0>   DW_AT_data_member_location: 112
 <2><cf1>: Abbrev Number: 13 (DW_TAG_member)
    <cf2>   DW_AT_name        : CSR
    <cf6>   DW_AT_decl_file   : 3
    <cf7>   DW_AT_decl_line   : 624
    <cf9>   DW_AT_decl_column : 17
    <cfa>   DW_AT_type        : <0xa1e>
    <cfe>   DW_AT_data_member_location: 116
 <2><cff>: Abbrev Number: 14 (DW_TAG_member)
    <d00>   DW_AT_name        : (indirect string, offset: 0xce86c): RESERVED6
    <d04>   DW_AT_decl_file   : 3
    <d05>   DW_AT_decl_line   : 625
    <d07>   DW_AT_decl_column : 17
    <d08>   DW_AT_type        : <0xa23>
    <d0c>   DW_AT_data_member_location: 120
 <2><d0d>: Abbrev Number: 14 (DW_TAG_member)
    <d0e>   DW_AT_name        : (indirect string, offset: 0xcdfac): SSCGR
    <d12>   DW_AT_decl_file   : 3
    <d13>   DW_AT_decl_line   : 626
    <d15>   DW_AT_decl_column : 17
    <d16>   DW_AT_type        : <0xa1e>
    <d1a>   DW_AT_data_member_location: 128
 <2><d1b>: Abbrev Number: 14 (DW_TAG_member)
    <d1c>   DW_AT_name        : (indirect string, offset: 0xccc24): PLLI2SCFGR
    <d20>   DW_AT_decl_file   : 3
    <d21>   DW_AT_decl_line   : 627
    <d23>   DW_AT_decl_column : 17
    <d24>   DW_AT_type        : <0xa1e>
    <d28>   DW_AT_data_member_location: 132
 <2><d29>: Abbrev Number: 0
 <1><d2a>: Abbrev Number: 15 (DW_TAG_typedef)
    <d2b>   DW_AT_name        : (indirect string, offset: 0xcd8c2): RCC_TypeDef
    <d2f>   DW_AT_decl_file   : 3
    <d30>   DW_AT_decl_line   : 628
    <d32>   DW_AT_decl_column : 3
    <d33>   DW_AT_type        : <0xb7c>
 <1><d37>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d38>   DW_AT_byte_size   : 36
    <d39>   DW_AT_decl_file   : 3
    <d3a>   DW_AT_decl_line   : 710
    <d3c>   DW_AT_decl_column : 9
    <d3d>   DW_AT_sibling     : <0xdbe>
 <2><d41>: Abbrev Number: 13 (DW_TAG_member)
    <d42>   DW_AT_name        : CR1
    <d46>   DW_AT_decl_file   : 3
    <d47>   DW_AT_decl_line   : 712
    <d49>   DW_AT_decl_column : 17
    <d4a>   DW_AT_type        : <0xa1e>
    <d4e>   DW_AT_data_member_location: 0
 <2><d4f>: Abbrev Number: 13 (DW_TAG_member)
    <d50>   DW_AT_name        : CR2
    <d54>   DW_AT_decl_file   : 3
    <d55>   DW_AT_decl_line   : 713
    <d57>   DW_AT_decl_column : 17
    <d58>   DW_AT_type        : <0xa1e>
    <d5c>   DW_AT_data_member_location: 4
 <2><d5d>: Abbrev Number: 13 (DW_TAG_member)
    <d5e>   DW_AT_name        : SR
    <d61>   DW_AT_decl_file   : 3
    <d62>   DW_AT_decl_line   : 714
    <d64>   DW_AT_decl_column : 17
    <d65>   DW_AT_type        : <0xa1e>
    <d69>   DW_AT_data_member_location: 8
 <2><d6a>: Abbrev Number: 13 (DW_TAG_member)
    <d6b>   DW_AT_name        : DR
    <d6e>   DW_AT_decl_file   : 3
    <d6f>   DW_AT_decl_line   : 715
    <d71>   DW_AT_decl_column : 17
    <d72>   DW_AT_type        : <0xa1e>
    <d76>   DW_AT_data_member_location: 12
 <2><d77>: Abbrev Number: 14 (DW_TAG_member)
    <d78>   DW_AT_name        : (indirect string, offset: 0xcbfc2): CRCPR
    <d7c>   DW_AT_decl_file   : 3
    <d7d>   DW_AT_decl_line   : 716
    <d7f>   DW_AT_decl_column : 17
    <d80>   DW_AT_type        : <0xa1e>
    <d84>   DW_AT_data_member_location: 16
 <2><d85>: Abbrev Number: 14 (DW_TAG_member)
    <d86>   DW_AT_name        : (indirect string, offset: 0xce839): RXCRCR
    <d8a>   DW_AT_decl_file   : 3
    <d8b>   DW_AT_decl_line   : 717
    <d8d>   DW_AT_decl_column : 17
    <d8e>   DW_AT_type        : <0xa1e>
    <d92>   DW_AT_data_member_location: 20
 <2><d93>: Abbrev Number: 14 (DW_TAG_member)
    <d94>   DW_AT_name        : (indirect string, offset: 0xcdccf): TXCRCR
    <d98>   DW_AT_decl_file   : 3
    <d99>   DW_AT_decl_line   : 718
    <d9b>   DW_AT_decl_column : 17
    <d9c>   DW_AT_type        : <0xa1e>
    <da0>   DW_AT_data_member_location: 24
 <2><da1>: Abbrev Number: 14 (DW_TAG_member)
    <da2>   DW_AT_name        : (indirect string, offset: 0xccc27): I2SCFGR
    <da6>   DW_AT_decl_file   : 3
    <da7>   DW_AT_decl_line   : 719
    <da9>   DW_AT_decl_column : 17
    <daa>   DW_AT_type        : <0xa1e>
    <dae>   DW_AT_data_member_location: 28
 <2><daf>: Abbrev Number: 14 (DW_TAG_member)
    <db0>   DW_AT_name        : (indirect string, offset: 0xcd97e): I2SPR
    <db4>   DW_AT_decl_file   : 3
    <db5>   DW_AT_decl_line   : 720
    <db7>   DW_AT_decl_column : 17
    <db8>   DW_AT_type        : <0xa1e>
    <dbc>   DW_AT_data_member_location: 32
 <2><dbd>: Abbrev Number: 0
 <1><dbe>: Abbrev Number: 15 (DW_TAG_typedef)
    <dbf>   DW_AT_name        : (indirect string, offset: 0xcbebd): SPI_TypeDef
    <dc3>   DW_AT_decl_file   : 3
    <dc4>   DW_AT_decl_line   : 721
    <dc6>   DW_AT_decl_column : 3
    <dc7>   DW_AT_type        : <0xd37>
 <1><dcb>: Abbrev Number: 12 (DW_TAG_structure_type)
    <dcc>   DW_AT_byte_size   : 84
    <dcd>   DW_AT_decl_file   : 3
    <dce>   DW_AT_decl_line   : 728
    <dd0>   DW_AT_decl_column : 9
    <dd1>   DW_AT_sibling     : <0xefa>
 <2><dd5>: Abbrev Number: 13 (DW_TAG_member)
    <dd6>   DW_AT_name        : CR1
    <dda>   DW_AT_decl_file   : 3
    <ddb>   DW_AT_decl_line   : 730
    <ddd>   DW_AT_decl_column : 17
    <dde>   DW_AT_type        : <0xa1e>
    <de2>   DW_AT_data_member_location: 0
 <2><de3>: Abbrev Number: 13 (DW_TAG_member)
    <de4>   DW_AT_name        : CR2
    <de8>   DW_AT_decl_file   : 3
    <de9>   DW_AT_decl_line   : 731
    <deb>   DW_AT_decl_column : 17
    <dec>   DW_AT_type        : <0xa1e>
    <df0>   DW_AT_data_member_location: 4
 <2><df1>: Abbrev Number: 14 (DW_TAG_member)
    <df2>   DW_AT_name        : (indirect string, offset: 0x3b519): SMCR
    <df6>   DW_AT_decl_file   : 3
    <df7>   DW_AT_decl_line   : 732
    <df9>   DW_AT_decl_column : 17
    <dfa>   DW_AT_type        : <0xa1e>
    <dfe>   DW_AT_data_member_location: 8
 <2><dff>: Abbrev Number: 14 (DW_TAG_member)
    <e00>   DW_AT_name        : (indirect string, offset: 0x4167b): DIER
    <e04>   DW_AT_decl_file   : 3
    <e05>   DW_AT_decl_line   : 733
    <e07>   DW_AT_decl_column : 17
    <e08>   DW_AT_type        : <0xa1e>
    <e0c>   DW_AT_data_member_location: 12
 <2><e0d>: Abbrev Number: 13 (DW_TAG_member)
    <e0e>   DW_AT_name        : SR
    <e11>   DW_AT_decl_file   : 3
    <e12>   DW_AT_decl_line   : 734
    <e14>   DW_AT_decl_column : 17
    <e15>   DW_AT_type        : <0xa1e>
    <e19>   DW_AT_data_member_location: 16
 <2><e1a>: Abbrev Number: 13 (DW_TAG_member)
    <e1b>   DW_AT_name        : EGR
    <e1f>   DW_AT_decl_file   : 3
    <e20>   DW_AT_decl_line   : 735
    <e22>   DW_AT_decl_column : 17
    <e23>   DW_AT_type        : <0xa1e>
    <e27>   DW_AT_data_member_location: 20
 <2><e28>: Abbrev Number: 14 (DW_TAG_member)
    <e29>   DW_AT_name        : (indirect string, offset: 0xb7458): CCMR1
    <e2d>   DW_AT_decl_file   : 3
    <e2e>   DW_AT_decl_line   : 736
    <e30>   DW_AT_decl_column : 17
    <e31>   DW_AT_type        : <0xa1e>
    <e35>   DW_AT_data_member_location: 24
 <2><e36>: Abbrev Number: 14 (DW_TAG_member)
    <e37>   DW_AT_name        : (indirect string, offset: 0x506be): CCMR2
    <e3b>   DW_AT_decl_file   : 3
    <e3c>   DW_AT_decl_line   : 737
    <e3e>   DW_AT_decl_column : 17
    <e3f>   DW_AT_type        : <0xa1e>
    <e43>   DW_AT_data_member_location: 28
 <2><e44>: Abbrev Number: 14 (DW_TAG_member)
    <e45>   DW_AT_name        : (indirect string, offset: 0x31146): CCER
    <e49>   DW_AT_decl_file   : 3
    <e4a>   DW_AT_decl_line   : 738
    <e4c>   DW_AT_decl_column : 17
    <e4d>   DW_AT_type        : <0xa1e>
    <e51>   DW_AT_data_member_location: 32
 <2><e52>: Abbrev Number: 13 (DW_TAG_member)
    <e53>   DW_AT_name        : CNT
    <e57>   DW_AT_decl_file   : 3
    <e58>   DW_AT_decl_line   : 739
    <e5a>   DW_AT_decl_column : 17
    <e5b>   DW_AT_type        : <0xa1e>
    <e5f>   DW_AT_data_member_location: 36
 <2><e60>: Abbrev Number: 13 (DW_TAG_member)
    <e61>   DW_AT_name        : PSC
    <e65>   DW_AT_decl_file   : 3
    <e66>   DW_AT_decl_line   : 740
    <e68>   DW_AT_decl_column : 17
    <e69>   DW_AT_type        : <0xa1e>
    <e6d>   DW_AT_data_member_location: 40
 <2><e6e>: Abbrev Number: 13 (DW_TAG_member)
    <e6f>   DW_AT_name        : ARR
    <e73>   DW_AT_decl_file   : 3
    <e74>   DW_AT_decl_line   : 741
    <e76>   DW_AT_decl_column : 17
    <e77>   DW_AT_type        : <0xa1e>
    <e7b>   DW_AT_data_member_location: 44
 <2><e7c>: Abbrev Number: 13 (DW_TAG_member)
    <e7d>   DW_AT_name        : RCR
    <e81>   DW_AT_decl_file   : 3
    <e82>   DW_AT_decl_line   : 742
    <e84>   DW_AT_decl_column : 17
    <e85>   DW_AT_type        : <0xa1e>
    <e89>   DW_AT_data_member_location: 48
 <2><e8a>: Abbrev Number: 14 (DW_TAG_member)
    <e8b>   DW_AT_name        : (indirect string, offset: 0x18050): CCR1
    <e8f>   DW_AT_decl_file   : 3
    <e90>   DW_AT_decl_line   : 743
    <e92>   DW_AT_decl_column : 17
    <e93>   DW_AT_type        : <0xa1e>
    <e97>   DW_AT_data_member_location: 52
 <2><e98>: Abbrev Number: 14 (DW_TAG_member)
    <e99>   DW_AT_name        : (indirect string, offset: 0x54615): CCR2
    <e9d>   DW_AT_decl_file   : 3
    <e9e>   DW_AT_decl_line   : 744
    <ea0>   DW_AT_decl_column : 17
    <ea1>   DW_AT_type        : <0xa1e>
    <ea5>   DW_AT_data_member_location: 56
 <2><ea6>: Abbrev Number: 14 (DW_TAG_member)
    <ea7>   DW_AT_name        : (indirect string, offset: 0x99751): CCR3
    <eab>   DW_AT_decl_file   : 3
    <eac>   DW_AT_decl_line   : 745
    <eae>   DW_AT_decl_column : 17
    <eaf>   DW_AT_type        : <0xa1e>
    <eb3>   DW_AT_data_member_location: 60
 <2><eb4>: Abbrev Number: 14 (DW_TAG_member)
    <eb5>   DW_AT_name        : (indirect string, offset: 0xc49e): CCR4
    <eb9>   DW_AT_decl_file   : 3
    <eba>   DW_AT_decl_line   : 746
    <ebc>   DW_AT_decl_column : 17
    <ebd>   DW_AT_type        : <0xa1e>
    <ec1>   DW_AT_data_member_location: 64
 <2><ec2>: Abbrev Number: 14 (DW_TAG_member)
    <ec3>   DW_AT_name        : (indirect string, offset: 0x551b8): BDTR
    <ec7>   DW_AT_decl_file   : 3
    <ec8>   DW_AT_decl_line   : 747
    <eca>   DW_AT_decl_column : 17
    <ecb>   DW_AT_type        : <0xa1e>
    <ecf>   DW_AT_data_member_location: 68
 <2><ed0>: Abbrev Number: 13 (DW_TAG_member)
    <ed1>   DW_AT_name        : DCR
    <ed5>   DW_AT_decl_file   : 3
    <ed6>   DW_AT_decl_line   : 748
    <ed8>   DW_AT_decl_column : 17
    <ed9>   DW_AT_type        : <0xa1e>
    <edd>   DW_AT_data_member_location: 72
 <2><ede>: Abbrev Number: 14 (DW_TAG_member)
    <edf>   DW_AT_name        : (indirect string, offset: 0xac7c2): DMAR
    <ee3>   DW_AT_decl_file   : 3
    <ee4>   DW_AT_decl_line   : 749
    <ee6>   DW_AT_decl_column : 17
    <ee7>   DW_AT_type        : <0xa1e>
    <eeb>   DW_AT_data_member_location: 76
 <2><eec>: Abbrev Number: 13 (DW_TAG_member)
    <eed>   DW_AT_name        : OR
    <ef0>   DW_AT_decl_file   : 3
    <ef1>   DW_AT_decl_line   : 750
    <ef3>   DW_AT_decl_column : 17
    <ef4>   DW_AT_type        : <0xa1e>
    <ef8>   DW_AT_data_member_location: 80
 <2><ef9>: Abbrev Number: 0
 <1><efa>: Abbrev Number: 15 (DW_TAG_typedef)
    <efb>   DW_AT_name        : (indirect string, offset: 0xbe4f7): TIM_TypeDef
    <eff>   DW_AT_decl_file   : 3
    <f00>   DW_AT_decl_line   : 751
    <f02>   DW_AT_decl_column : 3
    <f03>   DW_AT_type        : <0xdcb>
 <1><f07>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f08>   DW_AT_byte_size   : 28
    <f09>   DW_AT_decl_file   : 3
    <f0a>   DW_AT_decl_line   : 757
    <f0c>   DW_AT_decl_column : 9
    <f0d>   DW_AT_sibling     : <0xf72>
 <2><f11>: Abbrev Number: 13 (DW_TAG_member)
    <f12>   DW_AT_name        : SR
    <f15>   DW_AT_decl_file   : 3
    <f16>   DW_AT_decl_line   : 759
    <f18>   DW_AT_decl_column : 17
    <f19>   DW_AT_type        : <0xa1e>
    <f1d>   DW_AT_data_member_location: 0
 <2><f1e>: Abbrev Number: 13 (DW_TAG_member)
    <f1f>   DW_AT_name        : DR
    <f22>   DW_AT_decl_file   : 3
    <f23>   DW_AT_decl_line   : 760
    <f25>   DW_AT_decl_column : 17
    <f26>   DW_AT_type        : <0xa1e>
    <f2a>   DW_AT_data_member_location: 4
 <2><f2b>: Abbrev Number: 13 (DW_TAG_member)
    <f2c>   DW_AT_name        : BRR
    <f30>   DW_AT_decl_file   : 3
    <f31>   DW_AT_decl_line   : 761
    <f33>   DW_AT_decl_column : 17
    <f34>   DW_AT_type        : <0xa1e>
    <f38>   DW_AT_data_member_location: 8
 <2><f39>: Abbrev Number: 13 (DW_TAG_member)
    <f3a>   DW_AT_name        : CR1
    <f3e>   DW_AT_decl_file   : 3
    <f3f>   DW_AT_decl_line   : 762
    <f41>   DW_AT_decl_column : 17
    <f42>   DW_AT_type        : <0xa1e>
    <f46>   DW_AT_data_member_location: 12
 <2><f47>: Abbrev Number: 13 (DW_TAG_member)
    <f48>   DW_AT_name        : CR2
    <f4c>   DW_AT_decl_file   : 3
    <f4d>   DW_AT_decl_line   : 763
    <f4f>   DW_AT_decl_column : 17
    <f50>   DW_AT_type        : <0xa1e>
    <f54>   DW_AT_data_member_location: 16
 <2><f55>: Abbrev Number: 13 (DW_TAG_member)
    <f56>   DW_AT_name        : CR3
    <f5a>   DW_AT_decl_file   : 3
    <f5b>   DW_AT_decl_line   : 764
    <f5d>   DW_AT_decl_column : 17
    <f5e>   DW_AT_type        : <0xa1e>
    <f62>   DW_AT_data_member_location: 20
 <2><f63>: Abbrev Number: 14 (DW_TAG_member)
    <f64>   DW_AT_name        : (indirect string, offset: 0xcc437): GTPR
    <f68>   DW_AT_decl_file   : 3
    <f69>   DW_AT_decl_line   : 765
    <f6b>   DW_AT_decl_column : 17
    <f6c>   DW_AT_type        : <0xa1e>
    <f70>   DW_AT_data_member_location: 24
 <2><f71>: Abbrev Number: 0
 <1><f72>: Abbrev Number: 15 (DW_TAG_typedef)
    <f73>   DW_AT_name        : (indirect string, offset: 0xd1836): USART_TypeDef
    <f77>   DW_AT_decl_file   : 3
    <f78>   DW_AT_decl_line   : 766
    <f7a>   DW_AT_decl_column : 3
    <f7b>   DW_AT_type        : <0xf07>
 <1><f7f>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <f80>   DW_AT_encoding    : 7	(unsigned)
    <f81>   DW_AT_byte_size   : 1
    <f82>   DW_AT_type        : <0x970>
    <f86>   DW_AT_decl_file   : 6
    <f87>   DW_AT_decl_line   : 185
    <f88>   DW_AT_decl_column : 1
    <f89>   DW_AT_sibling     : <0xf9a>
 <2><f8d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f8e>   DW_AT_name        : (indirect string, offset: 0xb2139): RESET
    <f92>   DW_AT_const_value : 0
 <2><f93>: Abbrev Number: 16 (DW_TAG_enumerator)
    <f94>   DW_AT_name        : SET
    <f98>   DW_AT_const_value : 1
 <2><f99>: Abbrev Number: 0
 <1><f9a>: Abbrev Number: 6 (DW_TAG_typedef)
    <f9b>   DW_AT_name        : (indirect string, offset: 0x84d4): size_t
    <f9f>   DW_AT_decl_file   : 7
    <fa0>   DW_AT_decl_line   : 209
    <fa1>   DW_AT_decl_column : 23
    <fa2>   DW_AT_type        : <0x9cc>
 <1><fa6>: Abbrev Number: 5 (DW_TAG_base_type)
    <fa7>   DW_AT_byte_size   : 8
    <fa8>   DW_AT_encoding    : 4	(float)
    <fa9>   DW_AT_name        : (indirect string, offset: 0xcb7ad): long double
 <1><fad>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <fae>   DW_AT_encoding    : 7	(unsigned)
    <faf>   DW_AT_byte_size   : 1
    <fb0>   DW_AT_type        : <0x970>
    <fb4>   DW_AT_decl_file   : 8
    <fb5>   DW_AT_decl_line   : 39
    <fb6>   DW_AT_decl_column : 1
    <fb7>   DW_AT_sibling     : <0xfd4>
 <2><fbb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fbc>   DW_AT_name        : (indirect string, offset: 0x44173): HAL_OK
    <fc0>   DW_AT_const_value : 0
 <2><fc1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fc2>   DW_AT_name        : (indirect string, offset: 0x7deb9): HAL_ERROR
    <fc6>   DW_AT_const_value : 1
 <2><fc7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fc8>   DW_AT_name        : (indirect string, offset: 0x2375e): HAL_BUSY
    <fcc>   DW_AT_const_value : 2
 <2><fcd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fce>   DW_AT_name        : (indirect string, offset: 0x3b462): HAL_TIMEOUT
    <fd2>   DW_AT_const_value : 3
 <2><fd3>: Abbrev Number: 0
 <1><fd4>: Abbrev Number: 6 (DW_TAG_typedef)
    <fd5>   DW_AT_name        : (indirect string, offset: 0x2345): HAL_StatusTypeDef
    <fd9>   DW_AT_decl_file   : 8
    <fda>   DW_AT_decl_line   : 44
    <fdb>   DW_AT_decl_column : 3
    <fdc>   DW_AT_type        : <0xfad>
 <1><fe0>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <fe1>   DW_AT_encoding    : 7	(unsigned)
    <fe2>   DW_AT_byte_size   : 1
    <fe3>   DW_AT_type        : <0x970>
    <fe7>   DW_AT_decl_file   : 8
    <fe8>   DW_AT_decl_line   : 50
    <fe9>   DW_AT_decl_column : 1
    <fea>   DW_AT_sibling     : <0xffb>
 <2><fee>: Abbrev Number: 4 (DW_TAG_enumerator)
    <fef>   DW_AT_name        : (indirect string, offset: 0x948c5): HAL_UNLOCKED
    <ff3>   DW_AT_const_value : 0
 <2><ff4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ff5>   DW_AT_name        : (indirect string, offset: 0xc9286): HAL_LOCKED
    <ff9>   DW_AT_const_value : 1
 <2><ffa>: Abbrev Number: 0
 <1><ffb>: Abbrev Number: 6 (DW_TAG_typedef)
    <ffc>   DW_AT_name        : (indirect string, offset: 0x76fa3): HAL_LockTypeDef
    <1000>   DW_AT_decl_file   : 8
    <1001>   DW_AT_decl_line   : 53
    <1002>   DW_AT_decl_column : 3
    <1003>   DW_AT_type        : <0xfe0>
 <1><1007>: Abbrev Number: 17 (DW_TAG_structure_type)
    <1008>   DW_AT_byte_size   : 24
    <1009>   DW_AT_decl_file   : 9
    <100a>   DW_AT_decl_line   : 45
    <100b>   DW_AT_decl_column : 9
    <100c>   DW_AT_sibling     : <0x105f>
 <2><1010>: Abbrev Number: 18 (DW_TAG_member)
    <1011>   DW_AT_name        : (indirect string, offset: 0xcf30b): PLLState
    <1015>   DW_AT_decl_file   : 9
    <1016>   DW_AT_decl_line   : 47
    <1017>   DW_AT_decl_column : 12
    <1018>   DW_AT_type        : <0xa12>
    <101c>   DW_AT_data_member_location: 0
 <2><101d>: Abbrev Number: 18 (DW_TAG_member)
    <101e>   DW_AT_name        : (indirect string, offset: 0xcf6e3): PLLSource
    <1022>   DW_AT_decl_file   : 9
    <1023>   DW_AT_decl_line   : 50
    <1024>   DW_AT_decl_column : 12
    <1025>   DW_AT_type        : <0xa12>
    <1029>   DW_AT_data_member_location: 4
 <2><102a>: Abbrev Number: 18 (DW_TAG_member)
    <102b>   DW_AT_name        : (indirect string, offset: 0xd03d8): PLLM
    <102f>   DW_AT_decl_file   : 9
    <1030>   DW_AT_decl_line   : 53
    <1031>   DW_AT_decl_column : 12
    <1032>   DW_AT_type        : <0xa12>
    <1036>   DW_AT_data_member_location: 8
 <2><1037>: Abbrev Number: 18 (DW_TAG_member)
    <1038>   DW_AT_name        : (indirect string, offset: 0xd03dd): PLLN
    <103c>   DW_AT_decl_file   : 9
    <103d>   DW_AT_decl_line   : 56
    <103e>   DW_AT_decl_column : 12
    <103f>   DW_AT_type        : <0xa12>
    <1043>   DW_AT_data_member_location: 12
 <2><1044>: Abbrev Number: 18 (DW_TAG_member)
    <1045>   DW_AT_name        : (indirect string, offset: 0xd03e2): PLLP
    <1049>   DW_AT_decl_file   : 9
    <104a>   DW_AT_decl_line   : 60
    <104b>   DW_AT_decl_column : 12
    <104c>   DW_AT_type        : <0xa12>
    <1050>   DW_AT_data_member_location: 16
 <2><1051>: Abbrev Number: 18 (DW_TAG_member)
    <1052>   DW_AT_name        : (indirect string, offset: 0x4b0f1): PLLQ
    <1056>   DW_AT_decl_file   : 9
    <1057>   DW_AT_decl_line   : 63
    <1058>   DW_AT_decl_column : 12
    <1059>   DW_AT_type        : <0xa12>
    <105d>   DW_AT_data_member_location: 20
 <2><105e>: Abbrev Number: 0
 <1><105f>: Abbrev Number: 6 (DW_TAG_typedef)
    <1060>   DW_AT_name        : (indirect string, offset: 0xce913): RCC_PLLInitTypeDef
    <1064>   DW_AT_decl_file   : 9
    <1065>   DW_AT_decl_line   : 73
    <1066>   DW_AT_decl_column : 2
    <1067>   DW_AT_type        : <0x1007>
 <1><106b>: Abbrev Number: 17 (DW_TAG_structure_type)
    <106c>   DW_AT_byte_size   : 48
    <106d>   DW_AT_decl_file   : 10
    <106e>   DW_AT_decl_line   : 49
    <106f>   DW_AT_decl_column : 9
    <1070>   DW_AT_sibling     : <0x10d0>
 <2><1074>: Abbrev Number: 18 (DW_TAG_member)
    <1075>   DW_AT_name        : (indirect string, offset: 0xd0220): OscillatorType
    <1079>   DW_AT_decl_file   : 10
    <107a>   DW_AT_decl_line   : 51
    <107b>   DW_AT_decl_column : 12
    <107c>   DW_AT_type        : <0xa12>
    <1080>   DW_AT_data_member_location: 0
 <2><1081>: Abbrev Number: 18 (DW_TAG_member)
    <1082>   DW_AT_name        : (indirect string, offset: 0xcf465): HSEState
    <1086>   DW_AT_decl_file   : 10
    <1087>   DW_AT_decl_line   : 54
    <1088>   DW_AT_decl_column : 12
    <1089>   DW_AT_type        : <0xa12>
    <108d>   DW_AT_data_member_location: 4
 <2><108e>: Abbrev Number: 18 (DW_TAG_member)
    <108f>   DW_AT_name        : (indirect string, offset: 0xcebc9): LSEState
    <1093>   DW_AT_decl_file   : 10
    <1094>   DW_AT_decl_line   : 57
    <1095>   DW_AT_decl_column : 12
    <1096>   DW_AT_type        : <0xa12>
    <109a>   DW_AT_data_member_location: 8
 <2><109b>: Abbrev Number: 18 (DW_TAG_member)
    <109c>   DW_AT_name        : (indirect string, offset: 0xcd633): HSIState
    <10a0>   DW_AT_decl_file   : 10
    <10a1>   DW_AT_decl_line   : 60
    <10a2>   DW_AT_decl_column : 12
    <10a3>   DW_AT_type        : <0xa12>
    <10a7>   DW_AT_data_member_location: 12
 <2><10a8>: Abbrev Number: 18 (DW_TAG_member)
    <10a9>   DW_AT_name        : (indirect string, offset: 0xd0841): HSICalibrationValue
    <10ad>   DW_AT_decl_file   : 10
    <10ae>   DW_AT_decl_line   : 63
    <10af>   DW_AT_decl_column : 12
    <10b0>   DW_AT_type        : <0xa12>
    <10b4>   DW_AT_data_member_location: 16
 <2><10b5>: Abbrev Number: 18 (DW_TAG_member)
    <10b6>   DW_AT_name        : (indirect string, offset: 0xccda4): LSIState
    <10ba>   DW_AT_decl_file   : 10
    <10bb>   DW_AT_decl_line   : 66
    <10bc>   DW_AT_decl_column : 12
    <10bd>   DW_AT_type        : <0xa12>
    <10c1>   DW_AT_data_member_location: 20
 <2><10c2>: Abbrev Number: 19 (DW_TAG_member)
    <10c3>   DW_AT_name        : PLL
    <10c7>   DW_AT_decl_file   : 10
    <10c8>   DW_AT_decl_line   : 69
    <10c9>   DW_AT_decl_column : 22
    <10ca>   DW_AT_type        : <0x105f>
    <10ce>   DW_AT_data_member_location: 24
 <2><10cf>: Abbrev Number: 0
 <1><10d0>: Abbrev Number: 6 (DW_TAG_typedef)
    <10d1>   DW_AT_name        : (indirect string, offset: 0xcdfb2): RCC_OscInitTypeDef
    <10d5>   DW_AT_decl_file   : 10
    <10d6>   DW_AT_decl_line   : 70
    <10d7>   DW_AT_decl_column : 2
